{
    "subject": "Cognitive Science",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                91 Questions",
            "Question": [
                "1. Compare cognitive science with sociology and explain it with examples. Differentiate between linguistics of artificial intelligence?",
                "1. Define the cognitive science and its applications in computer science. Compare cognitive science with other science.",
                "1. Explain the cognitive science and its applications.",
                "1. What is cognitive science? Differentiate between cognitive science and other science.",
                "1. How can you define connectionist computational cognitive science model? How far theories and principles of psychology are interrelated to the cognitive science theories?",
                "1. Why cognitive science is important in the computer science? Compare it with philosophy and explain it with suitable examples.",
                "1. Define cognitive science with two examples. Compare it with psychology and explain with suitable example.",
                "2. Explain the architecture of an expert system and its applicability in different areas.",
                "2. Differentiate between think humanly and act humanly with suitable examples. What are the applications of artificial intelligence?",
                "2. Explain and state the characteristics of AI problem and also explain the first characteristic with suitable example.",
                "2. How Descartes justified mind-body problem with his popular wax argument? What was the response of Turing to his demonstration?",
                "2. Define and explain artificial intelligence. Act rationally is an important part of artificial intelligence. justify it with suitable example.",
                "1. Define the cognitive science. How symbolic computational cognitive science differs from the connectionist computational cognitive science?",
                "2. Explain the artificial intelligence task domains with example.",
                "1. What is mind body problem? Discuss about the Pinker, Penerose and Searle’s response to mind body problem [3+7]",
                "3. Knowledge can be represented with if then rules, explain it with two practical examples.",
                "3. Explain the steps involved in building a system to solve an artificial intelligence problem.",
                "3. The object based system can represent knowledge, explain it with practical examples.",
                "3. How important computation is in cognitive science? What components a Physical Symbol System (PSS) consists of? Construct a PSS for Arithmetic Computation.",
                "2. What do you mean by informed search? Explain the influence of heuristic functions in inform search algorithms. Show how heuristic is used in A* search?",
                "3. Explain the various approaches and issues in knowledge representation and also explain the various problems in representing knowledge.",
                "3. What do you mean by first order predicate logic? Explain it with practical example.",
                "3. Explain the A* algorithm with example.",
                "4. Explain the algorithm of breadth first search with suitable example. How can you modify it, explain.ORWhat do you mean by A* search? Explain it with an algorithm and suitable example.",
                "4. Explain with example of depth first search. What are the benefits of using depth first search?ORExplain with example of Breadth first search and its benifits.",
                "4. Differentiate between depth first search and breadth first search with example.OR Differentiate between hill-climbing search and A* search with example.",
                "2. What is physical symbol system? Illustrate with example. Discuss about the Fodor’s argument for language of thought hypothesis. [4+6]",
                "3. Define knowledge representation. Explain the properties of knowledge representation system. How knowledge can be represented using frames?",
                "4. The searching can be represented using tree. Explain the algorithm of depth first search with suitable example.ORHill-climbing search is a heuristic search, justify it along with algorithm and practical example.",
                "4. What do you mean by AO* algorithm? Explain with example.ORDifferentiate between procedural and declarative knowledge.",
                "4. Differentiate between procedural and declaration knowledge with an example.ORExplain A* search algorithm with example.",
                "4. Define elements of a computing model. Why Turing machine are considered as a useful model to the real computers?",
                "5. What do you understand by Turing machine? Design a Turing machine with finite set of states as q0 and q1, alphabets are 'a' and 'b', initial state is q0 and assume 6 suitable transitions.",
                "5. Explain briefly the key difference between procedural and declaration knowledge.",
                "3. What is visuospatial attention? Mention the hypotheses about visuospatial attention. Describe about the standard and radical simulations of mind reading. [2+3+5]",
                "5. Design a Turing machine with finite set of states as q0 and q1, alphabets are 'a', 'b' and 'c', initial state is q0 and assume 5 suitable transitions. What are the practical applications of Turing machine?",
                "4. Describe about  Marr's three level of information processing with suitable example.",
                "5. How Artificial Neural Networks can exploit the self-Organization capability? Construct a multilayer recurrent neural network with at least six neuron nodes. Allocate the required input, weights and activation function with your own assumption. Finally, compute the mathematical expression for final output of the network.",
                "5. Explain with block diagram of the components of a typical expert system.",
                "5. Why Turing machine is required? Design a Turing machine with finite west of states as q0, q1, and q2, alphabets are \"a\" and \"b\", initial state is q0 and assume 5 with suitable examples.",
                "6. Explain the basic model for computation with suitable practical example.",
                "6. How morphological analysis is done? In language understanding models, how ambiguities in languages can be addressed by pragmatic analysis?",
                "5. List out the different rules in Resolution Algorithm. Consider the knowledge base given as: Prove 7q can be inferred from above KB by using resolution.",
                "6. Differentiate between depth-first and breadth first search with example.",
                "6. Differentiate between types I and type II Chomsky hierarchies with examples. Explain the role of Chomsky hierarchy in the computation?",
                "6. Explain the various approaches and issues in knowlegde representation with example.",
                "5. Explain the breadth first search technique with example and also explain the benefits of it.",
                "6. List down the all Chomsky hierarchies. Explain in detail about type 0 with practical examples.",
                "6. Derive the mathematical model of neural network system with example and also explain about its importance.",
                "7. Explain the mathematical model of neural network system with suitable example. Also explain the importance of neural networks.",
                "7. Explain the biological neuron. Explain the mathematical model of neural network system with suitable example.",
                "7. What do you mean by Qualia? How Gelernter uses this term to define consiousness? What was his response to mind-body problem?",
                "7. Explain the AO* algorithm and its application.",
                "6. Explain the Chomsky hierarchy of grammar with suitable examples.",
                "7. What are the importance of neural network? Explain the mathematical model of neural network system with suitable example.",
                "7. Explain the Turing machine with suitable example.",
                "8. Explain the perceptron with suitable suitable practical example and algorithm.",
                "8. Explain the back propagation practical example and algorithm.",
                "8. What do you mean by Hebbian Learning? Explain it with suitable practical example and algorithm.",
                "8. Mention the types of all Chomsky hierarchies and explain two of them with practical example.",
                "7. What are the steps in natural language processing? List and explain them briefly.",
                "8. Explain the suitable example how Turing machine works?",
                "4. Discuss Marr’s three level of computation. Support your answer with example. [5]",
                "8. Why learning is important in Neural Network? How Hebbian Learning can be used to train Neural Networks? Illustrate with an example?",
                "7. Explain about information Processing. How store model and sensory registers are used in the processing?",
                "8. Explain John Searle approach in the cognitive science. What is its relation with Descartes.Explain with example.",
                "8. Explain the Chomsky Hierarchy with example.",
                "9. Define the terms: a) Gelernterb) Pinker",
                "9. Define the terms:a) Pinkerb) Searle",
                "5. Describe cognition, cognitive psychology and cognitive science. [5]",
                "9. Explain penrose approach in the cognitive science. What is its relation with Descartes, explain with suitable example.",
                "9. How hill climbing search works in a state space? How can you say that hill climbing search is not complete? Support your answer with an example. Configure the required state space and assign the heuristic with your own assumptions.",
                "9. Explain Searle approach in the cognitive science. What is its relation with Descartes, explain with example.",
                "9. Explain Gelernter approach in the cognitive science. What is its relation with Descartes, explain with suitable example.",
                "9. Explain the pinker approach in the cognitive science. What is its relation with Descartes? Explain.",
                "6. What is Cognitive Model of Memory? Describe about the Atkinson-Shiffrin’s Model. [1+4]",
                "10. List down the steps in natural language processing and explain them briefly.ORWhat are the parameters of natural language processing? Explain syntax with suitable example.",
                "10. Why lexicon and morphology are required in natural language processing, explain suitable example?ORWhat are the parameters of language processing? Explain in detail about syntax with suitable example.",
                "10. How can you generate parse tree in the natural language processing? Explain it with example.ORDifferentiate between syntax and semantics in the natural language processing? How can you modify it with pragmatic approach?",
                "10. Explain the parameters of natural language processing with its syntax and suitable example.ORMention the steps of natural language processing and explain them in briefly.",
                "10. Differentiate between natural language understanding and generating with suitable example.ORList the parameters of natural language processing. Explain in detail about auditory inputs with suitable example.",
                "9. What are the parameters of language processing? Explain.Or Why lexicon and morphology are required in natural language processing, explain suitable example?",
                "10. What do you mean by inferential adequacy property of knowledge representation system? How resolution can be used to infer conclusions in predicate logic? Mention the steps with an example.",
                "10. Why lexicon and morphology are needed in natural language processing? Explain with example.ORExplain the parameter of natural language processing with its syntax and example.",
                "7. Describe the Chinese room argument. Justify whether Chinese room problem passes Turing Test? [3+2]",
                "10. Write short note on:i) Back propagationii) Stages of Expert System Development",
                "8. How goal based agent are different from simple reflex agents? [5]",
                "9. Discuss about the ACT-R/PM cognitive architecture. [5]",
                "10. How mapping of the brain’s electrical activity is done with EEG and MEG? [5]",
                "11. Describe the Baron-Cohen’s Model of mind reading system. [5]",
                "12. What is neural network? Describe about the multilayer neural network. [2+3]"
            ],
            "Asked": [
                "10 marks Asked in 2067II",
                "10 marks Asked in 2070",
                "10 marks Asked in 2069",
                "10 marks Asked in 2071",
                "10 marks Asked in 2072",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2068",
                "10 marks Asked in 2070",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2071",
                "10 marks Asked in 2072",
                "10 marks Asked in 2067(old)",
                "6 marks Asked in 2076",
                "10 marks Asked in 2069",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "10 marks Asked in 2067(old)",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "10 marks Asked in 2070",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2071",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2071",
                "10 marks Asked in 2067II",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2076",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "10 marks Asked in 2070",
                "6 marks Asked in 2072",
                "10 marks Asked in 2068",
                "10 marks Asked in 2071",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2067II",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "10 marks Asked in 2069",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2068",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "10 marks Asked in 2069",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2071",
                "10 marks Asked in 2070",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2070",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2067II",
                "6 marks Asked in 2072",
                "10 marks Asked in 2071",
                "6 marks Asked in 2076",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "10 marks Asked in 2070",
                "10 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2076",
                "10 marks Asked in 2070",
                "10 marks Asked in 2069",
                "10 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "10 marks Asked in 2067(old)",
                "6 marks Asked in 2072",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2068",
                "10 marks Asked in 2070",
                "5 marks Asked in ModelQuestion",
                "10 marks Asked in 2071",
                "10 marks Asked in 2067(old)",
                "10 marks Asked in 2067II",
                "10 marks Asked in 2069",
                "10 marks Asked in 2068",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "10 marks Asked in 2070",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 2: Precursors of Cognitive Science \n                                            \n\n                                                1 Questions",
            "Question": [
                "2. Explain briefly the background of artificial intelligence. The rational thinking is important in artificial, justify it with suitable example."
            ],
            "Asked": [
                "10 marks Asked in 2068"
            ]
        },
        {
            "Chapter": "Unit 3: Psycological Perspective of Cognition \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Physical Symbol System and Language of Thought \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Cognitive System \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 6: Brain Mapping \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 7: Mind Reading \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 8: Neural Networks and Distributed Information Processing \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}