{
    "subject": "Geographical Information System",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                29 Questions",
            "Question": [
                "1. What is GIS? Explain the use of GIS in newly formed Municipality/Rural municipality under new federal system in Nepal. How do you suggest to use for their planning work.",
                "1. What is Geographical information system (GIS) ? Explain the various components of GIS.",
                "1. Briefly explain the concept of GIS. What are the various components of GIS. How GIS can help for transport planning and traffic management.",
                "1. Write down the major differences between general database management system and\r\nGIS.",
                "1. Define GIS as an Information System. How a country like Nepal can benefit from GIS? Describe its application in Agriculture.",
                "1. Explain the history development of GIS. What are the application of GIS?",
                "1. Explain the GIS application and its benefits.",
                "1.  Explain the importance and applications of GIS. What will be your sound role in GIS Development for Nepal?",
                "2. Explain the various applications with suitable examples of GIS in Municipality.",
                "1. Define GIS. Describe the role of GIS in a mountainous country like Nepal. Support your answer with a reference of an application.",
                "2. What is your definition about Geographic phenomena? Explain the phenomena types relating with boundaries.",
                "3. Differentiate between vector and raster data structure. How do you implement irregular tessellation to form region quad tree. Explain with example.",
                "3. What is remote sensing? Explain the components of remote sensing with diagram.",
                "4. How do you capture data for GIS? Briefly describe the operation of GPS system.",
                "4. How do you understand Earth Feature? Explain how GIS represents the earth features.",
                "5. What is spatial overlay operator? Explain neighborhood functions that are being implemented in GIS software for analysis.",
                "6. Explain cartographic communication process with its diagram.  What are the components that make a map output attractive?",
                "5. What is geocoding? Explain spatial analysis with an example.",
                "8. Write short notes on any two (a) Spatial Data Model vs GIS Topology (b) Buffer and Overlaying (c) Datum vs Projection",
                "8. Write short note on [5+5]\r\na. Map resolution\r\nb. SDI",
                "7. Explain how does a clearinghouse works? What problems do you face during the spatial data sharing?",
                "6. What are main sources of GIS Data? Explain the various methods of data capture in GIS.",
                "8. Write short note on (any two) [5+5]     (a) Map layers.     (b) Digital terrain model     (c) ITRS     (d) Buffering",
                "8.  Write notes on (any two)a.)   ITRS/ITRF for Geo-Conferencingb.)   Spatial data qualityc.)   GIS in Nepal Prospects and Challengesd.)   Buffer Zone Generation",
                "8. Write short note on (any two)      (a) DTM     (b) Remote Sensing Data     (c) Open GIS     (d) Layer",
                "8. Write short note on (any two) [5+5]     (a) Functional Component of GIS     (b) UTM     (c) Map Elements     (d) Open GIS",
                "7. What is projection? What are three basic techniques used to create a projection. Explain.",
                "8. Write short notes on (any two): (a) Precision vs Accuracy (b) Buffer and Overlaying (c) GPS vs GIS",
                "8. Write short notes ona. Raster data and Vector datab. GPS"
            ],
            "Asked": [
                "10 marks Asked in 2075",
                "10 marks Asked in 2078",
                "10 marks Asked in 2076",
                "10 marks Asked in 2074",
                "10 marks Asked in 2073",
                "10 marks Asked in 2072",
                "10 marks Asked in 2069",
                "10 marks Asked in Model",
                "10 marks Asked in 2078",
                "10 marks Asked in 2071",
                "10 marks Asked in Model",
                "10 marks Asked in Model",
                "10 marks Asked in 2078",
                "10 marks Asked in Model",
                "10 marks Asked in 2078",
                "10 marks Asked in Model",
                "10 marks Asked in Model",
                "10 marks Asked in 2078",
                "10 marks Asked in 2076",
                "10 marks Asked in 2074",
                "10 marks Asked in Model",
                "10 marks Asked in 2078",
                "10 marks Asked in 2072",
                "10 marks Asked in Model",
                "10 marks Asked in 2071",
                "10 marks Asked in 2073",
                "10 marks Asked in 2078",
                "10 marks Asked in 2075",
                "10 marks Asked in 2078"
            ]
        },
        {
            "Chapter": "Unit 2: Digital mapping concept \n                                            \n\n                                                10 Questions",
            "Question": [
                "2. Why do we need map in GIS? Explain the elements of MAP in brief.",
                "2. Define Datum? What does it mean that Nepal Lies in UTM Zone 45N? Explain.",
                "2. Explain the mapping projection with example.",
                "2. What are various coordinate system used in GIS application? Describe them in brief.",
                "2. Why digital mapping is necessary in GIS? Explain with practical example.",
                "2. What is distortion? Describe various types of Map Projection along with free hand drawing.",
                "5. List and describe the major map components.",
                "4. What is projection? How it is different from MAP? Explain Scale Factor.",
                "6. what is Scale Factor? What are different types of distortion in projections.",
                "7. What is distortion in projection? What are different types of distortion in projections."
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "10 marks Asked in 2074",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071",
                "10 marks Asked in 2069",
                "10 marks Asked in 2073",
                "10 marks Asked in 2074",
                "10 marks Asked in 2075",
                "10 marks Asked in 2076",
                "10 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 3: spatial data modeling and database design \n                                            \n\n                                                11 Questions",
            "Question": [
                "2. what do you understand by Spatial Data Model? Differentiate between Coordinate system and Projection system.",
                "3. What do you understand by earth features? What are the different data models of representating the earth features.",
                "3. What do you mean by Digital Surface Model (DSM) ?Explain With example its\r\napplication",
                "3. Differentiate between geographic phenomena and data modeling.",
                "3. What are raster and vector data? Differentiate between their properties with advantages and disadvantages.",
                "3. Explain the spatial modeling with example.",
                "3. What are raster an vector data? Differentiate between their properties with advantages and disadvantages.",
                "3. What do you userstand by earth features? What are the different data models of representing the earth features.",
                "4. What do you mean by spatial data modelling? Explain spatial data types. What is geocoding? Explain spatial analysis with example.",
                "4. Explain the spatial database design with example.",
                "6. Define Geo Database. Explain characteristics of a good database design."
            ],
            "Asked": [
                "10 marks Asked in 2075",
                "10 marks Asked in 2076",
                "10 marks Asked in 2074",
                "10 marks Asked in 2069",
                "10 marks Asked in 2073",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071",
                "10 marks Asked in 2075",
                "10 marks Asked in 2076",
                "10 marks Asked in 2069",
                "10 marks Asked in 2073"
            ]
        },
        {
            "Chapter": "Unit 4: capturing the real world \n                                            \n\n                                                8 Questions",
            "Question": [
                "4. List down the various sources of GIS data .Explain any three of them in brief.",
                "4. Explain the GPS and remote sensing with example.",
                "4. What are various sources of GIS data? Describe methods of data capture.",
                "4. What are various sources of GIS data? Describe methods of data capture.",
                "5. What is remote sensing? Explain the components of remote sensing with diagram.",
                "6. What Location based services have you noticed in Location based services have you\r\nnoticed in your everyday life? Describe the role of GPS in modern World.",
                "5. What d you mean by spatial reference? Explain the quality aspects of spatial data?",
                "6. What is GPS? How does it work? What are various types of errors related to GPS data?"
            ],
            "Asked": [
                "10 marks Asked in 2074",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071",
                "10 marks Asked in 2073",
                "10 marks Asked in 2076",
                "10 marks Asked in 2074",
                "10 marks Asked in 2069",
                "10 marks Asked in 2071"
            ]
        },
        {
            "Chapter": "Unit 5: spatial analysis and visualization \n                                            \n\n                                                4 Questions",
            "Question": [
                "5. What is a spatial overlay operator? Explain neighborhood functions that are being implemented in GIS software for analysis.",
                "5. Why is spatial analysis important during the GIS implementation? Explain.",
                "5. What do you mean by spatial analysis? How do you perform the raster overlay operation using relational operators? Explain with example.",
                "5. What is geocoding? Explain spatial analysis with example."
            ],
            "Asked": [
                "10 marks Asked in 2073",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071",
                "10 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 6: introduction to spatial data infrastructure \n                                            \n\n                                                6 Questions",
            "Question": [
                "6. What do you mean by metadata? Explain the critical factors of spatial data infrastructure (SDI).",
                "6. Explain with example of metadata and clearing house.",
                "7. Explain how does a clearing house works? What problems do you face during the spatial data sharing?",
                "7. Explain how does a clearing house works? What problems do you face during the spatial data sharing?",
                "6. What is Geo Spetial Metadata? Explain the various components of Metadata.",
                "8. Write short note on (any two)     (a) Map elements     (b) Spatial relationship     (c) Geodatabase     (d) SDI"
            ],
            "Asked": [
                "10 marks Asked in 2072",
                "10 marks Asked in 2069",
                "10 marks Asked in 2073",
                "10 marks Asked in 2071",
                "10 marks Asked in 2075",
                "10 marks Asked in 2069"
            ]
        },
        {
            "Chapter": "Unit 7: Open GIS \n                                            \n\n                                                4 Questions",
            "Question": [
                "7. Writes few advantage and disadvantage of using free and open sources GIS software\r\ntools with some examples.",
                "7. Explain web based GIS system with example.",
                "7. Explain the web based GIS system with example.",
                "7. Explain the system analysis and design of GIS."
            ],
            "Asked": [
                "10 marks Asked in 2074",
                "10 marks Asked in 2076",
                "10 marks Asked in 2072",
                "10 marks Asked in 2069"
            ]
        }
    ]
}