{
    "subject": "Image Processing",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                78 Questions",
            "Question": [
                "1. What is digital image and digital image processing? Explain.",
                "1. Explain the digital image processing with example.[6]",
                "1. Differentiate between digital image representation and digital image processing.",
                "2. Explain the adjacency and path of image pixels. Calculate the 8-adjacent and m-adjacent path from (1,3) to(3,2) for following image on V{0,1}.0  2  10  2  00  0  1",
                "2. Explain the Haar Transform with suitable example.(6)",
                "2. Explain the fast fourier with example.",
                "1. Explain how you can convert an analog image into a digital image. How many images of size 2400X1600 with 256 gray levels can be stored in a 1024 MB storage space?(3 + 3)",
                "2. Define the fourier transform. Explain the Hadamard transform with example.[2+4]",
                "1. What is a digital image? Draw and explain the block diagram of a typical image processing system in brief.(1+5)",
                "3. What is Histogram Modeling? Compute the histogram equalization of the given data.Gray Level      01234567No. of pixels   532010005005251236956856128",
                "2. Define Discrete Cosine Transform(DCT). Differentiate between Discrete Fourier Transform (DFT) and Fast Fourier Transform(FFR).",
                "3. Explain the power law transformations. Write the algorithm for the implementation of median filter in spatial domain.(2+4)",
                "1. Differentiate between Discrete Fourier Transform (DFT) and Fast Fourier Transform (FFT). Explain the FFT algorithm for one-dimensional case. [3+7=10]",
                "3. What do you mean by visual perception? What are the elements of visual perception? Explain.[3+3]",
                "3. What do you mean by image enhancement? Explain the Histogram Modeling with example.",
                "4. What do you mean by image enhancement? Explain the operation of Power law (Gamma) transformation with example.",
                "4. Explain the template matching with algorithm and example.[6]",
                "3. Explain the term 'Log and inverse log transformation' techniques for the purpose of image enhancement. Explain the average spatial filter along with suitable algorithm for its implementation.(2+4)",
                "4. What do you mean by image coding? Explain the process of predictive coding.",
                "2. Given the following frequency table obtained from the histogram of a 16 X 16, 8 level image.M    0     1      2     3    4    5      6     7NM 15    6    70   16   31   35   32   51Where M = gray level and NM = pixels having Mth gray level.Construct Huffmann code for each gray level. Calculate the compression ratio and the relative data redundancy assuming if 3-bit code is used to code the gray level instead of Huffmann code. [7+3 =10]",
                "4. What do you mean by low pass filtering in digital image processing? Explain it with suitable example. Show how can you convert low pass filter to high pass filter with suitable block diagram.(6)",
                "1. Explain \"power law transformation\" techniques for the purpose of image enhancement. Explain the mean filter along with suitable algorithm for its implementation(4+6)",
                "5. Construct Huffman code for each gray level given and find the compression ratio and coding efficiency.Gray Level0124567No. of Pixels30353815103880",
                "5. What is image coding? Explain the Run length coding with example.[2+4]",
                "5. What do you mean by Lossy Predictive Coding? Explain it with a suitable block diagram.(6)",
                "4. Explain the term Contrast Stretching and the Histogram Equalization.(3+1)",
                "3. What is an edge detection filter? Differentiate between the first derivative and second derivative filter? Derive the filter mask for laplacian filter and write the algorithm for its implementation. [1+2+7=10]",
                "5. Explain the features extraction with appropriate example . Why feature extraction is important in image processions? Explain.",
                "2. What is Fourier Transform and how can you apply it in the digital image processing? Explain the different properties of the Fourier Transform.(4+6)",
                "6. Explain in detail procedure for implementing Butterworth High Pass filter in Frequency domain.(6)",
                "3. Explain the adaptive thresholding and regionsplit and merge techniques for image segmentation.(5+5)",
                "6. Explain the edge detection using templates with practical example.",
                "6. What is boundary? Explain spatial averaging filter.",
                "5. What do you mean by Lossless Predictive Coding? Explain it with a suitable block diagram.(6)",
                "6. Mention the different types of character recognition and explain it.[6]",
                "7. What is Hough transform? How it is useful in line detection? Explain with example.",
                "7.Explain the segmentation by thresholding. Explain how can you apply segmentation in line defection.",
                "7. What is pattern recognition? Explain the applications of neural networks in pattern recognition.[2+4]",
                "7. What is zooming? Explain the process of zooming by interpolation method.(6)",
                "6. Explain the detail procedure for implementing Butterworth Low Pass filter in Frequency domain.(6)",
                "8. Define the edge detection. What do you mean by template matching? Explain.[2+4]",
                "8. Explain the Hadamard transform with example.",
                "8. How edges are detected using the gradient operators? Explain with suitable example.",
                "7. What is zooming? Express the process of zooming by replication method.(6)",
                "8. Explain in detail the region split and merge techniques for image segmentation. List the problems associated with region split and merge technique.(4+2)",
                "1.How many images of size 1024×768 with 256 gray levels can be stored in a 2048 MB storage space?",
                "9. Explain in detail the template matching using Correlation.(4+2)",
                "2. Write short notes on dilation and erosion.",
                "8. Explain in detail the region growing techniques for image segmentation. List the problems associated with region growing technique.(4+2)",
                "9. How dilation and erosion are  applied in region filling and boundary extraction?[6]",
                "9. What is pattern and pattern recognition? Explain the steps and application areas of pattern recognition syatem.",
                "9. Explain the predictive and inter-frame coding with example.",
                "10. Write short notes on:[3+3]a) Features extractionb) Wavelet transform",
                "9. What are components of a pattern recognition system? Explain the relevant diagrams.(6)",
                "10. Write short notes on:a) Features extractionb) Wavelet transform",
                "3.Explain the contra-harmonic mean filters used in image restoration.",
                "4.Discuss the various applications and problems associated with the digital image processing in brief.",
                "10. Differentiate between Hopfield nets and hamming nets.",
                "10. What is a gradient filter? Explain the Sobel gradient filter in detail along with its algorithm for implementation.(1 + 5)",
                "10. Derive the equation for Laplacian filter and write the algorithm for its implementation.(6)",
                "4.Explain the Bit plane slicing technique for image enhancement.",
                "11. Differentiate between.[3+3]a) high pass and band pass filteringb) line detection and edge detection",
                "11. Differentiate between:a) Sampling and quantizationb) High pass and band pass filtering",
                "11. Write short notes on:(3 + 3)a) Pattern Recognition and its applicationsb) Neural Network",
                "5. Discuss the algorithm for histogram equalization.",
                "5.Explain how Hough transform is useful in line detection?",
                "11. Write short notes on:(3+3)a) Neural Networkb) Global thresholding",
                "6.Describe in brief that how do you implement Gaussian High Pass Frequency domain filter for image smoothing in the frequency domain?",
                "7. How will you implement Butterworth high Pass Frequency domain filter for image sharpening in the frequency domain? Describe in brief.",
                "6. Explain the first derivative filter with a suitable example.",
                "7. Explain lossy predictive coding in brief.",
                "8. Explain Contra-harmonic Mean Filters used for image restoration.",
                "9. Describe lossless predictive coding model with a suitable block diagram.",
                "8. Explain the region growing technique for image segmentation.",
                "9. Explain how can a neural network be applied in digital image processing with the help of a simple perceptron",
                "10. Explain opening and closing morphological operations in brief.",
                "11. Discuss the magnification of image using interpolation technique.",
                "12. Discuss Neural Network based image recognition system with the help of a simple perception."
            ],
            "Asked": [
                "6 marks Asked in 2071",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2074",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "6 marks Asked in 2073",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2074",
                "10 marks Asked in 2076",
                "6 marks Asked in 2071",
                "6 marks Asked in 2068",
                "6 marks Asked in 2074",
                "4 marks Asked in 2075",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2073",
                "10 marks Asked in 2076",
                "6 marks Asked in 2074",
                "10 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "6 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076"
            ]
        },
        {
            "Chapter": "Unit 2: Image Enhancement and Filter in Spatial Domain \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Introduction to Morphological Image Processing \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 6: Image Segmentation \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 7: Representations, Description and Recognition \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}