{
    "subject": "Technical Writing",
    "questions": [
        {
            "Chapter": "Unit 1: What Is Technical Writing \n                                            \n\n                                                87 Questions",
            "Question": [
                "1.  Define\r\nwhat does by simple sentence, compound sentence and complex sentence. Give two\r\nappropriate examples to illustrate the definition of each type.                                                                          [10]",
                "1.  Describe\r\na few ways of organizing information. Why is it important to organize information?   [10]",
                "1.  Prepare a newspaper article\nin about 250 words making\na comparison (and contrast) between\nwriting with and without a computer.                                                                                                                            [10]",
                "1.  Write\r\niconic symbols for the following situations.                                                                              [10]        a)      Please\r\nkeep this item always in this position and not upside down        b)      Please\r\nkeep this item safe from rain        c)      Please\r\nhandle with case as this item is very fragile.        d)      Fresh-room\r\nfor ladies        e)      Please\r\nrecycle this item",
                "1.   Write a business letter to a Chinese computer company, Beijing for regular supply of assembled computers and computers parts as you are running a computer shop at New Road, Kathmandu. Include the issues or modality of payment and possible problems in business transaction.    [15]",
                "1.  Write\r\na one-paragraph description of how you can improve your writing. Begin with a\r\ntopic sentence. In the rest of paragraph, add the details that support your\r\ntopic sentence. [15]",
                "1. Describe technical writing? Elaborate on its characteristics.",
                "1.  Write a report on the proceedings of three day long seminar workshop on Computer Science and Information Technology (CSIT) conducted by Institute of Science and Technology.    [15]",
                "1.  What is \"subject verb agreement\" in a sentence? Why is this agreement necessary in any type of writing? Explain it with at least three examples.    [10]",
                "1.  Describe\r\nhow you can use the online help or manual to find how to add a customized\r\ndictionary for technical words in your computer, and once added, how to open or\r\nclose the dictionary. [15]",
                "1.  Prepare\r\na newspaper article with due organization and layout in about 250 word using\r\nsymbols and abbreviation while preparing the article in the computer.                                                        [15]",
                "2.  Prepare an imaginary data of 5 years of first, 2nd and 3rd year students. Show their pass rate of failure rate through graphs, if possible use different colour.    [15]",
                "2.  Write\r\na job application on the basis of the given advertisement. Give your recent\r\nresume along with the application.                                                                                                                                     [15]IMMEDIATELY WANTED\nAakriti\r\nInternational has a vacancy for a Computer Engineer to work on contract for\r\nfive years\nInterested\r\ncandidates with qualification and experience are Requested to apply within a\r\nweek to\nThe Executive Manager Aakriti International Lazimpat\r\nKathmandu\nE-mail: aakritinepal@gmail.com",
                "2.  Discuss\r\nbriefly how you can choose and use table, graphs and charts                                       [15]",
                "2.  Edit the adjectives in the following sentences to make them\r\ncorrect and clear. [10]        a)     \r\nBlue looks more better on you than Gray.        b)      The\r\nreception was a really nice part.        c)     \r\nMy manager is really a nice person.        d)      That\r\nis the baddest-looking outfit I have ever seen.        e)     \r\nMeeting the president was a really nice part.        f)       We\r\nhad the seriousest conversation of the evening        g)      I\r\nthink she was more sharp than anyone else in the party        h)      The\r\nclock is much more slower than my watch.",
                "2.  What\r\nmajor items are included under the reference of grammar unit in Technical\r\nwriting courses? Give brief explanation of each item of grammar unit with suitable example                                        [10]",
                "2.  Write a newspaper article on \"use of computer in Higher education\" using headings subheadings, you should write it thinking about the aim and audience of your writing.    [10]",
                "1. What is technical writing? Distinguish between technical writing and academic writing.",
                "2.  What is communication? What are the factors to consider in\r\ntechnical communication? [15]",
                "2. \"Technical writing is written for both internal and external audiences.\" Justify with examples.",
                "2.  Write four paragraphs on advantages and disadvantages of using materials from different wave sites in preparing an article on future of solar energy in Nepal.    [15]",
                "2.  Use\r\na flow chart to show the total process in the computer from computer typing to\r\nprinting and saving the material in a file / CD / pen drive.                                                                                                   [15]",
                "2.  Prepare a\r\nnewspaper article in about 250 words on “the Use and Misuse of Mobile\nPhone”.            [15]",
                "3.  Critique\r\nyour friend’s webpage and recommend revisions to prepare it for use in a job\r\nsearch. [15]",
                "3.  What do you understand by \"Mechanics of writing\"? Describe briefly about major components of mechanics and their role in good writing.    [15]",
                "3.  Write a\r\nnewspaper article in about 250 words on the use and abuse of “internet facility”.              [15]",
                "3.  Write five common\r\nacronyms in your area of study and their expanded meanings. [10]",
                "3.  Write in detail on advantages and disadvantages using Facebook, Twitter and google+ for communication. In your write up use these expressions! in brief,whereas, however, though, even though, at first, in general, finally.    [15]",
                "3.  Write two paragraph on advantages and disadvantages of wireless communication (devices such as Bluetooth,\r\nWi-Fi) using these expressions: in short, in other words, namely, that is, for\r\ninstance, however, finally, such as, otherwise, whereas.                       [15]",
                "3.  Write instructions for installation and\r\noperation of the printer you have recently bought.           [15]",
                "3.  Write a newspaper article in about 250 words making a comparison and contrast between different forms of computer set like desktop, laptop, palmtop or others based on their functions mode, facilities ease and access, difficulty and complexity (including technical description).    [15]",
                "3. What should one keep in mind when writing for the web? Discuss.",
                "3.  Arrange\r\nthe following transition words into the categories of sequence, Examples,\r\nContract, and Conclusion, and then use the transition words in your own\r\nsentence, however, instead, in addition, therefore, finally, particularly, in\r\nshort, thus, such as, for example, otherwise.    [10]",
                "3.  Define each component of writing elements. How\r\ndoes each of them complement the other and what process or element makes writing\nreadable? [15]",
                "4.  Describe briefly\r\nthe layout of a business letter. [15]",
                "4. What is a press release? What steps should one follow to produce an effective press release?",
                "4.  Write instructions about loading photos in a file of the computer and how to use those photos in different facts of a seminar report of your college. Also give instruction about using photoshop program in the computer.    [10]",
                "4.  Write a sample cover letter to accompany your resume for a position\nin your field to the following person.    [15]                Mr. R. C. Shrestha                Uni Tech International GPO Box 0000                Kathmandu",
                "4.  Discuss advantages and disadvantages\r\nof wide spread use of ‘e’ service in general and ‘email’ in particular in\r\npersonal and institutional purpose. For example : e-banking, payment of service\r\ncharges like telephone, electricity and drinking water and admission and result\r\nof colleges and universities.                       [15]",
                "2. As writing is not an overnight endeavor it follows a certain process. Discuss a process for technical writing.",
                "4.  What\r\nis graphic presentation technique? What are the advantages of the use of\r\ngraphs, charts, pictures, and tables in technical communication? [15]",
                "4.  Explain the importance of using table, illustrations, graphic presentation in an academic writing. Give some suitable examples.    [15]",
                "4.  Discuss different forms of technical communications. Prepare a 'memo' and explain why is it a form of technical communication.    [15]",
                "4.  This\r\nis the initial lecture in computer class. Give clear instruction how to use\r\ncomputer in the computer lab. Give technical description of the computer\nso that student\nidea about the computer and its use becomes more technically dependable.                                                                                                                  [15]",
                "4.  Represent the following information in the pie chart                                                                     [10]\ni.       \r\nTotal number of cell phone users=8,50,000\nii.     \r\nUsers of Nepal Telecom(cell phone)=5,50,000\niii.   \r\nUsers of N cell =2,50,000\niv.   \r\nUsers of UTL=50,000",
                "4.  What is a summary? Describe the steps to follow\r\nto write informative summaries  [10]",
                "5.  Write\r\na brief proposal to convince your manager to purchase a new computer for your\r\nuse in the office. [15]",
                "5.  Prepare a formal report\nof a seminar entitled “Role of computer\nin the media”. Each step of proceeding of the seminar and\r\nagenda of the seminar are to be duly included in the report. Include formation\r\nof seminar preparation committee, its meeting and resolutions. Summary of\r\npresentation, and major response of the participants..                                                                                                                                   [15]",
                "5.  Define \"simple sentence\", \"complex sentence\" and \"compound sentence\". Give three examples for each type.    [10]",
                "5.  Write a technical description of a\r\nrecently bought colour laser printer with its special features. If necessary\r\ngive some sketches to clarify your\r\ndescription.                                                                       [10]",
                "5.  Give instructions\r\nfor operating a personal computer.    [10]",
                "5.  Write short notes\r\non (any two):  [15]\na)      Writing\r\nwith a computer\nb)      Writing\r\nin examinations\nc)      The\r\nuse of headings\nd)      Language\r\nand style\ne)      Transition words\nf)       The\r\nuse of commas and semicolons",
                "3. What is ethics? How do an ethical dilemma and a legal dilemma differ? Discuss with examples.",
                "5.  Read the following advertisement and write a job application, and attach your recent biodata with the application.        [15]Immediately wantedToyota Nepal has a vacancy for computer engineer to work on for 7 years. Interested candidates with computer bachelor/computer engineering qualification can apply within a week to the administration office of Toyota Nepal, Maharajgung, Kathmandu.email: toyotanepal@gmail.com",
                "5. Give a technical description of a multimedia or a new desktop computer with its special features.    [10]",
                "5.  Read the following advertising and write a job application\r\nsuitable and attach latest bio data with it.\n    [15]Teacher Wanted\nSwastik\r\nengineering College has a vacancy for a teacher (Computer) as a full time\r\nfaculty.\nQualified\r\nCandidate are suggested to apply The principal\nSwastik\r\nengineering College Sitapaila Kathmandu E-mail: swastikcollege@gmail.com",
                "5.  Imagine\r\nyou are the Head of the Department of Computer Science an Information\r\nTechnology and also imagine that you have conducted a Departmental meeting of\r\nall teaching staff. Now prepare a formal minute of the meeting with agenda and\r\nresolutions. [15]",
                "6.  What's technical communication? How does it differ from other types of communication? What features help making communication 'technical'?    [15]",
                "6.  Write a letter\r\nto a business associate thanking him for referring a customer to you. [15]",
                "6.  Write a technical description of\r\nyour new laptop with its special features [10]",
                "6.  It\r\nis said that the pace of modern time can be capture only by having right\r\nknowledge of using “Facebook, twitter, YouTube, g+”. Write two paragraphs on\r\nadvantages and disadvantages of using the above. Your expressions should\r\ninclude these expressions “At first, on the other, for example, however,\r\nfinally, namely, that’s why, such as”.                                                                                                                        [10]",
                "6.  Define informative summary and prepare such a summary of a new book or a film you have recently read or enjoyed.    [10]",
                "4. What are graphics? How are they used in technical writing?",
                "6.  Explain computer-aided writing or explain what\r\ninformative summaries are.    [15]",
                "6.  The Growing use of soft-games in computer has diverted young\npeople away from the real physical games in\r\nthe field. Discuss some pros and cons of computer-mediated games. [15]",
                "6.  Write\r\nshort notes on any two of the following:                                                                       [15]\na)      Writing minutes\nb)      Readability\nc)      E-mail\r\netiquette\nd)      Technical\r\ncommunication",
                "6.  Suppose you are the Head of the Department of Computer Science\nand Information Technology and you have assigned a particular task to each\r\nstudent of 4th semester for class presentation through multimedia.\r\nNow prepare    a    formal   \r\nreport    with    informative    summary   \r\nof     each     student’s     presentation    [15].",
                "6.  Write two paragraphs on advantages and disadvantages of using such devices like Wi-Fi, Bluetooth, Android, EDGE using the following expression, on the one hand, in brief, however, moreover, such as, whereas, for example, that is.    [15]",
                "5. Think of a subject or hobby about which you know a great deal. In a brief essay, describe how you acquired your knowledge.",
                "6. Requesting him or her to increase incentive for the hardworking employees, write a letter to your employer.",
                "5. Write a short report describing the writing skills a computer network administrator requires.",
                "7. Think of a time when something went wrong-perhaps a problem at college or work. After identifying and analyzing your audience, write an incident report describing the incident.",
                "8. You are working as the manager of an IT company. Write an email encouraging your staff to work for some additional hours every week so that the company and staff equally benefit.",
                "6. Write a letter to your employer requesting a two-day leave for a special event, such as brother or sister’s wedding.",
                "7. You are calling a client to set up an interview about a new type of Internet system in his or her office. What arrangements should you discuss with him or her? Make a list of at least three areas you need to cover in the phone call to set up an interview.",
                "8. Write an email encouraging your staff to work for some additional hours every week so that the company and staff equally benefit.",
                "9. Write a press release for your school or another organization with which you are affiliated to announce an upcoming event, an accomplishment, or other newsworthy information.",
                "10. Based on your experience as an IT professional, write instructions for new aspirants, explaining how to begin career in this field.",
                "9. Write a brief newspaper article explaining the importance of training for the staff of a company.",
                "11. Write a chronological resume highlighting your skills for a job in your field.",
                "10. Based on your experience, write instructions for new students, explaining how to register for classes or for a particular program.",
                "11. Write a functional resume highlighting your skills for a job in your field.",
                "12. Considering audience and purpose, write a short speech you are going to deliver in the inaugural session of the College IT Fair.",
                "12. Considering audience and purpose, write a short speech you are going to deliver in the inaugural session of the College IT Fair.",
                "13. Suggesting an action or a program, write a recommendation report to your ward office so that the entire environment of your community significantly improves.",
                "14. Write a brief proposal on a problem you have been facing as a student of your college.",
                "15. Imagine you are the manager of a company. You need to inform your staff that a new product is being launched on the occasion of New Year. Prepare a memo so that your staff understand and execute your plan."
            ],
            "Asked": [
                "10 marks Asked in 2072",
                "10 marks Asked in 2070",
                "10 marks Asked in 2069",
                "10 marks Asked in 2068",
                "15 marks Asked in 2075",
                "15 marks Asked in 2067",
                "10 marks Asked in 2078",
                "15 marks Asked in 2073",
                "10 marks Asked in 2074",
                "15 marks Asked in 2067-II",
                "15 marks Asked in 2071",
                "15 marks Asked in 2074",
                "15 marks Asked in 2069",
                "15 marks Asked in 2070",
                "10 marks Asked in 2067",
                "10 marks Asked in 2071",
                "10 marks Asked in 2075",
                "10 marks Asked in ModelQuestion",
                "15 marks Asked in 2067-II",
                "10 marks Asked in 2078",
                "15 marks Asked in 2073",
                "15 marks Asked in 2072",
                "15 marks Asked in 2068",
                "15 marks Asked in 2070",
                "15 marks Asked in 2073",
                "15 marks Asked in 2072",
                "10 marks Asked in 2067",
                "15 marks Asked in 2075",
                "15 marks Asked in 2069",
                "15 marks Asked in 2068",
                "15 marks Asked in 2074",
                "10 marks Asked in 2078",
                "10 marks Asked in 2067-II",
                "15 marks Asked in 2071",
                "15 marks Asked in 2067",
                "10 marks Asked in 2078",
                "10 marks Asked in 2074",
                "15 marks Asked in 2067-II",
                "15 marks Asked in 2071",
                "10 marks Asked in ModelQuestion",
                "15 marks Asked in 2069",
                "15 marks Asked in 2075",
                "15 marks Asked in 2073",
                "15 marks Asked in 2072",
                "10 marks Asked in 2068",
                "10 marks Asked in 2070",
                "15 marks Asked in 2070",
                "15 marks Asked in 2072",
                "10 marks Asked in 2075",
                "10 marks Asked in 2071",
                "10 marks Asked in 2067-II",
                "15 marks Asked in 2067",
                "10 marks Asked in ModelQuestion",
                "15 marks Asked in 2074",
                "10 marks Asked in 2073",
                "15 marks Asked in 2068",
                "15 marks Asked in 2069",
                "15 marks Asked in 2075",
                "15 marks Asked in 2067",
                "10 marks Asked in 2069",
                "10 marks Asked in 2072",
                "10 marks Asked in 2073",
                "10 marks Asked in ModelQuestion",
                "15 marks Asked in 2067-II",
                "15 marks Asked in 2068",
                "15 marks Asked in 2070",
                "15 marks Asked in 2071",
                "15 marks Asked in 2074",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 2: Audience and Purpose \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 3: Writing Process \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Brief Correspondence \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Document Design and Graphics \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 6: Writing for the Web \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 7: Information Reports \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 8: Employment Communication \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 9: Presentations \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 10: Recommendation Reports \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 11: Proposals \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 12: Ethics in the Workplace \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}