{
    "subject": "Operating Systems",
    "questions": [
        {
            "year": "2066",
            "paragraphs": [
                "1.  Define the term semaphore. How does semaphore\r\nhelp in dining philosophers problem? Explain.",
                "2. Explain how does file allocation table (FAT)\r\nmanage the files. Mention the merits and demerits of FAT system. A 200 GB disk\r\nhas 1-KB block size, calculate the size of the file allocation table if each\r\nentry of the table has to be 3 bytes.",
                "Suppose that a disk drive has\r\n100 cylinders, numbered 0 to 99. The drive is currently serving a request at\r\ncylinder 43, and previous request was at cylinder 25. The queue of pending\r\nrequest, in FIFO order is:",
                "86,\r\n70, 13, 74, 48, 9, 22, 50, 30",
                "Starting from the current head\r\nposition, what is the total distance (in cylinders) that the disk arm moves to\r\nsatisfy all pending requests for each of the following disk scheduling\r\nalgorithms?",
                "\ta.  FCFS",
                "\n",
                "\tb.  SCAN",
                "3.     \r\nWrite short notes on\n:",
                "\ta.  Least\r\nrecently used page replacement algorithm",
                "\tb.  Segmentation",
                "\n",
                "\tc.  Associative memory",
                "4.     \r\nWhat is an operating system? Differentiate between time\r\nsharing and real time operating system.",
                "5.     \r\nWhy thread is necessary? In which circumstances\r\nuser-level thread is better that Kernal level thread?",
                "6.     \r\nExplain about hierarchial directory systems with\r\ndiagrammatic examples.",
                "7.     \r\nHow can you define the term process scheduling?\r\nDifferentiate between I/O bound process and CPU bound process.",
                "9.     \r\nWhat do you mean by interrupt? Explain the working\r\nmechanism of interrupt controller.",
                "10.      Define\r\nthe term indefinite postponement. How does it differ from deadlock?",
                "11.     \r\nExplain the mapping of virtual address to real address\r\nunder segmentation.",
                "12.      Compare\r\nthe throughput (overall performance) of SCAN with SSTF."
            ]
        },
        {
            "year": "2067",
            "paragraphs": [
                "1.     \r\nWhat is system called? Explain\nthe system call flow with the help of block a diagram.",
                "\nWhat do you mean by file system? What are the major\r\ndifference between file system interface and file system implementation?\r\nExplain.",
                "2.     \r\nWrite short notes on\n:",
                "\ta.  Disk\r\nscheduling algorithms",
                "\tb.  Error\r\nhandling and formatting",
                "\tc.  File operations",
                "",
                "3.  Consider the following page reference string :\r\n1, 2, 3, 4, 2, 1, 5, 6, 2, 3, 7, 6, 3, 2, 1, 2, 3, 6. How many page fault would occur for the LRU replacement, FIFO replacement and optimal replacement algorithms. Assuming\nthree, five or seven frames?\nRemember all frames\nare initially empty,\nso your first unique pages\r\nwill all cost one fault each.",
                "4.      Differentiate\r\nbetween personal computer operating systems and mainframe operating systems.",
                "5.  When do page fault occur? Describe the actions\r\ntaken by an OS when a page fault occurs.",
                "6.     \r\nList four necessary conditions for deadlock. Explain each of them briefly\nwhat would be necessary\r\n(in the operating system) to prevent the deadlock.",
                "7.     \r\nDraw and describe the 3-state process model.",
                "8.  Does window have any concept of process\r\nhierarchy? How does parent control the child?",
                "",
                "10.     \r\nExplain why two-level scheduling is commonly used.",
                "11.     \r\nWhat are the main motivations and issues in primary\r\nmemory management?",
                "12.     \r\nExplain the disk management with example."
            ]
        },
        {
            "year": "2068",
            "paragraphs": [
                "1.  List the essential\r\nproperties for the Batch-Oriented and Interactive operating system. For each of\r\nthe following application which system (batch or Interactive) is more suitable?\r\nState the reason.",
                "",
                "\ta.  Word processing",
                "\tb.  Generating\r\nmonthly bank statements",
                "\tc.  Computing\r\npi to million decimal places",
                "\td.  A\r\nflight simulator",
                "\te.  Generating\r\nmark statement by university",
                "                                        OR",
                "",
                "“Using\r\nsemaphore is very critical for programmer” Do you support this statement? If\r\nyes, prove the statement with some fact. If not, put your view with some\r\nlogical facts against the statement.",
                "2.  Round-robin\r\nscheduling behaves differently depending on its time quantum. Can the time\r\nquantum be set to make round robin behave the same as any of the following\r\nalgorithms? If so how? Proof the assertion with an example.",
                "\ta.  FCFS",
                "\tb. SJF",
                "\tc.  SRTN",
                "3.  A disk has 8\r\nsector track and spins at 600 rpm. It takes the controller time 10ms from the\r\nend of one I/O operation before it can issue a subsequent one. How long does it\r\ntake to read all 8 sectors using the following interleaving system?",
                "",
                "\ta.  No interleaving",
                "\tb. Single interleaving",
                "\tc. Double interleaving",
                "4.  What is critical\r\nsection problem? Why executing critical selection must be mutual exclusive?\r\nExplain.",
                "",
                "5.  What must user\r\nprograms be prohibited from writing to the memory locations containing the\r\ninterrupt vector?",
                "",
                "6.  What are the\r\ndifferences between the trap and interrupt? What is the use of each function?",
                "",
                "7.  What is\r\ndeadlock? State the conditions necessary for deadlock to exist. Give reason,\r\nwhy all conditions are necessary.",
                "",
                "8.  A computer\r\nwith 32 bit address uses a two level page table. Virtual addresses are split\r\ninto a 9 bit top level page table field, 11-bit second level page table field\r\nand offset. How large the pages? How much maximum space required when page\r\ntables loaded into memory if each entry required when page tables loaded into\r\nmemory if each entry required when page tables loaded into memory if each entry\r\nrequired 4 bytes.",
                "",
                "9.  What do you\r\nmean by memory fragmentation? Distinguish between the internal and external\r\nfragmentation.",
                "",
                "10.  Under what circumstances do page fault occur?\r\nDescribe the action taken by the operating system when a page fault occurs.",
                "11.  How many bits\r\nwould be needed to store the free-space list under the following conditions if\r\na bit map were used to implement?",
                "",
                "\ta.  500,000\r\nblocks total and 200,000 free blocks",
                "\tb. 1,000,000\r\nblocks total and 0 free blocks.",
                "Also find how much space is required if it need to be stored in\r\nmemory.",
                "12.  Which one suited,\r\npolling/interrupt, for the following types of system? Give reason.",
                "",
                "\ta.  A\r\nsystem dedicated to controlling single I/O devices.",
                "\tb. A\r\nwork station running as heavily used web server."
            ]
        },
        {
            "year": "2069",
            "paragraphs": [
                "1.  Define the\r\nessential properties of following types of operating systems:",
                "\ta.  Batch",
                "\tb.  Interactive",
                "\tc.  Time sharing",
                "\td.  Real time",
                "\n",
                "\te.  Handheld",
                "\n",
                "Why some process requires\r\nhigh priority? What would happen if all processes have some the priority?\r\nMention merits and demerits of assigning priority on process.",
                "2.  Given\r\nreferences to the following pages by a program, 0, 9, 0, 1, 8, 1, 8, 7, 8, 7,\r\n1, 2, 8, 2, 7, 8, 2, 3, 8, 3. How many page faults will occur if\r\nthe program has three page frames for each of the following algorithms?",
                "",
                "\ta.       FIFO",
                "\tb.      Optimal",
                "\tc.       Second\r\nChance",
                "\n",
                "\td.      LRU",
                "3.  For the processes listed in the following table, draw a\r\nGantt chart illustrating their execution and calculate the average waiting time\r\nusing :",
                "\ta.      \r\nFirst-Come-First-Serve",
                "\tb.     \r\nShort-Job-First",
                "",
                "\tc.       Shortest-Remaining-Time-Next",
                "\td.     \r\nRound-Robin (quantum =\n2)",
                "\te.       Round-Robin\r\n(quantum = 1)",
                "",
                "Process",
                "Arrival Time",
                "Burst Time",
                "A",
                "0.00",
                "4",
                "B",
                "2.01",
                "7",
                "C",
                "3.01",
                "2",
                "D",
                "3.02",
                "2",
                "4. Explain the Peterson’s concept for the solution\r\nof critical section problem.",
                "5.  Show how\r\nsleep and wake up solution is better than busy waiting solution for the\r\ncritical section problem.",
                "6. Describe how multithreading\r\nimproves performance over a single threaded solution.",
                "",
                "7.  Explain how priority scheduling\r\nworks. In how many ways can priority be assigned?",
                "",
                "8.  What do you mean by deadlock prevention? Mention\r\nthe mechanism for deadlock prevention.",
                "9.  Two separate\r\nsystems one implemented in bitmap and another in linked list to manage the\r\nfragmentation of 256 MB memory. For bitmap, allocation units are of 512 bytes.\r\nFor linked list, each holes or segments are of 32 KB, and each node in the list\r\nneeds a 32 bits. How many bytes of storage is required for each method? Which\r\none is better in terms of memory spare required?",
                "",
                "10.  Distinguish\r\nbetween the paging and segmentation. Why many systems use the combination of\r\nboth?",
                "",
                "11.  Compare the bitmap\r\nand linked list implementation of disk free-space management. How much space\r\nrequired in memory to store bitmap for 20 GB hard disk with 2KB block size.",
                "",
                "12.  How does DMA\r\nincrease system concurrency? How does it complicate the hardware design?",
                ""
            ]
        },
        {
            "year": "2070",
            "paragraphs": [
                "1.  For the\r\nprocesses listed in following table, draw a Gantt chart illustrating their\r\nexecution using:",
                "",
                "\ta.  First-come-First-Serve",
                "\tb.  Short-Job-First",
                "\tc.  Shortest-Remaining-Time-Next",
                "\td.  Round-Robin (quantum=2)",
                "\te.  Round-Robin (quantum=1)",
                "Processes",
                "Arrival Time",
                "CPU Time",
                "A",
                "0.000",
                "3",
                "B",
                "1.001",
                "6",
                "C",
                "4.001",
                "4",
                "D",
                "6.002",
                "2",
                "What is the turnaround time for\r\neach algorithm?",
                "                                OR",
                "What do you mean by disk\r\nmanagement? What are the major differences between error handling and\r\nformatting?",
                "2.  How many page\r\nfaults occur for each of the following page replacement algorithm for the\r\nreference string 0 1 7 2 3 2 7 1 0 3 with four page frames and eight pages? Suppose all\r\nframes are initially empty.",
                "",
                "\ta.  Optimal replacement",
                "\tb. FIFO replacement",
                "\tc.  LRU replacement",
                "\td. Clock replacement",
                "3.  Suppose that\r\nthe disk drive has 50 cylinders, numbered from 0 to 49. The drive currently\r\nserving the request at cylinder 20 and the previous request was at cylinder 25.\r\nThe queue of pending request is 10, 22, 20, 2, 40, 6 and 38 in the order. A\r\nseek takes 6 msec per cylinder moved. How much seek time is needed for the\r\nfollowing disk-scheduling algorithms?",
                "",
                "\ta.  First-Come, First-Served",
                "\tb. Shortest\r\nSeek Time First",
                "\tc.  SCAN",
                "\td. LOOK",
                "4.  Define the essential properties of following types\r\nof operating systems.",
                "",
                "\ta.  Batch",
                "\tb. Interactive",
                "\tc.  Time Sharing",
                "\td. Real Time",
                "\te.  Handheld",
                "5.  Describe how multithreading\r\nimproves performance over a singled-threaded\nsolution.",
                "",
                "6.  “Using Semaphores\r\nis very critical for programmer”. Do you support this statement? If yes, prove the statement with some fact. If\r\nnot, put your view with some logical facts against the statement.",
                "",
                "7.  Students working\r\nat individual PCs in a computer laboratory send their files to be printed by a\r\nserver which spools the files on its hard disk. Under what conditions may a\r\ndeadlock occur if the disk space for print spool is limited? How may the\r\ndeadlock be avoided?",
                "",
                "8.  What are Segmentation and Paging?\r\nWhy they are sometimes combine into one scheme?",
                "",
                "9.  What are the differences between\r\nthe trap and interrupt? What is the use of each function?",
                "",
                "10.  What is “device independence”? Define.",
                "",
                "11.  Explain how file allocation table (FAT) manages\r\nfiles. Mention the merits and demerits of using FAT",
                "12.  Write short notes on (any two):",
                "",
                "\ta.  System programs",
                "\tb. Race condition",
                "\tc.  Windows\r\nfile system"
            ]
        },
        {
            "year": "2071",
            "paragraphs": [
                "1.  How thread based\r\nexecution minimizes the context switching problem of process based execution?\r\nExplain the different multithreading model.",
                "",
                "2.  What is page\r\nfault? Consider the following page reference string; 3, 3, 5, 4, 7, 1, 5, 5, 1,\r\n4, 3, 7, 6, 3, 4, 1. How many page faults would occur for each of the following\r\npage replacement algorithms\r\nassuming 4 page frames?",
                "        a.) LRU page replacement ",
                "        b.)\r\nFIFO page replacement ",
                "        c.) Optimal page replacement ",
                "        d.) Clock replacement",
                "",
                "3.  Suppose the\r\nhead of a moving head disk with 200 tracks, numbered 0 to 199 is currently\r\nserving request at tracks 143 and has finished a request at track 125. The\r\nqueue it request is kept in the FIFO order 86, 147, 91, 177, 94, 150, 102, 175,\r\n130. What is the total head movements needed to satisfy these request for the\r\nfollowing disk-scheduling algorithms?",
                "",
                "i) FCFS     ii) SSTF      iii)SCAN     iv)LOOK",
                "4.  How operating is\r\nas a resource manager? Explain.",
                "",
                "5.  For each of\r\nthe following transitions between the processes states, indicate whether the\r\ntransition is possible. If it is possible, give an example of one thing that\r\nwould cause it.",
                "\ta)  Running->Ready",
                "\tb)  Running->Blocked",
                "\tc)  Blocked->Running",
                "6.  Define file and directories.\r\nExplain about protection mechanism.",
                "",
                "7.  Differentiate\r\nbetween internal and external fragmentation with example.",
                "",
                "8.  What are the segmentation and\r\npaging? Why they are combined into one scheme?",
                "",
                "9.  What is DMA. Explain how it works.",
                "",
                "10. What do you understand by deadlock detection and\r\nrecovery? Discuss.",
                "11.  Explain how\r\nfile allocation table(FAT) manage the files. Mention the merits and demerits of\r\nusing FAT.",
                "",
                "12.  Write short\r\nnotes: (Any two)",
                "",
                "\ta)  Best\r\nFit vs Worst Fit",
                "\tb)  Swapping",
                "\tc)  Semaphores"
            ]
        },
        {
            "year": "2072",
            "paragraphs": [
                "1.  What is race condition? Calculate\r\naverage waiting and average turnaround time of the given set of processes in\r\ntable below using SJF and RR scheduling algorithm. [Note: Quantum time for\r\nRR=3].",
                "",
                "Process id",
                "Arrival Time",
                "Execution Time",
                "A",
                "0",
                "8",
                "B",
                "2",
                "14",
                "C",
                "9",
                "19",
                "D",
                "19",
                "7",
                "E",
                "25",
                "15",
                "2.  What is deadlock?\r\nExplain various conditions for deadlock. Discuss the Banker’s algorithm of\r\nmultiple resources for avoidance of deadlock with suitable example.",
                "",
                "3.  How physical\r\naddress is generated from logical address? Explain the process of system call\r\nwith suitable diagram.",
                "",
                "4.  What is an operating system? Differentiate\r\nbetween time sharing and real time operating\nsystem.",
                "5.  How does process differ from\r\nprogram? Explain process state with the help of block diagram.",
                "",
                "6.  Explain how multithreading improves\r\nperformance over a single threaded solution.",
                "",
                "7.  Describe how\r\nPeterson’s solution preserve mutual exclusion in process CR execution.",
                "",
                "8.  Given\r\nreferences to the following pages by a program, 1, 2, 3, 4, 2, 1, 5, 6, 2, 1,\r\n2, 3, 7, 6, 3, 2, 1, 2, 3, 6. How many page faults will occur\r\nif the program has three page frames available to it and uses LRU replacement?",
                "",
                "",
                "9.  What is deadlock?\r\nState the conditions necessary for deadlock to exist. Give reason, all conditions are necessary.",
                "",
                "10.  What is Fragmentation?\r\nDifferentiate between internal and external\nfragmentation.",
                "",
                "11.  How does DMA increase system\r\nconcurrency? How does it complicate hardware\ndesign?",
                "",
                "12.  Write short notes on:",
                "",
                "\ta)  Disk formatting",
                "\tb)  Memory\r\nMapped I/O"
            ]
        },
        {
            "year": "2073",
            "paragraphs": [
                "1.  How semaphore is\r\nused for the process synchronization? Do you think semaphore is the best\r\nsolution for solving critical section problem? Explain using it in\r\nProducer-consumer problem.",
                "",
                "2.  Define the\r\nfirst-fit, best-fit and worst-fit strategies of memory placement. Given memory\r\npartitions of 10 k, 4 k, 20 k, 18 k, 7 k, 9 k, 12 k, and 15 k (in order). How\r\nwould each of first- fit, best fit and worst fit algorithms place processes of\r\n12 k, 10 k and 9 k (in order)? Which algorithms make the best use of memory?",
                "",
                "3.  What do you\r\nmean by disk management? Explain the error handling and formatting operation on\r\nthe disk.",
                "",
                "4.  Classify the\r\nfollowing applications as batch-oriented or interactive and explain the reason",
                "",
                "\ta)  Word processing",
                "\tb)  Generating\r\nmonthly bank statements",
                "\tc)  Computing\r\npi to a million decimal places",
                "5.  What is thrashing? Explain the\r\ncause and solution for thrashing.",
                "",
                "6.  Given references\r\nto the following pages by a program, 1, 2, 3, 4, 2, 1, 5, 6, 2, 1, 2, 3, 7, 6,\r\n3, 2, 1, 2, 3, 6. How many page faults will occur\r\nif the program has here page frames available to it and uses FIFO replacement?",
                "",
                "7.  Discuss in\r\ndetail the use of translation look aside buffer (TLB) in the process of paging. Support your answer with illustration.",
                "",
                "8.  What is memory-mapped I/O? Explain with merits and demerits.",
                "",
                "9.  Write short notes on:",
                "",
                "\ta)  Memory Compaction",
                "\tb) Virtual Machines",
                "10.  What do you mean by interrupt? Explain the\r\nworking mechanism of interrupt controller.",
                "11.  A disk queue\r\nhas the following request to read tracks: 87, 170, 4, 57, 173, 32, 67 and 183. If disk head is initially at cylinder 90\r\nand there are total 200 tracks then calculate total head movement using C-SCAN\r\nand C-LOOK algorithm.",
                "",
                "12.  What are the\r\nscheduling criteria? How does preemptive priority scheduling introduce\r\nstarvation?",
                ""
            ]
        },
        {
            "year": "2074",
            "paragraphs": [
                "1. Explain \"race condition\" and also state how process synchronization is handled using semaphore? Explain with algorithms.",
                "                                            OR",
                "Suppose three peoples are in line waiting for a department store to open for \"the big sale\". When the door opens, all three rush the door, but the door is not big enough for all them to pass through at once. Describe a solution for addressing this deadlock that will allow three peoples to pass through the door. Which of the 4 necessary deadlock conditions does your solution break? Explain",
                "2.  Consider the following page reference string 1, 3, 5,4, 7, 1, 5, 6, 1, 2, 3, 7, 6, 3, 4, 1, 3, 8. How many page faults would occur for each of the following page replacement algorithms assuming 3 frames?",
                "    a) FIFO",
                "    b) OPR",
                "    c) LRU",
                "3. Consider following set of processes, with the length of the CPU-burst time and arrival time given in milliseconds.",
                "        Process                Burst time                Arrival time",
                "            P1                            10                                    0",
                "            P2                            15                                    2",
                "            P3                            22                                    3",
                "            P4                            16                                    5",
                "            P5                             5                                     6",
                "For the given data, draw Gantt charts that illustrate the execution of these processes using SJF and Robin algorithms with quantum 4 milliseconds.",
                "4.  Do you think a process can exist without any state? Justify your view with the help of process state transition diagram.",
                "5.  Suppose that a disk drive has the cylinder numbered from 0 to 4999. The head is currently at cylinder number 143. The queue for services of cylinder is as 86, 1470, 913, 948, 1509,1774, 1022, 1750 and 130. What is the total head movement in each of the following disk algorithm to satisfy the requests?",
                "    a) FCFS",
                "    b) SSTF",
                "6.  Define deadlock. How deadlock can be prevented?",
                "7.  What is the advantage of interrupt over polling? Explain the working mechanism of interrupt controller.",
                "8.  Are there any linkages between semaphore and deadlock condition? If yes, Explain with example.",
                "9.  Describe the methods for implementing directories with examples.",
                "10.  What is the difference between physical address and virtual address? Explain the conversion of virtual address into physical address by MMU.",
                "11. Differentiate between time sharing and real time system.",
                "12.  Explain about bit map and linked list memory management system."
            ]
        },
        {
            "year": "2075",
            "paragraphs": [
                "1.  Explain operating system as a resource manager and extended machine. Distinguish between Batch system and Time sharing systems.",
                "                                                OR",
                "What is real time operating system? List the types. \"Operating system is broker between computer System and User\". Justify the statement?",
                "2. What is difference between Deadlock and Starvation? Consider the following four resources A, B, C and D with five processes and answer the questions:",
                "                            Allocation                                 Max                                    Available",
                "                    A        B        C        D             A        B        C       D                 A        B        C        D",
                "        P0        0        0        1         2             0        0        1        2                  1        5        2        0",
                "        P1        1        0        0        0              1        7        5        0",
                "        P2        1        3        5        4              2        3        5        6",
                "        P3        0        6        3        2              0        6        5        2",
                "        P4        0        0        1        4              0        6        5        6",
                "    a) Is the system in a safe state? Use Banker algorithm. If yes give the sequence.",
                "    b) If a request from process from P1 arrives for (0, 4, 2, 0), can the request be granted immediately?",
                "",
                "3.  Five batch jobs A through E, arrive at a computer center at almost same time. They have estimated running times of 10, 8, 4, 2, and 6. Their priorities are 3, 5, 2, 4 and 1 respectively with 5 being the highest priority. For each of the scheduling algorithms determine the average turn around time and waiting time.",
                "    a) Round Robin (Quantum=2)",
                "    b) Priority Scheduling",
                "    c) SJF",
                "4.  What is critical section problem? Why executing critical selection must be mutual exclusive? Explain.",
                "5.  Suppose that a disk drive has the cylinder numbered, 0 to 199 is currently serving a request at cylinder 143. The queue it request is kept in the FIFO order 25, 17, 119, 197, 194, 15, 182, 115, 183. What is the total head movement needed to satisfy these request for the following disk scheduling algorithm.",
                "    a) FCFS",
                "    b) SSTF",
                "6.  What is critical Section Problem? Describe the criteria to be satisfied for solving this problem.",
                "7.  How Produce-Consumer problem can be solved with sleep and wakeup primitives? Explain.",
                "8.  Describe the methods for implementing files.",
                "9.  Why do deadlock occurs? How can you detect and recover from deadlock?",
                "10.  What is swapping? Differentiate contiguous memory allocation with non contiguous memory allocation.",
                "11.  Discuss the working principles and advantages of Direct Memory Access.",
                "12.  What is the purpose of system call in OS? Differentiate between thread and process."
            ]
        },
        {
            "year": "2075%20(old)",
            "paragraphs": [
                "1.  Define Monolithic and Layered System with suitable examples.",
                "                                OR",
                "Explain the memory management with example.",
                "2.  Differentiate between:",
                "    a) Paging and Segmentation",
                "    b) Allocation of Swap Space",
                "    c) File attributes",
                "3.  Describe the goal of I/O software? What are the functions of Interrupt Handler? Explain.",
                "4.  Describe the technique of long file names? In your opinion, which one is most efficient? Give reason to justify your answer.",
                "5.  Briefly define the term scheduler in the context of any operating system. List three aims of the scheduler in any operating system.",
                "6. Define the term race condition. Differentiate between race conditions and critical regions.",
                "7.  Why paging is used? Explain with an example.",
                "8.  What is the virtual memory? What are the functions of associative memory?",
                "9.  What resources are used when a thread is created? How does it differ from the resources used to create processes?",
                "10.  Define the essential properties of (a) Batch,  (b) Time sharing,  (c) Real time operating systems.",
                "11.  What are the differences between Busy Waiting and Blocking?",
                "12.  What is direct memory access? Discuss its working principle."
            ]
        },
        {
            "year": "2076",
            "paragraphs": [
                "1. Defined interactive system goals? List various interactive scheduling algorithms. Consider following process data and compute average waiting time and average turnaround time for RR(quantum 10) and priority scheduling algorithms.",
                "",
                "",
                "2.  How Second Chance page replacement algorithm differs from FIFO page replacement policy? Discuss the concept of Belady's anomaly with suitable example.",
                "3.  What is the main objective of disk scheduling algorithms? why SSTF is not practically feasible? Assume that we have disk with 100 tracks and currently head is at track number 35. What will be the seek time for the algorithms SCAN and LOOK for processing IO requests queue: 52, 67, 27, 11, 43, 85, 18, 75, 92, 8?",
                "4. What are two modes of OS? Discuss different OS structures briefly.",
                "5.  When threads are better than processes? Explain the concept of user level threads in detail.",
                "6.  Differentiate between multi programming and Monoprogramming. What will be the CPU utilization with 6 processes with 60% IO waiting time are in memory?",
                "7.  How can you manage free disk space? Explain the linked list approach of managing free disk space with example.",
                "8.  When programmed IO is suitable than other IO handling techniques? Explain the process of IO handling using DMA.",
                "9.  Differentiate between deadlock and starvation? Discuss the process of detecting deadlocks when there are multiple resources of each type.",
                "10.  What is problem associated with semaphores? Explain the concept of monitors in brief.",
                "11. Why program relocation and protection is important? Explain the technique of achieving program relocation and protection.",
                "12. Write short notes on:",
                "        - Linux File System",
                "        - Resource Allocation Graph"
            ]
        },
        {
            "year": "2078",
            "paragraphs": [
                "1. What kind of problem arises with sleep and wakeup mechanism of achieving mutual exclusion? Explain with suitable code snippet.",
                "2. why OPR is best but not practically feasible page replacement algorithm? Calculate the number of page faults for OPR, LRU and Clock page replacement algorithm for the reference string: 1, 3, 4, 2, 3, 5, 4, 3, 1, 2, 4, 6, 3, 2, 1, 4, 2. Assume that memory size is 3.",
                "3. How unsafe state differs from deadlock state? Consider following initial state and identify wheather requested resource is and granted or denies for the given cases.",
                "    ",
                "- What will happen if process D request 1 resource?",
                "- what will happen if process A request 1 resource?",
                "4. What is system call? Discuss process of handling system calls briefly.",
                "5. What is lock variable? Discuss its working and problems associated with it in detail.",
                "6. Differentiate between internal and external fragmentation? Suppose that we have memory of 1000 KB with 5 partitions of size 150 KB, 200 KB, 250 KB, 100 KB, and 300 KB. Where the processes A and B of size 175 KB and 125 KB will be loaded, if we used Best-Fit and Worst-Fit strategy?",
                "7. What is meant by file attributes? Discuss any one technique of implementing directories in detail.",
                "8. Why the concept of disk interleaving is important? Explain with suitable example.",
                "9. What is resource allocation graph? Explain the process of detecting deadlocks when there is single instance of each resource with suitable example?",
                "10. Discuss the concept of SJF and SRTN scheduling algorithms with suitable example.",
                "11. What approaches are used for managing free disk spaces? Explain linked list approach with suitable example.",
                "12. Write short notes on:",
                "        - IPC in Linux",
                "        - Disk access"
            ]
        }
    ]
}