{
    "subject": "Cryptography",
    "questions": [
        {
            "Chapter": "\n                                Unit: 1 Introduction and Classical Ciphers\n                            ",
            "Question": [
                "        a.\r\nThe larger the size of key space, the more secures a cipher? Justify your\r\nanswer.\n",
                "        a. All classical ciphers are based on symmetric key encryption.\r\nWhat does that mean?\n",
                "        a. How monoalphabetic substitution differs from polyalphabetic.\r\nBriefly define with suitable example.\n",
                "        b. What do you mean by reply attacks? Describe with an example. \n",
                "        a. List and briefly define types of cryptanalytic attacks based on\r\nwhat is known to the attacker.\n",
                "        a. Difference between monoalphabetic substitution ciphers and\r\npolyalphabetic substitution ciphers.\n",
                "        a. Suppose a key logger program intercepts user password and is\r\nused to modify the user account. Now, justify whether it’s a violation of\r\nconfidentiality, integrity, or availability or some of combination of them. \n",
                "        b. The larger the size of the key space, the more secure a cipher?\r\nJustify your answer.\n",
                "        b. What makes Vigenere cipher more secure than say, the Playfair\r\ncipher?\n",
                "        c. What is the importance of Trap Door function in cryptography?\n",
                "        b. What are the two building blocks of all classical ciphers?\n",
                "        d.\r\nDifferentiate between transposition cipher and substitution cipher?\n",
                "        d. how Vignere Cipher can be used to ensure poly-alphabetic substitution?\n",
                "            d. Define each of the\r\nterms confidentiality, integrity and availability. \n",
                "        c. Mention the advantages of using stream ciphers over block\r\nciphers. \n",
                "        d. How chosen plaintext attack differs from chosen ciphertext\r\nattack?\n",
                "        d. What are the characteristics of a stream cipher?\n",
                "5. Distinguish between stream cipher and block cipher. Encrypt the message WE ARE IN SAME RACE UNTIL OUR LIVE END using Rail fence cipher using 4 as number of rails.\n",
                "        g. John obtains Peter's credit card number and performs shopping. Does it violate confidentiality or integrity or both? Justify.\n",
                "        g.\r\nJohn copies Mary’s homework. Does it violate confidentiality or integrity or\r\nboth? Justify.\n",
                "        g. Give an example for a situation that compromise in\r\nconfidentiality leads to compromise in integrity.\n",
                "2.    a) What do you mean by transposition cipher? Decrypt the ciphertext UIESTNVRIY using the Railfence cipher using the rail size 2.\n",
                "    b) Encrypt the message “MEET ME TONIGHT” using the\r\nHill cipher with the key . Show your calculations and the result.\n",
                "    b) Construct a playfair matrix with the key “KEYWORD”. Using this\r\nmatrix encrypt the   message “WHY DON’T\r\nYOU”.                                                                                            (4)\n",
                "3.     a) Configure a Vigenere\r\ntable for the characters from A-H. Use the table to encrypt the text DAD CAFE\r\nEACH BABE using the key FADE.                                                      [4]\n \n",
                "    b) Construct a playfair matrix with the key CRYPTO. Using this matrix encrypt the message \"have a nice day\".\n",
                "4. a. Encrypt the message \"computing for human life\" to playfair cipher using key \"BSCCSIT\".\n",
                "11. Write down any two limitations of MAC? What does policy and mechanism mean in cryptography? Describe with a scenario.\n",
                "    b) Construct a playfair matrix with the key EXAMPLE.\r\nUsing this matrix encrypt the message “Hide the Gold”.                                                                                                 \n",
                "4. a) Encrypt the message “machine passed turing test” to playfair cipher\r\nusing key “ALANTURING”.                                                                                                             \n",
                "4.     a) Encrypt the message “help” using the Hill cipher\r\nwith the key . Show your calculations\r\nand the result.  [4] \n",
                "    b) Encrypt the message \"Eight Ten\" using the Hill cipher with the key . Show your calculations and the result.\n",
                "    b) Given the plaintext ”LOST IN PARADISE”, compute the ciphertext\r\nfor i. The Ceaser cipher\r\nwith key = 5 \r\n\r\n\r\n\r\n            ii.\r\nThe Railfence cipher with rails = 4                                                                         \n",
                "    b) Encrypt the message “NANI” using the Hill cipher\r\nwith the key . Show your calculations and the result.                                                                                                 \n",
                "    b)\r\nGiven the plaintext “ABRA KA DABRA”, compute the ciphertext for                       (4) i. The Ceaser cipher with key = 8\nii. The\r\nRailfence cipher with rails = 3\n",
                "    b) Define field. Differentiate between public key cryptography and\r\nprivate key cryptography.                                                                                                                     \n"
            ],
            "Asked": [
                "\nasked in 2075\n",
                "\nasked in 2068\n",
                "\nasked in 2069\n",
                "\nasked in 2073\n",
                "\nasked in 2067\n",
                "\nasked in 2070\n",
                "\nasked in 2071\n",
                "\nasked in 2067\n",
                "\nasked in 2068\n",
                "\nasked in 2076\n",
                "\nasked in 2070\n",
                "\nasked in 2075\n",
                "\nasked in 2074\n",
                "\nasked in 2072\n",
                "\nasked in 2071\n",
                "\nasked in 2069\n",
                "\nasked in 2067\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2076\n",
                "\nasked in 2075\n",
                "\nasked in 2069\n",
                "\nasked in 2074\n",
                "\nasked in 2072\n",
                "\nasked in 2069\n",
                "\nasked in 2071\n",
                "\nasked in 2074\n",
                "\nasked in 2076\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2073\n",
                "\nasked in 2075\n",
                "\nasked in 2071\n",
                "\nasked in 2074\n",
                "\nasked in 2072\n",
                "\nasked in 2073\n",
                "\nasked in 2069\n",
                "\nasked in 2075\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 2 Symmetric Ciphers\n                            ",
            "Question": [
                "1. Among monoalphabetic and polyalphabetic cipher, which one is more vulnerable? Justify your statement. Which types of keys are considered as weak keys in DES? Explain round operations in IDEA.\n",
                "        a. Why the procedure used during encryption-decryption process of\r\nDES is often known as managing or criss-crossing? \n",
                "        b. Find Multiplicative inverse of each nonzero elements in Z5.\n",
                "              c. What is the purpose\r\nof S-Box in DES? \n",
                "        c. Find Multiplicative inverse of each nonzero element in Z6. \n",
                "        c. Explain the concepts of diffusion and confusion as used in DES.\n",
                "        c. Des encryption was broken in 1999. Does that make this an\r\nunimportant cipher? Why do you think that happened?\n",
                "        c. What do you mean by avalanche effect?\n",
                "        d. How many rounds are used in AES and what does the number of rounds depend on?\n",
                "        e.\r\nWhat does Zn refer to in cryptography? Illustrate with an\r\nexample.\n",
                "        e. Using extended Euclidean Algorithm, find multiplicative inverse of 550 and 1769.\n",
                "        d. When does a set become a group?\n",
                "        d. What does a field have, that an integral domain does not? Why\r\nis Zn not an integral domain?\n",
                "        e. What does Zn refer to in cryptography? Illustrate with an example.\n",
                "        f.\r\nWhat is the additive inverse of 2 in Z10?\n",
                "        e. What is the difference between the notation a mod n and the\r\nnotation a ≡ b (mod n)?\n",
                "        e. What do you mean by multiplicative inverse? Find multiplicative\r\ninverse of each nonzero elements in Z11.\n",
                "        e. Does a field contain a multiplicative inverse for every element\r\nof the field?\n",
                "        g. What do you mean by odd round in IDEA?\n",
                "        f. Even though we have a strong algorithm like 3-DES, still AES is\r\npreferred as a reasonable candidate for long term use. Why?\n",
                "        f. What are the four steps that are executed in a single round of\r\nAES processing?\n",
                "2. a) What do you mean by “Fiestel Structure for Block Ciphers”? Explain.                       \n",
                "        g. How many rounds are used in\r\nAES and what does the number of rounds depend on?\n",
                "        g. Briefly describe SubBytes\r\nand ShiftRows in AES. \n",
                "2.    a) The notation Zn stands\r\nfor the set of residues. What does that mean? Why is Zn not a finite\r\nfield? Explain.         (5) \n",
                "2.     a) What is Euclid’s algorithm for finding the GCD of two numbers?\r\nExplain.                (5)\nOR\nWhat\r\nis Euler’s theorem? What is the totient of a prime number? \n",
                "    b. Find the multiplicative inverse of 11 in Z26 using extended Euclidean algorithm.\n",
                "2. a) Describe Extended Euclidean Algorithm. Use this\r\nalgorithm to test whether any two number n1, n2 are co-prime or not?                                                   \n",
                "2.     a) What do you mean by a \"Feistel Structure for Block\r\nCiphers\"? Explain.                     (5) \n",
                "    b) Consider the message blocks m1, m2, m3. If the Cipher Block Chaining mode DES encryption can be expressed as  Now, write the expressions for the DES decryption to extract each of the message blocks m1, m2, m3.\n",
                "9. Explain the procedure of mix column transformation in AES with an example.\n",
                "3. a. Find the result of the following operations.        i) 27 mod 5        ii) 36 mod 12        iii) -18 mod 14        iv) -7 mod 10        v) -13 mod 7\n",
                "       b) Find the multiplicative inverse of each nonzero\r\nelement in Zn.                                   (5)\n",
                "    b) Divide 5x2+4x+6 by 2x+1 over GF(7).\n",
                "        b)\r\nDivide 23x2 + 4x + 3 by 5x + c, assuming that the polynomials are over the\r\nfield Z7.      (5)    \n",
                "    b) How IDEA operates on 64-bit blocks using 128-bit\r\nkey? Describe each round of operations that IDEA follows to generate ciphertext\r\nof a 64-bit input message block.    \n",
                "          b) Calculate the result of the following\r\nif the polynomial are over GF(2):                       (5)     (x4 +\r\nx2 + x + 1) + (x3+1)    (x4 + x2 + x + 1) – (x3+1)    (x4 + x2 + x + 1) x (x3+1)\n    (x4 + x2 + x + 1) / (x3+1)\n",
                "            ORWhat are the asymmetries between the modulo n addition and modulo\r\nn multiplication over Zn? \n",
                "3. a) Find the result of the\r\nfollowing operations.            \n    (i) 2 mod 5     (ii) 33 mod 3     (iii) -13 mod 10     (iv) -23 mod 10     (v) -8 mod 7\n",
                "            ORComplete\r\nthe following equalities for the numbers in GG(2):\n1+1 = ? \n1-1 = ?\n-1 = ? \n1*1 = ? \n1 * -1 = ? \n",
                "3.     a) Let’s go back to the first step of processing in\r\neach round of AES. How does one look up the 16x16 S-box table for the\r\nbyte-by-byte substitution?                                             (5)\n",
                "3.     a) Describe the ''mix\r\ncolumns'' transformation that constitutes the third step in each round of AES.                                                                                                                              (5)\n",
                "3.    a) What are the steps\r\nthat go into the construction of the 16 × 16 S-box lookup table for AES\r\nalgorithm?                                                               \r\n                                                 (5)\n",
                "4. a) Briefly describe about MixColumns and AddRoundKey\r\nstages in AES. How many bytes in a state are affected by ShiftRows round?                                                         \n",
                "5.     a) What is the purpose of S-Boxes in DES? Prove that\r\nDES satisfies complementation property?                                                                                                                            (6) \n",
                "    b) Describe the method for generating Round Constant table in AES\r\nalgorithm in Add Round Key phase. Assume the number of rounds is 10.                                                   \n",
                "    b. Describe the \"mix columns\" transformation that constitutes the third step in each round of AES.\n",
                "    b) Determine whether the integers 105 and 294 are relatively\r\nprime. Explain your answer using Euclidean algorithm.                                                                                                (4)\n",
                "    b. List the modes of operation in cryptography? Describe the Fiestel cipher structure.\n"
            ],
            "Asked": [
                "\nasked in 2076 (new)\n",
                "\nasked in 2073\n",
                "\nasked in 2074\n",
                "\nasked in 2072\n",
                "\nasked in 2073\n",
                "\nasked in 2067\n",
                "\nasked in 2070\n",
                "\nasked in 2069\n",
                "\nasked in 2076\n",
                "\nasked in 2075\n",
                "\nasked in 2074\n",
                "\nasked in 2068\n",
                "\nasked in 2070\n",
                "\nasked in 2076\n",
                "\nasked in 2075\n",
                "\nasked in 2068\n",
                "\nasked in 2069\n",
                "\nasked in 2070\n",
                "\nasked in 2074\n",
                "\nasked in 2069\n",
                "\nasked in 2070\n",
                "\nasked in 2075\n",
                "\nasked in 2067\n",
                "\nasked in 2071\n",
                "\nasked in 2067\n",
                "\nasked in 2070\n",
                "\nasked in 2076\n",
                "\nasked in 2073\n",
                "\nasked in 2068\n",
                "\nasked in 2074\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2076\n",
                "\nasked in 2067\n",
                "\nasked in 2075\n",
                "\nasked in 2068\n",
                "\nasked in 2073\n",
                "\nasked in 2070\n",
                "\nasked in 2068\n",
                "\nasked in 2075\n",
                "\nasked in 2067\n",
                "\nasked in 2070\n",
                "\nasked in 2068\n",
                "\nasked in 2067\n",
                "\nasked in 2072\n",
                "\nasked in 2069\n",
                "\nasked in 2075\n",
                "\nasked in 2076\n",
                "\nasked in 2069\n",
                "\nasked in 2076\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 3 Asymmetric Ciphers\n                            ",
            "Question": [
                "                a. What does Euler\r\nTotient function means? What will be the value of PHI (119)? \n",
                "2. State the Fermat's theorem with example. Given the prime number p=29 and the primitive root g=8, private key of sender with X=9  and random integer K=11, encrypt the message m=13 using Elgamal cryptosystem.\n",
                "        c. AES is a block cipher. What sized blocks are used by AES?\n",
                "4. Define discrete logarithm. Explain the procedure of sharing the secret key in Diffie Hellman.\n",
                "            e. What do you mean by\r\nprimitive root of a prime number p? Is 3 a primitive root of 7? \n",
                "        d. What does Euler Totient Theorem states? What is the value of\r\nTotient(15)? \n",
                "        g. How do you define a prime number? When are two numbers A and B\r\nconsidered to be coprimes?\n",
                "2. a. What is Fermat's Little theorem? What is the totient of a prime number? Give an example.                OR    Define primitive root of a prime number with a suitable example,\n",
                "2. a) In a RSA system, a user has chosen the primes 5 and\r\n19 to create a key pair. The public key is {e=5, n=?} and the private key is\r\n{d=?, n=?}. Decide the private key {d, n}. Show encryption and decryption\r\nprocess for the message “TOGA”                                           \n",
                "2.     a) Consider a\r\nDeffie-Hellman scheme with a common prime p = 11 and a primitive root g= 2.\ni. Show that 2 is a primitive\r\nroot of 11.\nii. If user A has\r\npublic key Ya = 9, what is A’s private key Xa?\niii. If\r\nuser B has public key Yb = 3, what is shared key K, shared with A.         (3x2=6) \n",
                "                            ORHow can a number can be\r\ntested for primality testing using Miller-Rabin algorithm? Explain.\n",
                "2.     a) In public key cryptosystem, each of the communicating parties,\r\nin general, should know the public keys of each other before attempting\r\nsecurity encryptions. How this can be achieved? Write a Public Key Authority\r\nProtocol for Public-key distribution among any two users.                                                                                                                    [4] \n",
                "10. what is the role of prime number in Euler totient function? Find the GCD of 12 and 16 using Euclidean algorithm.\n",
                "    b. How can RSA can be used for generating public and private key? Explain.\n",
                "    b) What do you mean by man-in middle attack? Is man-in-middle\r\nattack possible in Deffie-Hellman? How?                                                                                                     \r\n(5)\n",
                "4.    a) In a RSA system, a user named Messi has chosen the primes 5 and 11 to create a key pair. Now show the generation of public key pair (eMessi, n) and private key pair (dMessi, n). Show how Messi can encrypt the message \"Soccer\" using his own public key.\n",
                "    b) How can Diffie-Hellman can be used for key exchange? Explain.                               \n",
                "       b) In RSA algorithm,\r\nwhat is necessary condition that must be satisfied by the modulus n chosen for\r\nthe generation of the public and private key pair? Also, is the modulus made\r\npublic?                                                                                                                                (5)\r\n\nOR\n",
                "4. a) In a RSA system, a user has chosen the primes 5 and\r\n19 to create a key pair. The public key is (5, n) and the private key is (d,\r\nn). Decide the private key (d, n). Show encryption and decryption process for\r\nthe message “Drogba”.                                                           \n",
                "    b) Miller-Rabin test says that if a candidate integer n is prime, it\r\nmust satisfy one of two special conditions. What are those two conditions?                                                        \r\n (5)\n",
                "4.     a) Miller-Rabin\r\nalgorithm for primality testing is based on a special decomposition of odd  numbers. What is that? Explain                                                               \r\n                         (5) \n",
                "5.  a) How do you create\r\npublic and private keys in the RSA algorithm for public-key cryptography?          (5)\nOR\n",
                "5.     a) How do you create\r\npublic and private keys in the RSA algorithm for public-key cryptography?                                                                                                                    (5)                                                OR\n",
                "     b) In RSA algorithm, the\r\nnecessary condition for the encryption key e is that it be coprime  to the totient of the modulus. But, in practice, what is e typically set\r\nto and why?            (5) \n",
                "6. a) How Man-In-Middle attack is possible in\r\nDeffie-Hellman Algorithm. Support answer with a numerical computation. Chose\r\nthe required parameters with your own assumptions.\n",
                "6.    a) Suppose there are two users Xavi and Persie who agreed to use Deffie-Hellman algorithm to exchange a key. Consider there is an eavesdropper Balotelli who attemps attack on the procedure. Show how Balotelli can perofrm Man-In-Middle attack in the Deffie-Hellman Key exchange protocol?\n",
                "      b) What is Fermat's Little Theorem? What is the\r\ntotient of a number?                             (5) \n",
                "    b) What do you mean by Man-in-Middle attack? Is man in\r\nmiddle attack possible in Diffie-Hellman algorithm for key exchange? How?                                                         \n",
                "        b) How can public-key cryptography be used\r\nfor document authentication?                     (5) OR\n       What seems so counterintuitive about the\r\ncounter mode (CTR) for using a block cipher?\n",
                "5.     a) Miller-Rabin test\r\nfor primality is based on the fact that there are only two numbers in Zp that\r\nwhen squared give us 1. What are those two numbers?                                       (5)\nOR\n",
                "What\r\nis discrete logarithm and when can we define it for a set of numbers?             (5) \n",
                "         b) What is the Diffie-Hellman algorithm\r\nfor exchanging a secret session key?               (5) \n"
            ],
            "Asked": [
                "\nasked in 2072\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2068\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2072\n",
                "\nasked in 2071\n",
                "\nasked in 2068\n",
                "\nasked in 2076\n",
                "\nasked in 2072\n",
                "\nasked in 2069\n",
                "\nasked in 2075\n",
                "\nasked in 2071\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2076\n",
                "\nasked in 2070\n",
                "\nasked in 2074\n",
                "\nasked in 2075\n",
                "\nasked in 2067\n",
                "\nasked in 2073\n",
                "\nasked in 2070\n",
                "\nasked in 2068\n",
                "\nasked in 2071\n",
                "\nasked in 2070\n",
                "\nasked in 2068\n",
                "\nasked in 2073\n",
                "\nasked in 2074\n",
                "\nasked in 2067\n",
                "\nasked in 2072\n",
                "\nasked in 2068\n",
                "\nasked in 2067\n",
                "\nasked in 2067\n",
                "\nasked in 2067\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 4 Cryptographic Hash Functions and Digital Signature\n                            ",
            "Question": [
                "        a. How MAC differs from Hash? Is authentication and authorization refers to same term or different? Justify.\n",
                "                b. What properties does a good hash function should have? \n",
                "3. Compare the SHA parameters between SHA-1 and SHA-2 family. Decrypt the cipher text DRJI with key  using Hill cipher.\n",
                "        c.\r\nWhat is weak collision resistance property of hash function?\n",
                "        c. Why Hash Functions are often known as one way functions?\n",
                "        d. Mention the image resistive properties of Hash functions. \n",
                "6. Define digital signature. Describe the approaches of DSS.\n",
                "        f. What do you mean by one-time signatures? \n",
                "        f. How Message Authentication Codes differ from Hash Functions? \n",
                "        g. What is a hash code? Why\r\ncan a hash function not be used for encryption?\n",
                "3.    a) How padding is done in MD5? What enhancements in MD4 are done to get better hash function MD5?\n",
                "    b) What basic arithmetic and logical functions are\r\nused in SHA-1?                                 \n",
                "3. a) How padding is done in SHA-1? How 160-bit of hash\r\nvalue is generated by taking an input message of variable size using SHA-1?                                   \n",
                "        b) Mention the details\r\nof logical operations used in MD4. How the Majority function in Pass 1 of MD4\r\nworks?                                                                                                       [6] \n",
                "      b) What is the difference between algorithmically generated random\r\nnumbers and true random numbers?                                                                                                                   (5)\n",
                "4.     a) How Hash functions\r\ndiffer from MAC? Given a message m, discuss what arithmetic and logical\r\nfunctions are used by MD4 to produce message digest of 128 bits.           (2+4) \n",
                "        b) What do you mean by arbitrated digital signature?\r\nHow signatures are generated using Digital Signature System?       [6]\n",
                "5. a. Does it possible to design collision free hash function? What does birthday attack refers to? Explain.\n",
                "5.    a) What is the use of digital signature? Discuss the working mechanism of Digital Signature Algorithm.\n",
                "    b) What is the digital signature for, authentication of confidentiality?\r\nJustify your answer. What does security handshake pitfall refer to?                                                                  \n",
                "5. a) Why hash functions are known to be best option for\r\ndigital signature schemes? How about the use of encryption paradigms for\r\ngenerating digital signatures?                        \n",
                "6. a) Differentiate between direct digital signature and\r\narbitrated digital signature. How signing and verifying process is done in\r\nDigital Signature Standard. \n",
                "5.     a) What is meant by the\r\nstrong collision resistance property of a hash function?               (5) \n",
                "6.     a) What do you mean by digital signature? How digital\r\nsignatures can be enforced using encryptions? Illustrate with an example.                                                                       (1+5)\n",
                "6. a) Is hash and MAC resemble the same meaning? Explain how SHA generates 160\r\nbit digest value?                                                                                                                      \n",
                "6.     a) How hash function\r\ndiffer from MAC? Discuss how data integrity can be achieved from either of\r\nthem.                                                                                                                    (5)\n",
                "6.     a) How hash function\r\ndiffer from MAC? Discuss how data integrity can be achieved from either of\r\nthem.             (5) \n",
                "      b) What is the relationship between ''hash'' as in\r\n''hash code'' or ''hashing function'' and ''hash'' as in a ''hash table''?                                                                                                (5)  \n"
            ],
            "Asked": [
                "\nasked in 2076\n",
                "\nasked in 2072\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2075\n",
                "\nasked in 2074\n",
                "\nasked in 2073\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2073\n",
                "\nasked in 2071\n",
                "\nasked in 2070\n",
                "\nasked in 2074\n",
                "\nasked in 2072\n",
                "\nasked in 2073\n",
                "\nasked in 2071\n",
                "\nasked in 2068\n",
                "\nasked in 2069\n",
                "\nasked in 2071\n",
                "\nasked in 2076\n",
                "\nasked in 2074\n",
                "\nasked in 2075\n",
                "\nasked in 2073\n",
                "\nasked in 2072\n",
                "\nasked in 2068\n",
                "\nasked in 2069\n",
                "\nasked in 2075\n",
                "\nasked in 2070\n",
                "\nasked in 2071\n",
                "\nasked in 2067\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 5 Authentication\n                            ",
            "Question": [
                "        b. What are the components of authentication system? Give an\r\nexample of authentication system.\n",
                "    b. Explain about the working mechanism of Kerberos.\n",
                "5. a) In which situation using Kerberos system seem to be\r\ngood? Describe what the major components of Kerberos system are.                                                                             \n",
                "    b) What do you mean by password aging? How online dictionary attacks differ from offline attacks?\n",
                "    b) Define authentication system. How hardware based\r\nchallenge response systems can be used as authentication approach.                                                                                       \n"
            ],
            "Asked": [
                "\nasked in 2069\n",
                "\nasked in 2076\n",
                "\nasked in 2072\n",
                "\nasked in 2074\n",
                "\nasked in 2073\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 6 Network Security and Public Key Infrastructure\n                            ",
            "Question": [
                "        f. List the five services that PGP operation is based on.\n",
                "        f. Define PKI Trust Model.\n",
                "               e. Differentiate session keys from interchange keys. \n",
                "            f. Describe the concept\r\nbehind public key infrastructure. \n",
                "        f. What do you mean when we say that a pseudorandom number\r\ngenerator is cryptographically secure?\n",
                "7. What is the task of firewall? List the elements of X.509.\n",
                "        g. How security at application layer can be achieved? \n",
                "3. a) Differentiate between SSL Session and SSL\r\nConnection. How SSL Record protocol provides confidentiality and message\r\nintegrity.\n",
                "        b) How Kerberos Version 4 differs from Kerberos Version 5? How\r\nonce per type of service approach is ensured by Kerberos Protocol.                                                           [6] \n",
                "    b) Does Kerberos protocol ensures authentication and\r\nconfidentiality in secure system? Explain.                                                                                                                              (5)\n",
                "    b) What is the role of SSL Handshake Protocol in Secure Socket layer Protocol?\n",
                "4.     a) There are two\r\naspects to a secure communication link: authentication and confidentiality. How\r\ndo you understand these two words? Does the Kerberos protocol give us both?                                                                                                                      (5) \n",
                "    b) List the participants of Secured Electronic\r\nTransaction (SET). Discuss the key features of SET.   \n",
                "How is\r\nthe sender authentication carried out in PGP?                                                (5) \n",
                "    b) How SSL Record Protocol provides security in Secure\r\nSocket Layer Protocol?         \n",
                "    b) Discuss the five principle services provided by PGP\r\nprotocol.                                    (4)\n",
                "5. a)\r\nExplain about PGP.                                                                                                 OR\n      What is the role of the SSL Record\r\nProtocol in SSL/TLS? Explain.                             \n",
                "            OR    What is the role of SSL Record Protocol in SSL/TLS? Explain.\n",
                "4.     a) What sort of secure\r\ncommunication applications is the Kerberos protocol intended for? Explain.                                                                                           \r\n                                  (5) \n",
                "    What are the notions Public Key Ring and Private Key\r\nRing in PGP?\n",
                "What\r\nare the notions Public Key Ring and Private Key Ring in PGP? \n",
                "        b) What is the\r\ndifference between a connection and a session in SSL/TLS? Can a session include\r\nmultiple connections? Explain the notions “connection state” and “session sate”\r\nin SSL/TLS. What security features apply to each?                                                               (5) \n",
                "b) What is the difference between a connection and a session in\r\nSSL/TLS? Can a session include multiple connections? Explain the notions\r\n“connection state” and “session sate” in SSL/TLS. What security features apply\r\nto each?                                                          (5)\n",
                "6. a. Define digital signature. How certificates are issued in PKI trust models? Explain.\n",
                "6.     a) What is the role of\r\nthe SSL Record Protocol in SSL/TLS? Explain.                              (5)\nOR\nHow\r\nmany layers are in the TCP/IP protocol suite for internet communications? Name\r\nthe  layers. Name some of the protocols\r\nin each layer. \n",
                "        b) What is a\r\ncertificate and why are certificates needed in public key cryptography?     (5) \n",
                "    b)\r\nWhat is a certificate and why are certificates needed in public key\r\ncryptography? (5) \n",
                "    b) What does PGP stand for? What is it used primarily for? And\r\nwhat are the five services provided by the PGP protocol? \n",
                "6.     a) We say that SSL/TLS\r\nis not really a single protocol, but a stack of protocols. Explain. What are\r\nthe different protocols in the SSL/TLS stack?   \r\n                                               (5) \n"
            ],
            "Asked": [
                "\nasked in 2076\n",
                "\nasked in 2074\n",
                "\nasked in 2071\n",
                "\nasked in 2072\n",
                "\nasked in 2067\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2073\n",
                "\nasked in 2072\n",
                "\nasked in 2071\n",
                "\nasked in 2069\n",
                "\nasked in 2074\n",
                "\nasked in 2070\n",
                "\nasked in 2072\n",
                "\nasked in 2067\n",
                "\nasked in 2073\n",
                "\nasked in 2069\n",
                "\nasked in 2075\n",
                "\nasked in 2076\n",
                "\nasked in 2067\n",
                "\nasked in 2071\n",
                "\nasked in 2070\n",
                "\nasked in 2071\n",
                "\nasked in 2070\n",
                "\nasked in 2076\n",
                "\nasked in 2068\n",
                "\nasked in 2071\n",
                "\nasked in 2070\n",
                "\nasked in 2068\n",
                "\nasked in 2067\n"
            ]
        },
        {
            "Chapter": "\n                                Unit: 6 Malicious Logic\n                            ",
            "Question": [
                "        a. What are the typical phases of operation of virus?\n",
                "        b.\r\nDifferentiate between virus and Trojan horse.\n",
                "        b. Differentiate between virus and worms.\n",
                "        b. How zombies differ from logic bombs? \n",
                "        e. How rabbits and bacterium can be malicious to a secure system? \n",
                "        e. How afraid should you be of viruses and worms?\n",
                "        f. What is the difference between a virus and a worm?\n",
                "            g. What are the possible\r\nphases that a virus can go through, during its life cycle? \n",
                "8. How does the nature of worms differ with virus? Define PKI with its architecture model.\n",
                "3.     a) How Trojan horse\r\ndiffers from viruses? Discuss about possible types of Trojan horses.                                                                                                                                    (2+3)\n",
                "12. Write short notes on (Any Two)        a. Classes of intruder        b. SSL        c. Dos Attack\n"
            ],
            "Asked": [
                "\nasked in 2074\n",
                "\nasked in 2075\n",
                "\nasked in 2076\n",
                "\nasked in 2071\n",
                "\nasked in 2073\n",
                "\nasked in 2067\n",
                "\nasked in 2068\n",
                "\nasked in 2072\n",
                "\nasked in 2076 (new)\n",
                "\nasked in 2069\n",
                "\nasked in 2076 (new)\n"
            ]
        }
    ]
}