{
    "subject": "AdvancedDatabase",
    "questions": [
        {
            "Chapter": "Unit 1: Enhanced Entity Relationship Model and Relational Model \n                                            \n\n                                                22 Questions",
            "Question": [
                "1. Discuss query optimization with suitable example. What is the importance of query optimization in database? (4 + 2)",
                "1) Explain the following terms:     a) Database performance tuning     b) UML     c) Subclass vs Superclass     d) X Query     e) Calendars     f) Active Database",
                "1. Explain the following terms:     a) Data replication     b) UMI     c) SOL: 2003     d) Xpath     e) SOAP     f) Clustering",
                "1. What is query processing? How is it different from query optimization? Discuss cost estimation for relational algebra expressions.",
                "1. How do you increase performance of the database? Explain any one database performance tuning technique with example. (2+4)",
                "1. Explain the following terms:a. Spatial databaseb. ECA modelc. Federated DBMSd. Well-formed and valid XML documente. GISf. Classification and clustering",
                "2. How can you convert an EER design to a relational design? Discuss with suitable example.(6)",
                "2.What is data fragmentation? Discuss horizontal and vertical fragmentation in detail.",
                "2) What are query optimization techniques? Explain.",
                "2. What is query processing? How is it different from query optimization? Discuss heuristic query optimization.(1+2+3)",
                "3. Discuss various type constructors used in object-oriented database. How are they used to create complex objects?(4+2)",
                "3. What are the benefits of using distributed databases? Discuss different types of distributed database systems. (3+3)",
                "4. What is complex object? What is the difference between structured and unstructured complex objects?(1+5)",
                "5. Define object relational database. Discuss different types of knowledge discovered during data mining.(1+5)",
                "6) Write a schema that provides tags for a person’s first name, last name, weight, and shoesize. Weight and shoe size tags should have attributes      to designate measuring systems.",
                "6. What is active database ? Discuss generalized mode for active databases?(2+4)",
                "7. Discuss how time is represented in temporal databases and compare the different time dimensions.(3+3)",
                "8. What is data mining ? Discuss different types of knowledge discovered during data mining.(1+5)",
                "8. Describe the main reasons for the potential advantage for distributed database. What additional functions does it have over centralized DBMS?",
                "9. What is data warehouse ? How does it differ from a databases ?(2+4)",
                "10. What is mobile database? Discuss mobile computing architecture in detail.(1+5)",
                "10. Write short notes on:(2x3)a) Integrity constraintb) Mobile database"
            ],
            "Asked": [
                "6 marks Asked in 2077",
                "6 marks Asked in 2072",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2076",
                "6 marks Asked in 2075",
                "10 marks Asked in Model",
                "6 marks Asked in 2077",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2077",
                "6 marks Asked in 2075",
                "6 marks Asked in 2077",
                "6 marks Asked in 2077",
                "6 marks Asked in 2070",
                "6 marks Asked in 2077",
                "6 marks Asked in 2077",
                "6 marks Asked in 2077",
                "6 marks Asked in 2071",
                "6 marks Asked in 2077",
                "6 marks Asked in 2077",
                "6 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 2: Object and Object Relational Databases \n                                            \n\n                                                13 Questions",
            "Question": [
                "1. Discuss different constraints of specialization and generalization.",
                "2) Draw an ER Diagram for a hospital with a set of patients and set of doctors associated with each patient a log of various tests and examinations conducted.",
                "2. Draw an ER diagram for a hospital with a set of patients and a set of doctors. Associate with each patient a log of various tests and examinations conducted.",
                "2) How can you convert an ERR design to relational design? Discuss with suitable example.",
                "2. How does a category differ from a regular shared subclass? What is a category used for? Illustrate your answer with suitable examples.                                          ORDescribe the steps of the algorithm for object database design by EER-to-OO mapping.",
                "3.Why do we need extended ER modeling? Discuss class/subclass relationship with example.",
                "3) Differentiate between specialization and generalization with example.",
                "3. Define state of an object. Distinguish between persistent and transient objects.",
                "3) What is the difference between an object and a..... in the object oriented data model (OOBM)?",
                "3. Explain the process of EER to relational mapping with example.",
                "4) What are the main difference between designing a relational database and an object database?",
                "8) Distinguish object-oriented database and object relational databases.",
                "9) What are the advantages and disadvantages of extending the relational data model by means of ORDBMS?"
            ],
            "Asked": [
                "6 marks Asked in 2073",
                "6 marks Asked in 2070",
                "6 marks Asked in 2073",
                "6 marks Asked in 2069",
                "10 marks Asked in Model",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071",
                "6 marks Asked in 2070",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2070",
                "6 marks Asked in 2069",
                "6 marks Asked in 2070"
            ]
        },
        {
            "Chapter": "Unit 3: Query Processing and Optimization \n                                            \n\n                                                44 Questions",
            "Question": [
                "1) Explain the following terms:     a) Extent     b) Temporal Database     c) Degree of homogeneity of DBMS     d) X Path     e) Classification and clustering     f) OLAP",
                "2. What is mobile computing? Explain its architecture.",
                "2. Distinguish multiple inheritance and selective inheritance in OO concepts.",
                "3) What is OID? How persistent objects are maintained in OO Database?",
                "3. What is the difference between persistent and transient objects? How persistence is handled in typical OO database systems?",
                "3. Define encapsulation? How is it used to create abstract data types?",
                "4.How do object relational database support multi-valued and composite attributes? Discuss with example.",
                "4) Discuss the relative advantages of centralized and distributed database.",
                "4. Discuss the concept of encapsulation, and tell how it is used to create abstract data types.",
                "4. Describe different implementation issues with object relational database system.",
                "4. What is versioning? Why is it important? What is the difference between versions and configurations?",
                "4. What are the benefits of using object oriented databases over relational databases? Discuss different type of constructors used in object oriented databases. (2+4)",
                "4) How do single inheritance, multiple inheritance and selective inheritance differ?",
                "4. Discuss how time is represented in temporal databases and compare the different time dimensions.",
                "5. What is the difference between structured and unstructured complex object?Differentiate identical versus equal objects with examples.",
                "5. What are the differences between structured and unstructured complex objects ? Explain",
                "5. Discuss different implementation issues related with object relational database. (6)",
                "5. Discuss the different technique for executing an equijoin of two files located at different sites. What main factors affect the cost of data transfer?                                            ORWhat are the main difference between designing a relational database and an object database?",
                "5.What are the uses of active database? Discuss active database with example.",
                "5. What is object relational database? Discuss object relational features of SQL.",
                "5) Discuss some applications of active database. How do spatial databases differ from regular database?",
                "5) What are the differences between structured and unstructured complex objects? Explain.",
                "5) Describe different implementation issues with object relational database system.",
                "6. Define GIS. Discuss different data modeling and representation for GIS data. (1+5)",
                "6) Discuss the different techniques for executing equijoin of two files located at different sites. What main factors affect the cost of data transfer?",
                "6. What is temporal database? Explain the terms date, time, timestamp, interval and period.",
                "6.Discuss mobile computing architecture. Discuss mobile data management in detail.",
                "6. Define active database. Discuss some applications of active databases.",
                "6. What are the advantages and disadvantages of OODBMS?",
                "7. Define multimedia database. Discuss benefits of multimedia databases. How do you query image database? (1+2+3)",
                "7. Explain mobile computing architecture with suitable diagram.",
                "7. What is the difference between valid time, transaction time, and bitemporal relations?",
                "7) Discuss how time is represented in temporal database and compare different time dimensions.",
                "7) Distinguish between structured and unstructured complex objects.",
                "7.Why do we need temporal database? Discuss valid time, transaction time and bi-temporal relations.",
                "8. What is multimedia database? What are the nature of multimedia database and applications?",
                "9. Describe the characteristics of mobile computing environment in detail.",
                "9) Describe multimedia database and what are the different types of multimedia data that are available in current systems?",
                "10. What is GIS? What are GIS data operations?",
                "10. Describe the main reasons for and potential advantages for distributed database. What additional functions does it have over centralized DBMS?",
                "10) Enumerate the limitations of conventional database compared to multimedia database.",
                "10) Explain mobile computing architecture with suitable diagram.",
                "10.Write short notes on:Deductive database ODMG.",
                "10. What is mobile database? Discuss the characteristics of mobile environments."
            ],
            "Asked": [
                "6 marks Asked in 2070",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2071",
                "6 marks Asked in 2069",
                "10 marks Asked in Model",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "7.5 marks Asked in 2074",
                "10 marks Asked in Model",
                "6 marks Asked in 2073",
                "6 marks Asked in 2075",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071",
                "6 marks Asked in 2071",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2075",
                "10 marks Asked in Model",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2070",
                "6 marks Asked in 2072",
                "6 marks Asked in 2069",
                "6 marks Asked in 2075",
                "6 marks Asked in 2069",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "10 marks Asked in Model",
                "6 marks Asked in 2073",
                "6 marks Asked in 2072",
                "6 marks Asked in 2070",
                "6 marks Asked in 2076",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "5 marks Asked in 2074",
                "10 marks Asked in Model",
                "6 marks Asked in 2070",
                "6 marks Asked in 2069",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073"
            ]
        },
        {
            "Chapter": "Unit 4: Distributed Databases, NOSQL Systems, and BigData \n                                            \n\n                                                11 Questions",
            "Question": [
                "1. Explain the following terms:     a) Data Warehouse     b) Distribution Transparency     c) X Query     d) Distribution transaction     e) Knowledge base     f) Classification and clustering",
                "1) Explain the following terms:     a) Data mining     b) ECA model     c) Spatial database     d) Specialization and generalization in an ERR model     e) XML and HTML     f) GIS",
                "7.What is data warehouse? Explain the architecture for the functionality of data warehouse.",
                "8. What is data mining? Discuss data mining as a part of knowledge discovery process.",
                "8) What is data warehouse? List the characteristics of data warehouse.",
                "8.Discuss benefits and applications of data mining. How is classification different from clustering?",
                "8. Discuss data warehouse and its functionality. Discuss association rule mining with example. (3+3)",
                "9. What is a data warehouse? How does it differ from a database?                                            OR                        Describe multimedia database and what are the different types of multimedia data that are available in current systems?",
                "9. What is data warehouse? Discuss the typical functionality of data warehouse.",
                "9. What is data mining? Discuss association rule mining with example.",
                "9) What is a data warehouse? How does it differ from a database?"
            ],
            "Asked": [
                "6 marks Asked in 2071",
                "6 marks Asked in 2069",
                "7.5 marks Asked in 2074",
                "6 marks Asked in 2073",
                "6 marks Asked in 2070",
                "6 marks Asked in 2076",
                "6 marks Asked in 2075",
                "10 marks Asked in Model",
                "6 marks Asked in 2073",
                "5 marks Asked in 2074",
                "6 marks Asked in 2069"
            ]
        },
        {
            "Chapter": "Unit 5: Advanced Database Models, Systems, and Applications \n                                            \n\n                                                10 Questions",
            "Question": [
                "6) What are the object relational features that have been included in SQL-99?",
                "6. Differentiate between attributes and elements in XML? List some of the important attributes used in specifying elements in XML schema.                                               ORWhat is the difference between structured and unstructured complex object? Differentiate identical versus equal objects with examples.",
                "7. What are the differences and similarities between objects and literals in the ODMG object model?",
                "7) Differentiate between attributes and elements in XML? List some of the important attributes used in specifying elements in XML schema.",
                "8. What are the difference and similarities between objects and literals in the ODMG Object Model?",
                "8) What are the difference and similarities between objects and literals in the ODMG Object Model?",
                "9. What is web service? Discuss SOAP in detail. (2+4)",
                "9.What is web service? Discuss SOAP in detail.",
                "10) Explain XML schema and XML DTD.",
                "10. Differentiate between XML schema and XML DTD with suitable example."
            ],
            "Asked": [
                "6 marks Asked in 2072",
                "10 marks Asked in Model",
                "6 marks Asked in 2071",
                "6 marks Asked in 2069",
                "10 marks Asked in Model",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071"
            ]
        }
    ]
}