{
    "subject": "ArtificialIntelligence",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                14 Questions",
            "Question": [
                "1. How turing Test is used to evaluate intelligence of a machine? What properties a machine should have to pass the Total turing test?[4+2]",
                "1.  What is Artificial Intelligence (AI)? Describe your own criteria\r\nfor computer program to be considered intelligent.",
                "1.  What is ‘Turing Test’\r\nin Artificial Intelligence (AI)? Criticize the performance of the ‘Turing Test’ to measure the intelligence of the machine.",
                "1.  Define with suitable supporting statements and examples,\r\n“Artificial Intelligence is the system that act like humans”.",
                "1.  Do you agree “the development of Artificial Intelligence has had\r\nsome negative effect on the society”? If you agree list some of them and put\r\nyour opinion in the support of development of Artificial Intelligence.",
                "1. How the dimensions like thinking humanly and thinking rationally are used to evaluate intelligence behavior of a machine.",
                "1.  How can you define AI from the dimension of rationality?",
                "1.  Define Artificial\r\nIntelligence (AI). Explain the behaviors of the AI. What do you mean by Turing\r\nTest? Explain it.",
                "2.  What is ‘Turing Test in AI? Criticize the performance of the\r\n‘Turing Test’ to measure the intelligent of the machine.",
                "2.  Justify that “System that think rationally” and “System that act\r\nrationally” are the part of artificial intelligence. Explain it with practical\r\nexamples.",
                "2.  “System that think like\r\nhumans” and “System that act like humans” are the part of artificial\r\nintelligence. Justify that statement with practical examples.",
                "4. What is Turing Test? How it can be used to measure intelligence of machine?",
                "4.  What is Ai? How can you define AI from the perspective of thought process?",
                "10. How philosophy, sociology and economics influence the study of artificial intelligence?"
            ],
            "Asked": [
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2068",
                "6 marks Asked in 2070",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076",
                "6 marks Asked in 2067",
                "6 marks Asked in 2073",
                "6 marks Asked in 2072",
                "6 marks Asked in 2069",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2078"
            ]
        },
        {
            "Chapter": "Unit 2: Intelligent Agents \n                                            \n\n                                                8 Questions",
            "Question": [
                "1.  What do you mean by rational agents? Are the rational\r\nagents intelligent? Explain.",
                "2.  For each of the following agents, determine what type of agent\r\narchitecture is most appropriate (i.e. table lookup, simple reflex, goal-based\r\nor utility based).\na. Medical diagnosis\r\nsystem\nb. Satellite image analysis system\nc. Part-pricking robot\nd.\r\nRefinery controller",
                "2.  For each of the following agents, determine what type of agent\r\narchitecture is most appropriate (i.e., table lookup, simple reflex, goal-based\r\nor utility-based).\na. Medical diagnosis\r\nsystem\nb. Satellite imagine\r\nanalysis system\nc. Part-picking robot\nd. Refinery\r\ncontroller",
                "2.  What are rational agents? How episodic task environment differs from sequential task environment? Support your answer with suitable examples.",
                "2. What are intelligent agents? Differentiate Model Based Agents differ from utility Based Agents differ from utility Based Agent. Mention suitable examples of each.[1+5]",
                "2.  What is intelligent agent? Design PEAS framework for,        - Soccer playing agent        - Internet shopping assistant",
                "5.  Discuss the types of environment where an agent can work on.",
                "5. How agent can be configured using PEAS framework? Illustrate with example."
            ],
            "Asked": [
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2076",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2078"
            ]
        },
        {
            "Chapter": "Unit 3: Problem Solving by Searching \n                                            \n\n                                                26 Questions",
            "Question": [
                "1.  Define backward chaining. Explain the importance of backward\r\nchaining with two practical examples.",
                "1. Construct a state space with appropriate heuristics and local costs. Show that Greedy Best First search is not complete for the state space. Also illustrate A* is complete and guarantees solution for the same state space.",
                "1.   What do you mean by\r\nforward chaining? Why it is required? Explain it with two practical examples.",
                "1. How informed search are different than uniformed? Given following state space, illustrate how depth limited search and iterative deepening search works? Use your own assumption for depth limit.        Hence, S is start and K is goal.        (3+7)",
                "2.  Explain the uninformed\r\nsearch techniques with example.",
                "3.  What is state space\r\nrepresentation of problem? Represent the root finding problem having four\r\ncities in to state representation (you can choose any ordering of cities and\r\nlinks) and devise the complete problem formulation.",
                "3.  In problem solving, why problem formulation must follow goal formulation? How state space representation can be used to solve a problem? Support your answer with an example.",
                "3.  If we set the heuristic\r\nfunction h(n)=g(n) for both greedy as well A*. What will be effect in the\r\nalgorithms? Explain?",
                "3.  Consider the following\r\ngraph, steps cost is given on the arrow: Assume that the successors of a state\r\nare generated in alphabetical order, and that there is no repeated state\r\nchecking. A is the starting node and C is goal node.\n\n\n\n\n\n\n\n\n\n\n                                    \na. Of the four algorithms breadth-first, depth-first and\r\niterative-deepening, which find a solution in this case?\nb. Write\r\nsequence of node expanding by algorithm if finds solution.",
                "3. In problem solving, what is the concept of state space, state, successor function, goal test and path cost? Illustrate each with suitable example.[6]",
                "3.  Justify the searching is one of the important part of AI. Explain\r\nin detail about depth first search and breadth first search techniques with an\r\nexample.",
                "4. Consider the search space below, where S is start state and G1 and G2 are goal state. The arcs are labelled with step cost. Given the heuristic by H(~) for each nodes. Now use iterative depending and greedy best first search for finding the goal state, Also determine which goal state is reached first in each case.[6]",
                "4.  How uniform cost search works? Given following state-space, use uniform cost search algorithm to find the goal. Show each of iterations.                            Here S is start state and G is goal state.",
                "4.  What is heuristic\r\ninformation? Suppose that we run a greedy search algorithm with h(n) = – g(n) and\r\nh(n) = g(n). What sort of search will the greedy search follow in each case?",
                "4.  The minimax algorithm\r\nreturns the best move for MAX under the assumption that MIN play optimally.\r\nWhat happens when MIN plays suboptimally?",
                "4.  Consider the following map of French cities:                   Apply the A* algorithm to find out a route from Bordeaux to Grenoble.\r\nThe value v associated with a route between two neighboring cities M and N is\r\nthe length (in kilometers) of that route. The value [w] associated with a city\r\nM is the straight line distance between M and Grenoble. Your solution should\r\nshow each step of the algorithm.",
                "4.  What is meant by admissible heuristic? What improvement is done in\r\nA* search than greedy Search? Prove that A* search gives us optimal solution if\r\nthe heuristic function is admissible.",
                "4.  How iterative depending search is better than DFS and BFS. Consider following state space, use iterative deepening search considering S as start and g as goal.",
                "5.  Searching is an important part of AI, justify it. Explain any two\r\ntypes of blind search with suitable examples. How can you expand it to informed\r\nsearch?",
                "5.  Justify that searching\r\nis one of the important part of AI. Explain in detail about depth first search\r\nand breadth first search techniques with an example.",
                "5.  What is the need of alphabeta pruning in game search? Given following search space with utility, perform mini-max search and identify alpha-beta cutoff if any. Play from perspective of max player first.",
                "5. How searching is done in adverserial search? Given following search space with utility values perform minimax search for max player and identify the possible alpha/beta cutoff.[1+5]",
                "5.  Justify that AI can’t exist without searching. Explain\r\nin detail about any two types of informed search with practical examples.",
                "6.  Illustrate with an example, how uniform cost search algorithm can be used for finding goal in a state space.",
                "9.  Consider a following state space representing a game. Use minimax search to find solution and perform alpha-beta pruning, if exists.",
                "11. Given following search space, determine if these exists any alpha and beta cutoffs."
            ],
            "Asked": [
                "6 marks Asked in 2072",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2069",
                "10 marks Asked in 2078",
                "6 marks Asked in 2070",
                "6 marks Asked in 2068",
                "6 marks Asked in 2074",
                "6 marks Asked in 2070",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2074",
                "6 marks Asked in 2068",
                "6 marks Asked in 2070",
                "6 marks Asked in 2075",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2067",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2069",
                "5 marks Asked in 2076(new)",
                "6 marks Asked in 2076",
                "5 marks Asked in 2078"
            ]
        },
        {
            "Chapter": "Unit 4: Knowledge Representation \n                                            \n\n                                                51 Questions",
            "Question": [
                "2.  What is Bayes’s theorem? Explain its applications.",
                "2. Consider following facts:Every traffic chases some driver. Every driver who horns is smart. No traffic catches any smart driver. Any traffic who chases some driver but does not catch him is frustated.Now configure FOPL knowledge base for above statements. Use resolution algorithm to draw a conclusion that \"If all drivers horn, then all traffics are frustated\".            (3+2+5)",
                "2.  Why disjunctive normal form\r\nis required? Explain all the steps with examples.",
                "2.  How resolution algorithm is used in FOPL to infer conclusion?  Consider the facts;    Anyone whom pugu loves is a star. Any  hero who does not reherse does not act. Anmol is a hero. Any hero who does not work does not reherse. Anyone who does not act is not a star. Convert above into FOPL and use resolution to infer that \"If Anmol does not work, then pugu does not love Anmol\".",
                "3.  “A person born in\r\nNepal, each of whose parents is a Nepali citizen by birth, is a Nepali citizen\r\nby birth. A person born outside Nepal, one of whose parents is a Nepali citizen\r\nby birth, is a Nepali citizen by decent. Several developed countries have dual\r\ncitizenship provision, but Nepal doesn’t have that provision.” Represent the\r\nabove sentences in first-order logic and explain each step.",
                "3. Convert following statement into FOPL, every friend of Ramesh has visited pokhara. Everyone who visits Pokhara does boating on Fewalake. Ramesh has done boating on Fewalake. Now using resolution try to infer; some friend of Ramesh has done boating on Fewalake.",
                "3.  Why normal forms are\r\nrequired in AI? How do you convert to the disjunctive normal form? Explain all\r\nthe steps with practical examples.",
                "3.  How do you convert to conjunctive normal form? Explain all the\r\nsteps with examples.",
                "4.  Differentiate between\r\ninference and reasoning. Why probabilistic reasoning is important in the AI?\r\nExplain with an example.",
                "4.  “A deductive system is\r\nsound if any formula that can be derived in the system is logically valid.\r\nConversely, a deductive system is complete if every logically valid formula is\r\nderivable. All of the system discussed in this article are both sound and\r\ncomplete. They also share the property that it is possible to effectively\r\nverify that a purportedly valid deduction is actually a deduction; such\r\ndeduction systems are called effective”. Represent the above sentences in\r\nfirst-order logic and explain each step.",
                "4.  “A key property of deductive systems is that they are purely\r\nsyntactic, so that derivations can be verified without considering any\r\ninterpretation. Thus a sound argument is correct in every possible\r\ninterpretation of the language, regardless whether that interpretation is about\r\nmathematics, economics, or some other area. The artificial intelligence deals\r\nwith deductive system soundly”. Represent the above sentences in first-order\r\nlogic and explain each step.",
                "5.  State whether the\r\nfollowing sentences are valid, unsatisfiable, or neither.\na. Smoke => Smoke\nb. Smoke => Fire\nc. (Smoke => Fire)\r\n=> (~Smoke=>~Fire)\nd.\r\nSmoke V Fire V ~Fire",
                "5.  Translate the following\r\nsentence into first order logic:\ni.\r\n“Everyone’s DNA is unique and is derived from their parents’ DNA”.\nii. “No dog bites a\r\nchild of its owner”.\niii.\r\n“Every gardener likes the sun”.\niv.\r\n“All purple mushrooms are poisonous”.",
                "5.  Briefly describe the\r\napproaches of knowledge representation with example.",
                "5.  Consider the following statements.All cats like fish, cats eat everything they like, and\r\nZiggy is a cat.\n        a)  Translate the sentences into FOL.\n        b)  Convert the sentences into clausal normal\r\nform.\n        c)  Answer using FOL, if Ziggy eats fish?",
                "5.  What is script? How knowledge is represented in script? Illustrate component of script with a example.",
                "6.  Differentiate between inference and reasoning. Why probabilities\r\nreasoning is important in AI? Explain with an example.",
                "6.  Consider the following\r\nsentence:\n[(food\r\n=> party) V (drinks => party)] => [(food ^ drinks) => party]\na. Convert the right\r\nhand and left hand sides of main implication into CNF.\nb. Prove\r\nthe validity of sentence using resolution.",
                "6.  Represent the following\r\nsentences into a semantic network.\nBirds\r\nare animals. \nBirds\r\nhave feathers, fly and lay eggs. \nAlbatross\r\nis a bird. \nDonald\r\nis a bird. \nTracy\r\nis an albatross.",
                "6.  Consider the knowledge\r\nbase:\n“If it\r\nis hot and humid, then it is raining. If it is humid, then it is hot. It is\r\nhumid”\na. Describe a set of propositional letters which can be used to\r\nrepresent the knowledge base.\nb. Translate the KB into propositional letters using your\r\npropositional letters from part a.\nc. Is\r\nit raining? Answer this question by using logical inference rule with KB.",
                "6.  Consider the following a\r\nproduction system characterized by\n    - Initial short term :          C5, C1, C3 \n    - Production rules:           C1 & C2 àC4\r\n\n                                                         C3 àC2 \n                                                       \r\nC1 & C3 àC6\r\n\n                                                       \r\nC4 àC6\r\n\n                                                        \r\nC5 àC1\r\n\nShow a\r\npossible sequence of two recognize-art cycles. Which will be the new content of\r\nthe short-term memory after these two cycles?",
                "6.  Define knowledge representation system. How knowledge is represented using semantic networks? Illustrate with an example.",
                "7.  What do you\r\nmean by causal network? Explain it with practical application.",
                "7. How Knowledge is represented using scripts? Support your answer with suitable example.[6]",
                "7.  Convert the following\r\nsentence into predicate logic.\na. “No dog bites a\r\nchild of its owner”?\nb. “No\r\ntwo adjacent countries have the same color”?",
                "7.  What do you mean by\r\nknowledge representation? Explain the characteristics of representation.",
                "7.  What do you mean by reasoning in belief network? Explain it with\r\nexample.",
                "6. Construct sematic network for following facts:        Ram is a person. Person are humans. All humans have nose. Humans are instarces of mammals. Ram has weight of 60 kg. Weight of Ram is less than weight of Sita.",
                "7.  What do you mean by casual network? Explain it with practical\r\napplication.",
                "7.  What is Bayes’ theorem?\r\nExplain its applications.",
                "7.  What is Bayesian network? Explain how Bayesian network represent\r\nand inference the uncertain knowledge.",
                "8.  Define the Model-Based\r\nand Cased Based system. Discuss which system is suitable for the following\r\nproblems.\na. Electronic Circuit\r\nTesting\nb. Legal Reasoning\nc.\r\nDisease Recognition",
                "8.  What are conceptual\r\ngraphs? Represent the following statements into conceptual graph.\n“King Ram marry Sita, the\r\ndaughter of king Janak”.",
                "8.  Why disjunctive normal\r\nform is required? Explain all the steps with examples.",
                "8. Consider the following statements:\n        Rabin likes only easy courses. Science courses are hard. All\r\ncourses in the CSIT are easy. CSC 101 is a CSIT course. \na. Translate\r\nthe sentences into predicate logic.\n            b. Convert your sentences into clausal normal form (CNF).",
                "7.  Define frame. How knowledge is encoded in a frame? Justify with an example.",
                "9.  What are conceptual graphs? Represent the following statements\r\ninto conceptual graph.\nKing Ram marry Sita, the\r\ndaughter of king Janak.",
                "9.  What do you mean by marginalization in probability distribution? Consider in Nepal, 51% of adults are males and rest are females. Consider one adult is randomly selected for a survey of drinking alcohol. It is found that 15% of males drink alcohol where as 2% of female drink alcohol. Now find the probability that the selected adult is a male.",
                "9. What is the use of Baye's rule? Consider in a school, the number of boys student is 46% and that of girl student is 54%. Suppose 4% of boys student are over 5 feet tall and 2% of girls student are over 5 feet tall. If  a student is selected at random from among all those over 5 feet tall, what is the probability that the student is girl?[1+5]",
                "9.  What is the difference\r\nbetween symbolic and non-symbolic AI? Represent the following knowledge in\r\nsemantic network.\nRobin\r\nis bird \nClyde\r\nis a Robin \nClyde\r\nowns a nest from spring 2014 to fall 2014",
                "9.  Represent the\r\nfollowing sentences into a semantic network.\n                  Birds are animals.\n                  Birds have feathers, fly and lay eggs.\n                  Albatros is a bird.\n                  Donald is a bird.\n                  Tracy\r\nis an albatross.",
                "8.  What do you mean by membership of an element in a fuzzy set? Given a domain of discourse X={10, 20, 30, 40, 50, 60, 70}, construct a fuzzy set from X. Use your own assumptions for defining membership.",
                "9.  What is Bayes’ rule?\r\nDiscuss the use of Bayes’ rule for uncertain reasoning.",
                "10.  What is Bayesian\r\nNetwork? Explain how Bayesian Network represents and inference the uncertain\r\nknowledge.",
                "10.  After your yearly\r\ncheckup, the doctor has bad news and good news. The bad news is that you tested\r\npositive for a serious disease, and the test is 99% accurate (i.e. the\r\nprobability of testing positive given that you have the disease is 0.99, as is\r\nthe probability of testing negative if you don’t have the disease). The good\r\nnews is that this is a rare disease, striking only one in 10,000 people.\na. Why is it good news\r\nthat the disease is rare?\nb.\r\nWhat are the chances that you actually have the disease?",
                "10.  Define the Model-Based and Cased Based system. Discuss which\r\nsystem is suitable for the following problems\ni.\r\nElectronic circuit testing\nii.\r\nLegal Reasoning",
                "10. Convert following statements to FoPL.[6]No teachers are ignorant.Some teachers who are ignorant are not skillful.All skillfull teachers are likely by all.",
                "10.  How facts in uncertain knowledge are represented? Configure a Bayesian network for following:        The probability of having rain is 60%. The chances of getting cold if it will rain is 80%. The probability of not having sunshine is 90%. The probability that it will be hot if it is sunshine is 0.67.",
                "10.  Convert following sentences to FOPL.                If every helper is busy then there is a job in the queue.                A job is in queue but the helper is not busy.                Every helpers are teased by someone.",
                "10. How uncertain knowledge is represented? Given following full joint probability distribution representing probabilities of having different sizes of CD, find the probability that a CD cover has a length of 130mm given the width is 15mm.",
                "12. What is posterior probability? Consider a scenario that a patient have liver disease is 15% probability. A test says that 5% of patients are alcoholic. Among those patients diagnosed with liver disease, 7% are alcoholic. Now compute the chance of having liver disease, if the patient is alcoholic."
            ],
            "Asked": [
                "6 marks Asked in 2075",
                "10 marks Asked in 2078",
                "6 marks Asked in 2067",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2067",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2067",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2068",
                "6 marks Asked in 2070",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2070",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2071",
                "6 marks Asked in 2068",
                "6 marks Asked in 2072",
                "5 marks Asked in 2078",
                "6 marks Asked in 2069",
                "6 marks Asked in 2067",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2070",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "5 marks Asked in 2076(new)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "5 marks Asked in 2076(new)",
                "6 marks Asked in 2068",
                "6 marks Asked in 2070",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2074",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2078"
            ]
        },
        {
            "Chapter": "Unit 5: Machine Learning \n                                            \n\n                                                18 Questions",
            "Question": [
                "3. Describe mathematical model of neural network. What does it means to train a neural network? Write algorithm for perception learning.",
                "3.  Define mathematical model of artificial neural network. Discuss how Hebbian learning algorithm can be used to train a neural network. Support your answer with an example.",
                "4.  Define learning. Why\r\nlearning frame work is required? Explain about learning frame work with block diagram\r\nand examples.",
                "6.What does it means to train a neural network? Consider following neural network, how back-propagation algorithm can be used to train it?  [6]",
                "6.  Define Learning. Why\r\nlearning framework is required? Explain about learning frame with block\r\ndiagram and examples.",
                "6.  Why do we require learning? Explain about learning framework with\r\nsuitable block diagram and examples.",
                "6.  What is learning by induction? Explain inductive learning process\r\nwith example.",
                "6.  What is machine learning? How genetic algorithm can be used to train agents? Discuss the operations of genetic algorithm.",
                "7.  Configure a feed-forward neural network with your own assumptions of inputs and weights and express it mathematically. Write an algorithm for training neural networks using allebbian learning.",
                "7.  How concepts of most specific consistent hypothesis and most general consistent hypothesis are used in learning through examples. How generalization specialization tree is maintained for these concepts?",
                "8.  What is a Neural Network? Explain any one type of\r\nneural network with practical example.",
                "8.  Derive the mathematical model of neural network. Explain any one\r\ntype of neural network with its algorithm.",
                "8.  What is\r\nneural network? Explain the neural net learning methods.",
                "8.  What is back\r\npropagation? Explain all the steps involved in the back propagation with an\r\nexample.",
                "8.  What do you mean by machine vision? Discuss the components of a machine vision system.",
                "7. What is crossover operation in genetic algorithm? Given following chromosomes show the result of one-point and two point crossover.        C1 = 01100010        C2 = 10101100    Choose appropriate crossover point as per your assumption.",
                "9.  What is machine\r\nlearning? Explain the learning from analogy and instance based learning?",
                "9.  Write an algorithm for learning by Genetic Approach."
            ],
            "Asked": [
                "10 marks Asked in 2078",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076(old)",
                "6 marks Asked in 2067",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2076",
                "6 marks Asked in 2074",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2067",
                "6 marks Asked in 2074",
                "5 marks Asked in 2078",
                "6 marks Asked in 2070",
                "5 marks Asked in 2076(new)"
            ]
        },
        {
            "Chapter": "Unit 6: Applications of AI \n                                            \n\n                                                17 Questions",
            "Question": [
                "3.  How can you construct expert system? Explain knowledge\r\nengineering with a block diagram.",
                "5.  Define a natural language processing. Explain the different issues\r\ninvolved in the natural language processing.",
                "7.  What is an expert\r\nsystem? Explain the architecture and feature of rule-based expert system.",
                "8.  What is natural language processing? How morphological analysis is done during processing?",
                "8. What do you mean by natural language processing? What is the importance of pragmatic analysis in NLP? [3+3]",
                "8. What is expert system? How it works? Mention role of inference engine in expert system.",
                "9.  How can you construct\r\nexpert system? Explain knowledge engineering with a block diagram.",
                "9.  Knowledge consists of facts, beliefs, and heuristics, justify it.\r\nExplain the advantages and disadvantages of an expert system.",
                "9.  Why do we require expert system structure? Draw the block diagram\r\nand explain it with practical example.",
                "10.  Differentiate between\r\nnatural language understanding (NLU) and natural language generating (NLG). Why\r\nwe have to study natural language processing? Explain it.",
                "9. How semantic and pragmatic analysis is done in natural language processing.",
                "10.  Define natural language\r\nprocessing. Explain the different issues involved in the natural language\r\nprocessing.",
                "10.  Explain the steps of\r\nNatural Language Processing.",
                "10.  Explain the different steps involved in the natural language\r\nprocessing (NLP) with block diagram and examples.",
                "10.  Differentiate between natural\r\nlanguage understanding (NLU) and natural language generation (NLG).",
                "11.  How the concept of machine vision are used in Robotics to configure sensors of Robots?",
                "12.  How syntactic and semantic analysis is done during natural language processing? Explain with example."
            ],
            "Asked": [
                "6 marks Asked in 2075",
                "6 marks Asked in 2073",
                "6 marks Asked in 2070",
                "6 marks Asked in 2076",
                "6 marks Asked in 2076(old)",
                "5 marks Asked in 2078",
                "6 marks Asked in 2067",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2069",
                "5 marks Asked in 2078",
                "6 marks Asked in 2067",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)"
            ]
        }
    ]
}