{
    "subject": "E-commerce",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                45 Questions",
            "Question": [
                "1.  Explain the e-commerce architecture and its components in detail with diagram.",
                "1.  Explain the various categories of e-commerce. Define the role of e-commerce in business, service, learning and community.",
                "1.  How does e-commerce differ from e-business? Discuss the e-commerce success factors.",
                "1.  What is e-commerce? Explain the framework of e-commerce.",
                "1.  Explain the e-commerce framework and its anatomy of applications.",
                "1.  Explain the architectural framework for electronic commerce with practical example.",
                "1.  Differentiate pure e-commerce from partial e-commerce with an example. Describe what features make e-commerce better than traditional commerce.",
                "1. What is e-commerce business model? Describe the key elements of e-commerce business model.[2+8]",
                "1.  Explain the e-commerce framework and its application.",
                "2.  Explain the B2B commerce and its advantages and disadvantages.",
                "2. What are the security threats in e-commerce? How client server and data transactions securities are maintained in e-commerce?",
                "1. Describe the various security mechanisms used to secure ecommerce systems. [10]",
                "2. What is Secured Electronic Transaction (SET) Protocol? Describe how purchase request, payment authorization and payment capture are done in SET? [2 + 8]",
                "3.  Differentiate between B2B and B2c. Explain the major activities of B2C.",
                "3. What is e-payment? Discuss how credit card transactions, electronic checks and stored value payment system work. Mention their pros and cons.[2+8]",
                "3. Consider a company is planning to establish a B2B e-commerce system. Now describe in detail about the possible types of B2B Business Models the company can adapt. [10]",
                "4.  Explain the different types of e-commerce.",
                "4.  Explain B2B and its benefits.",
                "4.  Compare between traditional and electronic commerce.",
                "4.  Compare and contrast pure Vs. Partial e-commerce. Support your answer with proper examples.",
                "4.  Mention the various advantages and disadvantages of e-commerce.",
                "5.  What are the elements of e-commerce application? Explain.",
                "4. Describe the factors that make U-commerce different from M-commerce?[5]",
                "5.  What are the advantages and disadvantages of e-commerce?",
                "4. What is e-commerce? How it differs from e-business? [2.5+2.5]",
                "6.  Discuss the application of e-commerce in service sector.",
                "5. What is industry value chain? Mention the geniric players in the value chain.[3+2]",
                "6. What is digital wallet? How it works?[2+3]",
                "5. How the features like ubiquity, information density and richness make e-commerce better than traditional commerce. Justify with examples.[5]",
                "7. What is a catalog in e-commerce application? How can you create catalogs?[2+3]",
                "6. Describe the possible types of revenues models that can be adapted in e-commerce systems.[5]",
                "9.  What does the properties like ubiquotous, richness and information density in ecommerce means? Support your answer with example.",
                "7. What is e-payment? Describe the working mechanism of online credit card transaction.[1+4]",
                "9.  Explain the dimensions of electronic commerce system.",
                "8. Define malicious code. How the potentially unwanted programs like adware and spyware works?[1+4]",
                "9.  Explain C2C E-commerce with example.",
                "9.Discuss different pricing models for online advertisements.[5]",
                "8. What is a shopping cart in an e-commerce application? How can you build shopping carts? [1+4]",
                "10. How facebook exchanges, reaction buttons and sponsored message are used for social marketing and advertisement.[5]",
                "11. What is Search Engine Optimization (SEO)? How on page SEO can be done?[1.5+3.5]",
                "9. Discuss the possible security threats in e-commerce systems. [5]",
                "12. How content based and collaborative filtering approaches are used for product recommendation in e-commerce?[5]",
                "10. How linear, non-linear, in-banner and in-text video ads are used for digital marketing? [5]",
                "11. Describe how promoted tweets, promoted trends and lead generation cards are used as Twitter marketing tools? [5]",
                "12. Consider you are given a role of SEO analyst to perform search engine optimization analysis of www.sastodeal.com, what kind of SEO activities you will perform so as to improve rank of the website. [5]"
            ],
            "Asked": [
                "10 marks Asked in 2074",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2069",
                "10 marks Asked in 2071-I",
                "10 marks Asked in 2071-II",
                "10 marks Asked in 2072",
                "10 marks Asked in 2075",
                "10 marks Asked in 2078",
                "10 marks Asked in 2068",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2078",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in ModelQuestion",
                "5 marks Asked in 2071-I",
                "10 marks Asked in 2078",
                "10 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2068",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2069",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2068",
                "5 marks Asked in 2078",
                "5 marks Asked in 2072",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2078",
                "5 marks Asked in 2073",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 2: E-commerce Business Model \n                                            \n\n                                                11 Questions",
            "Question": [
                "2.  What is electronic data interchange? Explain the building blocks of an EDI system.",
                "2.  Define EDLIS EDI used in B2C or B2B e-commerce? Why EDI is important in E-commerce. Explain.",
                "3.  What is EDI? How EDI is used in ecommerce. How EDI has influenced information flow in international trade?",
                "3.  How layers of EDI ensure transmission of message and data between the trading partners in ecommerce transactions? Also mention the tangible benefits of EDI.",
                "3.  Define EDI. Explain with labeled diagram about secure electronic transaction protocol.",
                "4.  What are the main characteristics of internet-based EDI?",
                "5.  How EDI is used between freight forwarders, international trade, and customs?",
                "5.  Define EDI and its components.",
                "5.  Explain the architectural model of B2B E-commerce.",
                "7.  What are the two major EDI standards used in e-commerce? Explain.",
                "7.  Explain the EDI application in business."
            ],
            "Asked": [
                "10 marks Asked in 2068",
                "10 marks Asked in 2072",
                "10 marks Asked in 2076",
                "10 marks Asked in 2069",
                "10 marks Asked in 2074",
                "5 marks Asked in 2074",
                "5 marks Asked in 2075",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2074",
                "5 marks Asked in 2073",
                "5 marks Asked in 2071-II"
            ]
        },
        {
            "Chapter": "Unit 3: Electronic Payment System \n                                            \n\n                                                16 Questions",
            "Question": [
                "2.  What is digital wallet? How it can be used in ecommerce? What issues need to be considered while designing electronic payment system?",
                "2.  Explain the electronic payments system and its types.",
                "2.  Explain the types of electronic payment systems are required in e-commerce. Why are there different types of payment systems? Explain with example.",
                "2.  What is e-payment? Explain the functions of e-payment system. Why is orientation and standardization required for e-payment business system?",
                "3.  Define the electronic payment systems. Explain the types of electronic payment system with example.",
                "3.  Explain the digital token based electronic payment system and its types.",
                "3.  Explain the various features and advantages of electronic payments system. What are the problems in implementation? Explain.",
                "3.  Differentiate between electronic cheque payment and credit card payment. Explain the cheque transaction protocol used in e-commerce.",
                "4.  How does e-cash work? List the properties that an e-cash should have?",
                "6.  Explain the digital token based electronic payment system.",
                "6.  Explain the threat on electronic payment system.",
                "6.  What types of electronic payment system are required in e-commerce? Explain.",
                "6.  Describe the functionality of digital wallet. Write the requirements of e-payments.",
                "7.  Difference between digital token based electronic payment system with credit card system.",
                "8.  What are the advantages and disadvantages of smart-card?",
                "9.  Write short note on: (Any Two)            a. Properties of e-cash            b. Digital/Electronic wallets            c. Data warehouses."
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "10 marks Asked in 2071-I",
                "10 marks Asked in 2073",
                "10 marks Asked in 2074",
                "10 marks Asked in 2071-II",
                "10 marks Asked in 2068",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2073",
                "5 marks Asked in 2075",
                "5 marks Asked in 2073",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2072",
                "5 marks Asked in 2069",
                "5 marks Asked in 2072",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068"
            ]
        },
        {
            "Chapter": "Unit 4: Building E-commerce System \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Security in E-Commerce \n                                            \n\n                                                13 Questions",
            "Question": [
                "1.  Why is security issues important in e-commerce? What are the security issues to be taken into account while designing a security system for e-commerce? Explain.",
                "2.  What do you mean by client-server network security? Explain the data and message security with example?",
                "2.  How security in e-commerce systems can be ensured? What mechanisms can be used to enforce the security? What possible vulnerabilities may lead to compromise in client-server security?",
                "2.  How preserving confidentiality and integrity ensures security in e-commerce? Discuss various mechanisms used to ensure data and message security in e-commerce systems.",
                "3.  What do you mean by information security? What are the security issues to be taken into account while designing a security system for e-commerce? Explain.",
                "6.   Define the firewall and its types.",
                "6.  Explain the client network security.",
                "6.  What are the security issues of e-commerce?",
                "7.  Explain the e-commerce security tools.",
                "8.  Explain the digital signature and its application.",
                "8.  Explain the cryptography and its types.",
                "8.  What is cryptography? How cryptography can be used to ensure data and message transaction security in ecommerce?",
                "9.  Write short note on: (Any Two)            a. Digital Signature            b. Secure Socket Layer            c. EDI"
            ],
            "Asked": [
                "10 marks Asked in 2073",
                "10 marks Asked in 2071-II",
                "10 marks Asked in 2069",
                "10 marks Asked in 2075",
                "10 marks Asked in 2072",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2076",
                "5 marks Asked in 2068-II"
            ]
        },
        {
            "Chapter": "Unit 6: Digital Marketing \n                                            \n\n                                                1 Questions",
            "Question": [
                "8.  Mention the types of Digital documents and explain in brief."
            ],
            "Asked": [
                "5 marks Asked in 2068"
            ]
        },
        {
            "Chapter": "Unit 7: Optimizing E-commerce Systems \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 8: Old Syllabus \n                                            \n\n                                                28 Questions",
            "Question": [
                "1.  What is media convergence in ecommerce? How it influence ecommerce? Discuss technological and market factors that drive media convergence.",
                "3.  What is a structured document? How the issues like document constituency, document-oriented process and document-based framework flows are considered in a document infrastructure?",
                "4.  What do you mean by internet governance? Explain.",
                "4.  Explain the client-server network security.",
                "4.  What are the different types of digital documents used in corporate library?",
                "5. What is I-way? What market forces influence the I-way?",
                "5.  Explain the consumer oriented application of e-commerce.",
                "5.  Explain the components of the Information superhighway infrastructure.",
                "5.  Explain the mercantile process model with example.",
                "5.  Illustrate and explain the components of the information super highway.",
                "6.  Differentiate impulsive, patient, and analytical buyers in a mercantile process model.",
                "6.  Discuss the post-purchase interaction involved in mercantile process from customers' perspective.",
                "7.  Explain the brief architecture of internet.",
                "7.  How middleware and structures document interchange. Ensures transparency, transaction security & management, and distributed object management & services in the architectural framework for e-commerce?",
                "7.  Explain the Mercantile process models from Merchant’s perspective.",
                "7.  Explain the Mercantile model from the consumer’s perspective.",
                "7.  How WWW architecture encompasses the global hypertext publishing, universal reader, and client-server concepts?",
                "7.  What are the various threats posed by servers in a client-server environment?",
                "8.  Explain the types of digital documents.",
                "8.  How digital documents enhance business data processing. Differentiate physical data warehouse and the logical.",
                "8.  Explain the corporate data warehouses.",
                "8.  Explain the firewall and functions.",
                "8.  What do you mean by internet governance? Mention the role of internet society in internet governance.",
                "9.  What is the information superhighway? Discuss its components.",
                "9.  Explain the corporate data warehouse with example.",
                "9.  Explain with example of corporate data warehouses.",
                "9.  Write short note on: (Any Two)            a. Hypertext vs Hypermedia            b. Credit card with encryption            c. Advantages of Data warehouses",
                "9.  What services or functionalities does the e-commerce application architecture consist of? Discuss briefly."
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "10 marks Asked in 2075",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2073",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2073",
                "5 marks Asked in 2069",
                "5 marks Asked in 2075",
                "5 marks Asked in 2076",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2075",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2069",
                "5 marks Asked in 2076",
                "5 marks Asked in 2074",
                "5 marks Asked in 2072",
                "5 marks Asked in 2069",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2073",
                "5 marks Asked in 2075",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in 2072",
                "5 marks Asked in 2071-I",
                "5 marks Asked in 2069"
            ]
        }
    ]
}