{
    "subject": "E-Governance",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction to E-Government and E-Governance \n                                            \n\n                                                47 Questions",
            "Question": [
                "1.) What is e-governance? Discuss the issues in e-governance applications and the digital divide.",
                "1.Why do we need E-Governance? How can we use E-Governance to provide efficient services to citizens? Explain using suitable example.(3+7)",
                "1.) What is e-governance? Why do we need it? Discuss its scope and content in detail.",
                "1. Differentiate between e-Government and e-Governance. Explain in brief about e-Governance applications and the digital divide.",
                "1. Differentiate between e-Government and e-Governance. What are the various stages of E-governance?",
                "2. What is E-Governance model? Explain broadcasting/wider dissemination model and critical flow model in detail.(2+8)",
                "1. What is E-Governance? Explain the various evolutionary stages in E-Governance.",
                "3. Why do we need IT infrastructure to implement E-Governance? Explain network and computing infrastructure needed to implement E-governance.(3+7)",
                "2. Explain with example of maturity model of e-governance.",
                "3. Explain the components of data warehouse. What are the applications of data mining in e-Governance in the context of Nepal.",
                "4. Why do we need E-Governance? Explain.",
                "4. Discuss the needs of E-Governance.",
                "4.) What are the content of e-governance? Explain in detail.",
                "5. What are the issues related to E-governance application? Why do we need to consider these issues?",
                "4. Define E-Government. Explain E-Government as an Information System.(1+4)",
                "5. Discuss scope and content of E-governance.",
                "4.) Discuss different IT tools that are used to deliver services to citizens.",
                "5. Why is it necessary to implement ICT in government? Explain.(5)",
                "4. What are different benefits of using e-governance? Explain. (5)",
                "4. What is E-governance? Explain Its major benefits.",
                "5. Explain online service delivery with example. (5)",
                "4. Explain the critical flow model in e-Governance.",
                "6. What is E-Governmant maturity model? Explain closed, initial,and planned level of this model.(1+4)",
                "7. How can we achieve good governance through E-Government models? Explain.(5)",
                "5. What do you mean by e-Readiness framework? Explain with example.",
                "5. Explain the issues in E-governance applications and the digital divide.",
                "6. Discuss the main impact of e-Governance application in digital divide.",
                "8. Define E-readiness. What is data system infrastructural preparedness and technological infrastructural preparedness?(1+4)",
                "7. What are the current trends of e-Governance development in Nepal.",
                "7. Explain about leadership and strategic planning in E-governance services.",
                "9. What are different approaches to E-Governance security? Explain.(5)",
                "10. Explain the uses of data warehousing and data mining in health, education and the rural development.(5)",
                "8. Explain the Comparative Analysis Model with example.",
                "9. What are the pre-requisites of e-readiness for intra structure development.",
                "10.\"E-governance evolves gradually from the simplest level to advanced levels\".Justify.",
                "13. Write short note on:    a. Cyber Law    b. G2C2G    c. Digital divide",
                "13. Write short note on: (Any Two)    a. Global trends of growth in E-governance    b. Cyber Law    c. E-readiness",
                "12.) Discuss evolutionary stages in e-governance in detail.",
                "10. How can you develop the rural area through e-governance?",
                "11. Explain the evolution of E-Governance, its scope and content.",
                "11. How can we use human resource management software to support E-Government? Explain.(5)",
                "11. Explain the strategic planning important for e-Governent implementation.",
                "12. Write short notes on:a. Electronic service deliveryb. IT in judiciary",
                "12. What are the main contents are needed for human resource management software? Explain.",
                "13. Write short note on(Any Two):    a. Reaching the unreached through E-Governance.    b. Cyber Law of Nepal.    c. Global trends of growth in E-Governance",
                "13. Write short note on: (Any Two)    a. Need of E-governance    b. Good governance through E-governance    c. E-governance trends in developed and developing countries",
                "13. Write Short notes:a) IT in Judiciary b) e-payment"
            ],
            "Asked": [
                "10 marks Asked in 2071",
                "10 marks Asked in 2078",
                "10 marks Asked in 2070",
                "10 marks Asked in 2074",
                "10 marks Asked in 2076",
                "10 marks Asked in 2078",
                "10 marks Asked in 2073",
                "10 marks Asked in 2078",
                "10 marks Asked in 2076",
                "10 marks Asked in 2076",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2078",
                "5 marks Asked in 2068",
                "5 marks Asked in 2070",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076",
                "5 marks Asked in 2069",
                "5 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076",
                "5 marks Asked in 2069",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in 2069",
                "5 marks Asked in 2067",
                "5 marks Asked in 2068",
                "5 marks Asked in 2071",
                "5 marks Asked in 2076",
                "5 marks Asked in 2073",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in 2076",
                "5 marks Asked in 2073",
                "5 marks Asked in 2069",
                "5 marks Asked in 2076"
            ]
        },
        {
            "Chapter": "Unit 2: Models of E-Governance \n                                            \n\n                                                27 Questions",
            "Question": [
                "1. What is E-Governance? Discuss broadcasting and interactive-service models in detail.",
                "1. What is E-Governance? Discuss critical flow model and comparative analysis model in detail.",
                "1. What do you understand by Models of digital Governance? Explain wider dissemination model referring to its principle, application, evaluation and various projects based on this model.",
                "2.) Discuss critical flow model and mobilization model and lobbying model of e-governance along with applications.",
                "1. Define e-governance business model. Explain wider dissemination and critical flow model of e-governance in detail. (2 + 8)",
                "2.) Discuss broadcasting/wider dissemination model and comparative analysis model of e-governance along with applications.",
                "2. What is E-Governance maturity model? Explain the various maturity levels along with their characteristics.",
                "3. What is a digital model? Explain the difference types of model of E-Governance with prime focus on its principle, application, evaluation and various projects based on these model.",
                "5.) Discuss the institutionalized level of maturity model in detail.",
                "6. How can we use E-Governance models to achieve good governance? Discuss.",
                "4.Explain the comparative analysis model of e-Governance.",
                "7. Explain the characteristics of maturity levels.",
                "7. What are different levels in maturity model?",
                "5.) Discuss the realized level of maturity model in detail.",
                "6.) How can we achieve good governance through e-governance models?",
                "6. How can we achieve good governance through e-governance models? Explain. (5)",
                "5. Mention the maturity model of e-Governance.",
                "6.) How can we achieve good governance through e-governance models? Explain.",
                "5. What is digital divide? Discuss the impact of E-Governance application in digital divide.",
                "6. Compare and contrast between comparative analysis model and interactive service model.",
                "6. Compare and contrast between wider dissemination model and critical flow model.",
                "9. How can good governance be achieved through E-Governance.",
                "9. What is an E-governance maturity model? Explain the various maturity levels of E-governance.",
                "11.) What are the key focus areas of maturity levels? Explain.",
                "10. Differentiate between G to G and G to B.",
                "11.) What are characteristics of maturity level? Explain in detail.",
                "12.) Discuss key focus areas of maturity levels in detail."
            ],
            "Asked": [
                "10 marks Asked in 2068",
                "10 marks Asked in 2067",
                "10 marks Asked in 2069",
                "10 marks Asked in 2071",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2070",
                "10 marks Asked in 2073",
                "10 marks Asked in 2073",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2070",
                "5 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2074",
                "5 marks Asked in 2070",
                "5 marks Asked in 2073",
                "5 marks Asked in 2069",
                "5 marks Asked in 2073",
                "5 marks Asked in 2073",
                "5 marks Asked in 2069",
                "5 marks Asked in 2071",
                "5 marks Asked in 2074",
                "5 marks Asked in 2070",
                "5 marks Asked in 2070"
            ]
        },
        {
            "Chapter": "Unit 3: E-Government Infrastructure Development \n                                            \n\n                                                14 Questions",
            "Question": [
                "2. Why do we need e-governance infrastructure? Explain network infrastructure, computing infrastructure and data centres for e-governance. (3 + 7)",
                "3. Define E-readiness in E-governance applications and the digital divide.",
                "8. Discuss legal infrastructural preparedness for E-readiness.",
                "8. Discuss human infrastructural preparedness for E-readiness.",
                "7.) What is e-readiness? Discuss legal infrastructural preparedness of e-readiness.",
                "7. What is e-readiness? Explain human infrastructure preparedness for e-governance. (2 + 3)",
                "6. Discuss the Institutional Infrastructure preparedness model of e-Governance.",
                "9. What is institutional infrastructural preparedness for E-readiness? Discuss.",
                "9. What is technology infrastructural preparedness for E-readiness? Discuss.",
                "7.) What is e-readiness? Discuss data system infrastructural preparedness of e-readiness.",
                "10. Define E-readiness. Explain in brief about the infrastructural pre-requisites of e-readiness.",
                "11. What do you mean by digital system intra structure? Explain.",
                "13.) Write short notes on :a.) E-governance scopeb.) Technological infrastructural preparedness",
                "13.) Write short notes :a.) Digital divideb.) Legal infrastructural preparedness"
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2069",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2070",
                "5 marks Asked in 2073",
                "5 marks Asked in 2074",
                "5 marks Asked in 2071",
                "5 marks Asked in 2070"
            ]
        },
        {
            "Chapter": "Unit 4: Security for e-Government \n                                            \n\n                                                3 Questions",
            "Question": [
                "3. What are the challenges to e-governance security? Explain e-governance security model in detail. (3 + 7)",
                "8. What is e-governance security standard? Why do we need such standards? (2 + 3)",
                "12. Write short notes on: (2 × 2.5 = 5)a. Cloud governanceb. E-governance security architecture"
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 5: Applications of Data Warehousing and Data Mining in Government \n                                            \n\n                                                16 Questions",
            "Question": [
                "2. Define the terms data warehousing and data mining. Discuss the use of data warehousing and data mining in census and prices of essential commodities.",
                "2. Define the terms data warehousing and data mining. Discuss key areas that demand the use of data warehousing and data mining.",
                "3.) What is data warehousing and data mining? How can you use these concepts in e-governance?Discuss.",
                "2. Differentiate between data ware housing and data mining. Explain the applications of Data ware housing and data mining in e-Governance applications.",
                "3.) Define the terms data warehousing and data mining. Discuss key areas that demand the use of data warehousing and data mining.",
                "8.) How can we use data warehousing and data mining concepts in agriculture and rural development?",
                "8.) How can we use data warehousing and data mining to prepare the government to face the challenges of the new millennium. Discuss.",
                "7. How can we use data ware housing and data mining concepts in education sector.",
                "10. Discuss the use of data warehousing and data mining concepts in agriculture.",
                "10. How can we use data warehousing and data mining concepts in census data? Discuss.",
                "11. What is data warehouse? How does it differ from the database?",
                "11. What are the goals that data mining attempts to facilitate?",
                "9. What is national data warehouse? What is census data? (2 + 3)",
                "10. How can we use data warehousing and data mining in agricultural sector in Nepal? (5)",
                "12. Define data mining and data warehousing. Explain their implementation and application in E-Governance.",
                "12. What is data warehousing? Explain the various implementations of data ware housing and data mining in E-governance."
            ],
            "Asked": [
                "10 marks Asked in 2068",
                "10 marks Asked in 2067",
                "10 marks Asked in 2071",
                "10 marks Asked in 2074",
                "10 marks Asked in 2070",
                "5 marks Asked in 2071",
                "5 marks Asked in 2070",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2073",
                "5 marks Asked in 2069"
            ]
        },
        {
            "Chapter": "Unit 6: Case Studies \n                                            \n\n                                                20 Questions",
            "Question": [
                "3. Discuss E-Governance initiatives taken by government of Nepal in present context.",
                "2. \" E-Governance has helped to reach the unreached\". Explain the statement with reference to the major undertakings in Nepal.",
                "3. Explain the E-Governance initiative taken by government of Nepal and also explain the challenges for this initiative.",
                "3.Explain in detail of e-Governance development in Nepal.",
                "6. Why cyber law is important for Nepal? Explain.",
                "4. Explain the need of E-Governance with reference to the context of Nepal.",
                "7. Explain the current trends of development of E-Governance in Nepal.",
                "9.) What is cyber law? Discuss the current scenario of cyber law in Nepal.",
                "10.) Discuss the current scenario of e-governance in Nepal.",
                "9.) What is cyber law? Discuss the current scenario of cyber law in Nepal.",
                "8.Discuss in brief about development of e-Governance in Brazil.",
                "8. Discuss about E-governance initiatives in Nepal and the challenges faced during the workouts.",
                "10.) Mention the current scenario of e-governance in Nepal.",
                "12. Explain in brief about E-governance initiatives in USA.",
                "12. Discuss in brief about E-Governance in China.",
                "9. Why cyber laws and Human Resource Management software are importance for Nepal?",
                "11. Explain concept of smart nagarpalika? What is cyber law? (4 + 1)",
                "11. Define cyber law focusing its essence. Explain the major provisions of cyber law of Nepal.",
                "12. Explain about the development of e-Governance in Andra Pradesh.",
                "13. Write Short notes:    a) Critical Flow model    b) Smart Nagarpalika"
            ],
            "Asked": [
                "10 marks Asked in 2067",
                "10 marks Asked in 2069",
                "10 marks Asked in 2068",
                "10 marks Asked in 2074",
                "5 marks Asked in 2068",
                "5 marks Asked in 2073",
                "5 marks Asked in 2073",
                "5 marks Asked in 2071",
                "5 marks Asked in 2071",
                "5 marks Asked in 2070",
                "5 marks Asked in 2074",
                "5 marks Asked in 2069",
                "5 marks Asked in 2070",
                "5 marks Asked in 2068",
                "5 marks Asked in 2067",
                "5 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2069",
                "5 marks Asked in 2074",
                "5 marks Asked in 2074"
            ]
        }
    ]
}