{
    "subject": "IntroductiontoCloudComputing",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                33 Questions",
            "Question": [
                "1. How the term cloud has been instantiated in cloud computing ? Discuss the benefits of adapting cloud computing environments.",
                "1. Define cloud computing. Discuss the challenges in cloud computing environments.",
                "1. How can you define cloud service? Describe the characteristics of a cloud service.",
                "2. What is the need for adapting hybrid cloud deployment model? How this model differs from public and private deployment models?",
                "1. Explain the cloud computing model and its benefits.",
                "1. Explain the components of cloud computing.",
                "1. What do you mean by cloud? Describe the basic characteristics of a cloud.",
                "1. Define the term cloud in cloud computing. Conceptualize self-provisioning and provisioning capability in cloud computing.",
                "1. Describe about cloud based services. What are the challenges in cloud computing?",
                "1. How grid computing differs from cloud computing? Justify what the self-service provisioning and multitenacy properties of cloud computing means?",
                "1. How cloud computing is different than traditional on premise computing? How properties like elasticity and scalability influence cloud computing?",
                "2. Discuss the features that make cloud computing better than traditional on premise computing.",
                "2. Differentiate between each of private, public and hybrid cloud models with suitable examples.",
                "3. How grid computing architecture is different than cloud computing architecture?",
                "2. How cloud services can be deployed? In which scenario hybrid cloud model is better to deploy? How it can be used in cloud?",
                "2. How grid computing differs from cloud computing? Justify what the elasticity and multitenancy properties of cloud computing means?",
                "2. Explain the cloud deployment models.",
                "2. What type of deployment models can be adopted in cloud computing. Describe each of them with suitable example.",
                "4. What is virtualization? How cloud services are based on the concept of virtualization?",
                "3. What are the differences between public clouds and private clouds?",
                "3. What do you mean by virtualization? What is the role of virtualization in cloud computing?",
                "3. What is the use of grid computing? How computing in grid architecture differs from cloud architecture? Explain.",
                "5. Differentiate platform as a service, infrastructure as a service and software as a service with each other.",
                "6. How managed service providers evolved as cloud service providers? How multi purpose architectures have been adapted by them?",
                "7. Define service oriented architecture. Why it is defined as black-box and loosely coupled architecture?",
                "8. What is intrusion detection? How network intrusion detection systems are implemented in cloud networks?",
                "8. Explain the different approaches for enforcing host security in a cloud environment.",
                "10. Write Short Notes ona. Amazon Web Servicesb. Grid Computing",
                "9. What is disaster in cloud? How disaster management is done in cloud infrastructures?",
                "10. Write short notes on (any two):     a) Risk Assessment in Cloud     b) Role of Open Source Software in Cloud Computing     c) Grid Computing",
                "10. Write short notes on (any two):     a) Data Segmentation and Credential Management     b) Role of Open Source Software in Cloud Computing     c) Grid Computing",
                "10. Write short notes on:a. Jericho Cube Modelb. Recovery Time Objective and Recovery Point Objective.",
                "10. Write short notes on(any two)a) Jericho Cube Modelb) Role of open source software in cloud computing c) Utility Computing"
            ],
            "Asked": [
                "6 marks Asked in 2076",
                "6 marks Asked in 2078",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in Model",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2075",
                "6 marks Asked in 2078",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in Model",
                "6 marks Asked in 2069",
                "6 marks Asked in 2073",
                "6 marks Asked in 2078",
                "6 marks Asked in 2069",
                "6 marks Asked in Model",
                "6 marks Asked in 2075",
                "6 marks Asked in 2078",
                "6 marks Asked in 2078",
                "6 marks Asked in 2078",
                "6 marks Asked in 2078",
                "6 marks Asked in 2071(I)",
                "10 marks Asked in 2076",
                "6 marks Asked in 2078",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2078",
                "6 marks Asked in 2071(II)"
            ]
        },
        {
            "Chapter": "Unit 2: Cloud Service Models \n                                            \n\n                                                25 Questions",
            "Question": [
                "3. Discuss the various dimensions used by Jericho cloud model to describe cloud computing.",
                "2. Explain the Platform-as-a-Service (PaaS) and its characteristics.",
                "2. Describe possible services that can be achieved through Infrastructure-as-a-Service (IaaS).",
                "4. Describe the cloud services provided under Monitoring-as-a-Service.",
                "3. What do you mean by Elastic IP Addressing? Describe How Elastic IPs work in cloud services.",
                "3. What is the role of Early detection and Intelligent Log Centralization and Analysis services in Monitoring-as-a-Service (MaaS) model?",
                "3. Discuss the capabilities that the cloud users can get through Platform-as-a-Service (PaaS). Also mention the key characteristics of PaaS.",
                "3. Define cloud migration. What are the reasons for the companies to migrate from traditional computing environment to cloud computing environments?",
                "5. What is communication as a service? What features are provided under this service? Mention advantages of this cloud service.",
                "4. How the Jericho Cloud Cube model dimensions like perimeterised, de-perimeterised and proprietary, open differentiate the cloud formations from each other?",
                "4. What are the benefits of using Software-as-a-Service (SaaS) model? Briefly discuss about the maturity levels of Saas Architecture.",
                "4. What do you mean by anything-as-a-service? How external and internal dimension in Jericho cloud cube model differs from the proprietary and open dimension?",
                "4. Explain the Software-as-a-Service (SaaS) and its characteristics.",
                "4. What are the implementation issues on SAAS? Explain.",
                "4. Mention the characteristics of Software-as-a-Sernice(SaaS). What implementation issues should be considered in SasS?",
                "5. Explain how services like early detection, log centralization and continuous system patching are provided under Monitoring-as-a-Service?",
                "5. Explain the platform as a service and its challenges.",
                "5. Explain the service provided by the amazon EC2 service from user perspective.",
                "5. What computing services are provided under PaaS? Discuss, with example, the concepts of perimeterized and deperimeterized dimensions in Jericho Cube Model.",
                "6. What computing can be provided under Communication-as-a-Service? Mention the advantages of using Communication-as-a-Service Cloud Model.",
                "7. Discuss about Jericho Cloud Cube Model. What are the advantages of Communication-as-a-service (CaaS) Model?",
                "7. Explain the Jericho cloud cube model.",
                "8. Discuss about the implementation issues that need to be considered while maintaining Software-as-a-service (SaaS) Model.",
                "10. Discuss the various services provided under Infrastructure-as-a-Service(IaaS)?",
                "10. Describe the services provided by the Monitoring-as-a-service (MaaS) vendors in cloud service systems."
            ],
            "Asked": [
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2069",
                "2+4 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "1+5 marks Asked in 2075",
                "3+3 marks Asked in 2075",
                "6 marks Asked in Model",
                "6 marks Asked in 2072",
                "6 marks Asked in Model",
                "6 marks Asked in 2074",
                "6 marks Asked in Model"
            ]
        },
        {
            "Chapter": "Unit 3: Building Cloud Networks \n                                            \n\n                                                22 Questions",
            "Question": [
                "2. What is para-virtualization? How virtualization is used to enforce cloud computing services?",
                "3. Explain the cloud data center and its application.",
                "4. Discuss about the planning needed for building the Services Oriented Architecture.",
                "6. What is data center virtualization? Discuss the building blocs of data centers.",
                "5. What do you mean by Service Oriented Architecture (SOA). How can you characterize Service Oriented Architecture?",
                "5. What are the Managed Services Providers(MSP)? Discuss the evolution of MSP Model to Cloud Computing.",
                "5. What do you mean by Service Oriented Architecture (SOA). How cloud services get benefited by SOA?",
                "6. Explain the data center virtualization.",
                "6. What are the Managed Service Providers (MSP). Discuss the evolution of MSP Model to cloud computing.",
                "6. Explain the Service Oriented Architecture (SOA) and its characteristics.",
                "6. What are the Managed Service Providers (MSP). Discuss the evolution of MSP Model to cloud computing.",
                "6. Mention the similarities and dissimilarities between managed service providers cloud service providers. How organizations can get benefited by virtualizing the data centers?",
                "6. What do you mean by service oriented architectures (SOA)? How can you characterize SOA?",
                "6. \"Virtualization is the key to cloud computing\", justify this statement with proper arguments. How hypervisors are used in cloud computing services?",
                "7. What is service oriented architecture? Mention its role in building cloud systems.",
                "7. What do you mean by service oriented architecture(SOA)? Explain with example.",
                "7. What is the need for data center virtualization? What are the benefits of data center virtualization?",
                "7. How data center virtualization is done? Discuss the various building blocks of data center.",
                "7. Define virtualization. What is the role of virtualization in cloud computing?",
                "7. Why cloud services are designed based on the loosely coupled component principle of Service Oriented Architecture(SOA)? How SOA is used in designing cloud services?",
                "8. Define SOA. How cloud services can be benifited by using the concepts of service Orinted Architecture?",
                "9. Discuss about the planning needed for building the service oriented architecture."
            ],
            "Asked": [
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2072",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in Model",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071(I)",
                "2+4 marks Asked in 2075",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in Model"
            ]
        },
        {
            "Chapter": "Unit 5: Security in Cloud Computing \n                                            \n\n                                                20 Questions",
            "Question": [
                "4. What are the cloud security challenged? How risks can be handles n cloud computing?",
                "5. Discuss about disasters in cloud. How intrusions are detected in cloud?",
                "8. Discuss the security architecture, trust architecture and governance framework for ensuring cloud security controls.",
                "7. Explain the different types of implementing Network Intrusion Detection Systems in cloud.",
                "9. Discuss different approaches used for ensuring host security in cloud networks.",
                "8. Explain the cloud security challenges.",
                "8. What is host security? Discuss various approaches for ensuring host security in cloud networks.",
                "8. What can be the impact of disasters in cloud? How geographic redundancy and organizational redundancy ensures disaster recovery in cloud services.",
                "8. How can you design the security architecture in cloud? Explain.",
                "8. What do you mean by an intrusion in a cloud network? How intrusion in cloud networks are detected?",
                "9. Why intrusion detection systems are implemented in cloud networks? How anamoly based intrusion detection system differs from signature based?",
                "9. Explain the process of implementation of Network Intrusion Detection.",
                "9. What do you mean by Network Intrusion detection?",
                "9. How data segmentation and credential management ensures host security in a cloud? Explain with suitable example.",
                "9. Why it is important to assess the concept of recovery time objective in disaster recovery? How disaster recovery is done in cloud infrastructure?",
                "9. Discuss how security architecture and trust architecture ensure security of cloud services networks.",
                "9. What do you mean by disaster recovery? How recovery point objective differs from recovery time objective?",
                "10. Explain the disaster recovery planning of cloud computing.",
                "10. Define recovery point objective. How the geographical redundancy and organizational redundancy are used in cloud diasater recovery?",
                "10. Explain the disaster recovery planning in cloud system."
            ],
            "Asked": [
                "6 marks Asked in Model",
                "6 marks Asked in Model",
                "6 marks Asked in 2076",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2073",
                "3+3 marks Asked in 2075",
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2071(I)",
                "6 marks Asked in 2069",
                "2+4 marks Asked in 2075",
                "6 marks Asked in 2072"
            ]
        }
    ]
}