{
    "subject": "KnowledgeManagement",
    "questions": [
        {
            "Chapter": "Unit 1: Unit 1 \n                                            \n\n                                                24 Questions",
            "Question": [
                "1. How does cultural issues effect in knowledge management?List the parameters that motivate and demotivate the people in knowledge management.[5+5]",
                "1. Define knowledge management. Describe the foundation of knowledge management. Explain the phases of decision making. [2+2+6]",
                "2. Define tacit knowledge. Explain the procedure for interviewing experts, structuring interviewing and stories.[2+8]",
                "3. Explain the roles of telecommunications and networks in knowledge management. Describe about knowledge management in health sciences.[5+5]",
                "2. List the purpose, method and benefits of knowledge market.Explain the tacit knowledge at individual level and organization level. [5+5]",
                "3. Explain the relationship between internet search engines and knowledge management. What do you mean by information mapping in information retrieval? [5+5]",
                "4. How does knowledge management plan differ with business plan? Explain.[5]",
                "5. Explain the attributes that support the life cycle of an organization.[5]",
                "6. What does learning by observation means?List some difficulties in information coding in internet environment.[2+3]",
                "4. Describe the components of knowledge strategy. [5]",
                "5. Distinguish between organization strategic and business plan. [5]",
                "7. Define cognitive map. What does explicit knowledge codification mean?[2+3]",
                "6. Explain the roles of knowledge management in developing countries. [5]",
                "8. Describe the benefits of cooperating among distributed technical specialists.[5]",
                "9. How does decision support system differ with expert system? Describe the components of DSS.  [2+3]",
                "7. Explain the ethics for knowledge management. [5]",
                "8. What is knowledge taxonomy? Describe with an example. [5]",
                "10. Explain the issues of security in knowledge management.[5]",
                "11. Why do we need internet filtering? Explain.[5]",
                "9. Describe the quality assurance and its role in knowledge management. [5]",
                "12. Write short notes on(any two)[2.5+2.5]a. Internet Search Engineb. Intellectual Property Rightc. Technology in support of knowledge Management",
                "10. What do you mean by information coding in the internet environment? [5]",
                "11. Explain the methods of learning. [5]",
                "12. Write Short Notes On (Any TWO) [2.5 + 2.5]a. Knowledge Auditb. Cognitive Mapc. Repackaging Information"
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2076",
                "10 marks Asked in 2076",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 2: Unit 2 \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 3: Unit 3 \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Unit 4 \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Unit 5 \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}