{
    "subject": "Microprocessor",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                7 Questions",
            "Question": [
                "1. Draw the block diagram of basic microprocessor and explain it. Which block design is simple and explain it?",
                "1. Explain the operation of the basic microprocessor using block diagram.",
                "5. Compare and contrast microprocessor, CPU and microprocessor.",
                "6. Differentiate between data and address bus with suitable example.",
                "7. What do you understand by I/O interface? Explain different types of I/O instructions.",
                "7. What is system bus? Explain different types of system bus in detail.",
                "12. Write short notes on:    a) Von Neumann architecture    b) Macro Assembler"
            ],
            "Asked": [
                "10 marks Asked in 2065",
                "10 marks Asked in 2069",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2068",
                "5 marks Asked in 2075",
                "5 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 2: Basic Architecture \n                                            \n\n                                                35 Questions",
            "Question": [
                "1. Draw logical block diagram of 8086 microprocessor and explain its segmented memory structure.",
                "1. Explain the operation of 8085 microprocessor using block diagram. Justify that design of control unit in more difficult.",
                "1. Draw the block diagram of 8086 microprocessor and explain each block.",
                "1. Explain the importance of addressing modes in the microprocessor. Discuss different types of addressing modes with examples.",
                "1. Draw and explain the functional block diagram of 8085 microprocessor.",
                "2. Why addressing modes are required in microprocessor? Discuss different types of addressing modes with suitable examples.",
                "2. Explain the application of flags in the microprocessor. Discuss different types of flags with suitable examples.",
                "2. Explain the importance of addressing modes in the microprocessor? Discuss different types of addressing modes with suitable examples.",
                "2. What do you mean by addressing mode? Discuss different types of addressing modes with example.",
                "2. What are the uses of flags in the microprocessor? Discuss different types of flags with examples.",
                "4. Draw pin diagram of 8085 microprocessor with appropriate labelling.",
                "4. Explain the application of different flags with suitable examples.",
                "4. What is flag? Explain its importance with suitable example.",
                "5. Discuss the bus system in 8085 microprocessor.",
                "7. What is addressing mode? Explain different addressing mode in 8085 microprocessor.",
                "4. Explain the addressing modes of 8086 microprocessor with examples.",
                "8. What is the use of AD7-AD0 in 8085 microprocessor? Explain address de-multiplexing process in 8085 microprocessor with suitable diagram.        [1+4]",
                "5. Explain the addressing modes of 8085 microprocessor with examples.",
                "9. What is mean by addressing mode? Explain all the addressing mode available in 8085 microprocessor.",
                "7. Explain the function of following signals    a. ALE    b. INTR    c. TRAP",
                "8. Assume that the accumulator holds the data byte FFH. Explain the differences in the flag set by adding 01H and by incrementing the accumulator contents.",
                "8. Explain the function of following signals:    ALE, READY, RD, and IO/M",
                "11. “Interrupt based I/O is efficient compared to polled I/O”. Justify this statement with general working mechanism in both methods.",
                "7. Write the process of address and data separation in DE-multiplexed address/data bus in 8085 microprocessor.",
                "11. Draw a logic diagram showing generation of memory and I/O read/write control signals in 8085 microprocessor.",
                "10. How can you interface 8086 microprocessor?",
                "10. What are the registers available in 8086 microprocessor? Mention the function the function of each register.",
                "10. Explain three types of flags with suitable examples.",
                "11. Define bus. Describe the function of different types of buses in reference to the 8085 microprocessor.",
                "11. What are the various registers in 8086 microprocessor? Explain the function of each register.",
                "11. How can you achieve pipelining in the basic microprocessor? Explain any type of basic pipelining with suitable diagram.",
                "11. How can you implement pipelining in the basic microprocessor? Explain it with diagram.",
                "10. What is mean by memory interfacing? Explain the address decoding process in the 8085 microprocessor.",
                "10. What is flag? Explain the flags that are present in 8085 microprocessor.",
                "11. Explain how pipelining is achieved in 8086 microprocessor."
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2068",
                "10 marks Asked in 2074",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071",
                "10 marks Asked in 2065",
                "10 marks Asked in 2066",
                "10 marks Asked in 2067",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2070",
                "5 marks Asked in 2070",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in 2075",
                "5 marks Asked in 2078",
                "5 marks Asked in 2070",
                "5 marks Asked in 2072",
                "5 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in 2065",
                "5 marks Asked in 2074",
                "5 marks Asked in 2067",
                "5 marks Asked in 2071",
                "5 marks Asked in 2070",
                "5 marks Asked in 2065",
                "5 marks Asked in 2068",
                "5 marks Asked in 2075",
                "5 marks Asked in 2076",
                "5 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 3: Instruction Cycle \n                                            \n\n                                                13 Questions",
            "Question": [
                "1. Explain instruction cycle, machine cycle and T-states. Draw timing diagram of IN instruction with brief description.        [3+5+2]",
                "2. What is machine cycle and instruction cycle? Draw a timing diagram for STA 2000h memory instruction. (Choose any memory locations for loading STA 2000h instruction)",
                "2. Explain instruction cycle, machine cycle and T-States. Draw timing diagram of STA instruction. Make necessary assumptions.",
                "4. Explain execute operation and timing diagram with suitable example.",
                "4. Explain about fetch operation and timing diagram.",
                "5. Draw the timing diagram of instruction MVI B, 9 bit stored a memory location 4050H and explain it.",
                "6. Draw the timing diagram for MOV B and explain it.",
                "6. Draw the timing diagram of instruction MVI A, 36H and explain it.",
                "8. Illustrate the steps and the timing of data flow when the instruction code 4FH stored location 2005H is fetched by the microprocessor unit.",
                "9. Draw and explain the timing diagram for the execution of the instruction MVI A, 32H.",
                "12. Draw the timing diagram for MVI B and explain it.",
                "12. Draw the timing diagram for ADD C and explain it.",
                "13. What is fetch and execute cycle? Explain it with timing diagram."
            ],
            "Asked": [
                "5 marks Asked in 2078",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2075",
                "5 marks Asked in 2067",
                "10 marks Asked in 2066",
                "5 marks Asked in 2074",
                "5 marks Asked in 2069",
                "5 marks Asked in 2070",
                "5 marks Asked in 2071",
                "5 marks Asked in 2072",
                "5 marks Asked in 2068",
                "5 marks Asked in 2065",
                "5 marks Asked in 2069"
            ]
        },
        {
            "Chapter": "Unit 4: Assembly Language Programming \n                                            \n\n                                                54 Questions",
            "Question": [
                "3. Explain LXI and CMP instruction. Write an assembly language program for 8 bit microprocessor to divide 8 bit data stored in memory location 8050 by 8 bit data stored in 8051 and store the quotient in 8052 and remainder in 8053.        [3+7]",
                "2. Write an assembly language program for 8086 microprocessor to read a string from keyboard and display each word in separate line. The length of input string can be up to 60 characters.",
                "2. Write a program in 8-bit microprocessor to multiply two 16-bit numbers and store in the memory location starting from 3500H. Save the carry bits in the location starting from 3600H.",
                "3. Write an assembly language program to sort an array in ascending order using 8 bit microprocessor. (Assume appropriate array data and address where minimum array size of 10 should be considered).",
                "2. Ten number of 8-bit data stored at memory location 6000H. Write a program for 8085 microprocessor to calculate the sum of odd numbers and store the sum of odd numbers and store the sum at 6010H.(The sum may exceed 8-biys).",
                "3. Describe different types of 8085 instructions sets, based on word size, with suitable examples. Write instructions to load two hexadecimal numbers 32H and 48H in register A and B respectively. Add the numbers and display the sum at the LED output port PORT1.",
                "3. Write a program in 8-bit Microprocessor to store 60h, BAh, 7Ch and 10h in the memory location starting from 2000h. add these data and store the result in 3000h and carry flag in 5001h. explain all the steps.",
                "3. Write a program in 8-bit Microprocessor to multiply two 16 bits numbers (ABCDh and 1234h) and store in the memory location starting from 3000h.",
                "3. Write a program in 8-bit Microprocessor to store 68h, B3h, C Oh, and 11h in the memory location starting from 3000h. Move these data and store in the memory location starting from 3200h.",
                "3. Write a program in 8-bit Microprocessor to store 45h, A0h, B5h and 15h in the memory location starting from 4000h. Add these data and store the result in 5000h and carry flag in 5001h.",
                "3. Write a program in 8-bit Microprocessor to multiply two 16 bits numbers and store in the memory location starting from 3500h. Save the carry bits in the location starting from 3600h.",
                "3. List out the instruction for arithmetic and logic operation in 8085 microprocessor and explain with example. Also mention the effect on flags by each instruction.",
                "3. What are the instructions available in 8085 microprocessor for arithmetic and logic operation? Explain each with example. Also mention, how the flags are affected by each instruction.",
                "3. Write an assembly language program to find the greatest number in an array in using 8 bit microprocessor. (Assume appropriate array data and address where minimum array size of 20 should be considered.)",
                "3. Write an assembly language program to find the smallest number in an array using 8 bit microprocessor. (Assume appropriate array data and address where minimum array size of 15 should be considered.)",
                "5. Specify the output in PORT1 after the execution of the following program. Write comments for each instruction.        MVI A, AAH        MOV B, A        RRC        XRA B        OUT PORT1        HLT",
                "4. What do you understand by PUSH operation? Explain the use of push operation in the case of stack.",
                "6. Differentiate between PUSH and POP instruction with example illustrating the use of these instructions.",
                "4. What do you understand by POP operation? Explain the use of POP operation in the case of stack.",
                "4. Differentiate between PUSH and POP operations. Write a program to illustrate the use of PUSH operations.",
                "7. Write an assembly language program for 16 bit microprocessor to reverse the string \"This is Microprocessor\".",
                "5. Write an assembly language program to multiply two numbers.",
                "5. Write an assembly language program to add two 16-bit numbers (3467h and ACDCh).",
                "5. Write an assembly language program to add two 16-bit numbers.",
                "5. Write an assembly language program to multiply 05h and 06h. Explain all the steps.",
                "5. Write an assembly language program to subtract two 16-bit numbers.",
                "8. Write a program to reverse a given a string using 16 bit microprocessor.",
                "6. Observe the following program and write the content of Accumulator, register B and flags after execution of each instruction.(assume initially all flags are reset)    MVI A, 59H    MVI B, 67H    ADD B    ANI 3AH    HLT",
                "6. What is a macro assemblers? Explain it.",
                "7. The contents of the accumulator are 93H and the contents of register C are B7H. Explain the status of different flags after adding the content of registers A and C.",
                "7. Explain different types of I/O instructions used in 8-bit microprocessor.",
                "7. Define stack. Write programs to illustrate PUSH and POP operations.",
                "7. What is CALL operation? How it differs with JUMP operation? Explain.",
                "5. Write an ALP for 8086 to read string and print it in the reverse order.",
                "8. Write a program in 8085 microprocessor to subtract 16 bit number at 2000H from a 16 bit number at 2010H and store the result at 2020H.",
                "6. Differentiate between PUSH and POP instruction with example illustrating the use of these instruction.",
                "6. Write an ALP for 8086 to read a string and display the string in uppercase.",
                "9. Write an assembly language program for 8086 microprocessor to display\"Computer Science and Information Technology\" .",
                "12. Write Short Notes (Any Two):    a) Macro Assembler    b) BSR Mode    c) System Bus",
                "10. Write an assembly language program to subtract two 16-bit numbers.",
                "8. What is CALL operation? How does it differ with JUMP operation?",
                "10. Observe the following program and write the content of Accumulator, register B and flags after execution of each instruction. (assume all flags are reset).    MVI A, 45H    MVI B, 66H    ADD B    ANI 63H    HLT",
                "11. Write an assembly language to display a string “I want to know more about microprocessor” using 16 bit microprocessor code. Assume any necessary data.",
                "9. What is instruction set? Explain various kind of instructions of 8085 microprocessor.",
                "11. What do you understand by assembler directives? Explain with suitable examples.",
                "12. Write and explain assembly language program to multiply 05H and 06H.",
                "12. Discuss ADD, MUL and DIV instruction of 8086 with suitable examples.",
                "11. Write an assembly language program to display a string \"This is a test program\" using 16 bit microprocessor code. Assume any necessary data.",
                "13. Write an assembly language program to display a string “Microprocessor programming is a fun” using 16 bit microprocessor code. Assume any necessary data.",
                "13. Differentiate between PUSH and POP operations with suitable example.",
                "13. Write an assembly language to display a string “Assembly language coding is difficult” using 16 bit microprocessor code. Assume any necessary data.",
                "13. What do you understand by macro assembler? Explain.",
                "13. Write an assembly language to display a string “I like programming in the assembly language” using 16 bit microprocessor code. Assume any necessary data.",
                "11. What is instruction set? Explain various Kinds of instructions of 8086 microprocessor."
            ],
            "Asked": [
                "5 marks Asked in 2078",
                "10 marks Asked in 2070",
                "10 marks Asked in 2071",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2074",
                "10 marks Asked in 2072",
                "10 marks Asked in 2066",
                "10 marks Asked in 2067",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "10 marks Asked in 2065",
                "10 marks Asked in 2070",
                "10 marks Asked in 2074",
                "10 marks Asked in 2076",
                "10 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2068",
                "5 marks Asked in 2078",
                "5 marks Asked in 2069",
                "5 marks Asked in 2065",
                "5 marks Asked in 2078",
                "5 marks Asked in 2069",
                "5 marks Asked in 2067",
                "5 marks Asked in 2068",
                "5 marks Asked in 2066",
                "5 marks Asked in 2065",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2074",
                "5 marks Asked in 2066",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2072",
                "5 marks Asked in 2074",
                "5 marks Asked in 2076",
                "5 marks Asked in 2070",
                "5 marks Asked in 2076",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2071",
                "5 marks Asked in 2076",
                "5 marks Asked in 2070",
                "5 marks Asked in 2066",
                "5 marks Asked in 2075",
                "5 marks Asked in 2072",
                "5 marks Asked in 2072",
                "5 marks Asked in 2070",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068",
                "5 marks Asked in 2066",
                "5 marks Asked in 2065",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2076"
            ]
        },
        {
            "Chapter": "Unit 4: Basic I/O, Memory R/W and Interrupt Operations \n                                            \n\n                                                27 Questions",
            "Question": [
                "2. Describe the working mechanism of DMA. Draw the internal architecture of the 8237 DMAC along with a timing diagram illustrating the process of DMA transfers.",
                "5. Differentiate between interrupt based I/O and DMA based I/O. Explain basic DMA operation in brief.        [2+3]",
                "6. What is DMA? Explain the sequence of events that occurs during DMA operation?",
                "6. What is DMA? Explain DMA data transfer with suitable diagram.",
                "6. What do you understand by address decoding in the case of memory interfacing? Explain address decoding using 3 to 8 Decoder.",
                "6. Define maskable and non-maskable interrupt. Explain the role of TRAP in 8085 microprocessor.",
                "6. What do you understand by address decoding in the case of memory interface? Explain address decoding using Simple NAND Gate Decoder.",
                "4. Differentiate between vectored and non-vectored interrupts.Where and how 8259 PIC can be used to handle interrupts.",
                "9. Explain memory interfacing in 8085 microprocessor along with appropriate diagram.",
                "8. What do you mean by interrupt? Explain in detail about Basic Interrupt Processing.",
                "8. Why interrupt is required? Draw the block diagram of interrupt handler and explain it.",
                "8. What do you mean by interrupt vector? Explain in detail about hardware interrupt.",
                "8. Why interrupt is required? Draw the block diagram of interrupt handler and explain it.",
                "8. What do you mean by interrupt? Explain in detail about software interrupt.",
                "9. Discuss the importance of interrupt in microprocessor based system. Explain how interrupt controller (8259) can be used to handle interrupts.",
                "9. Explain the basic DMA Operation with required timing diagram.",
                "9. Explain the basic DMA Operation with required timing diagram.",
                "9. Explain the Basic DMA Operation with required timing diagram. What are the uses of the DMA transfers?",
                "9. Explain the basic DMA Operation with required timing diagram.",
                "9. Explain the basic DMA Operation with required timing diagram. What are the uses of DMA transfers?",
                "12. Write short notes on (ant two):    [2 x 2.5]    a) Program Counter    b) Von-Neumann Architecture    c) Interrupt Masking",
                "11. What is the importance of interrupt in microprocessor based system? Explain how interrupt controller(8259) can be used to handle interrupts.",
                "12. What is an interrupt? Explain software interrupt in detail.",
                "12. Explain about keyboard and display controller.",
                "13. Explain briefly on keyboard and display controller.",
                "13. Explain in briefly on keyboard and display controller.",
                "13. Define interrupt and vectored interrupt. Can the microprocessor be interrupted again before the completion of the first interrupt service routine? Explain."
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2065",
                "5 marks Asked in 2071",
                "5 marks Asked in 2068",
                "5 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2068",
                "5 marks Asked in 2065",
                "5 marks Asked in 2069",
                "5 marks Asked in 2067",
                "5 marks Asked in 2066",
                "5 marks Asked in 2070",
                "5 marks Asked in 2067",
                "5 marks Asked in 2068",
                "5 marks Asked in 2066",
                "5 marks Asked in 2065",
                "5 marks Asked in 2069",
                "5 marks Asked in 2078",
                "5 marks Asked in 2074",
                "5 marks Asked in 2071",
                "5 marks Asked in 2067",
                "5 marks Asked in 2074",
                "5 marks Asked in 2070",
                "5 marks Asked in 2072"
            ]
        },
        {
            "Chapter": "Unit 6: Input/ Output Interfaces \n                                            \n\n                                                15 Questions",
            "Question": [
                "3. List the elements of the 8255A programmable peripheral Interface and explain its various operating modes in detail.",
                "4. What are different modes of parallel communication? Construct a control word for 8255 PPI for following configuration:        Port A and Port Cupper - mode 0        Port B and Port Clower - mode 0        Port A and Port Cupper as input port        Port B and Port Clower as output port",
                "5. What is an interface? Explain about RS-232 interface with example.",
                "7. What are the function of I/O interface? Explain it with example.",
                "7. What are the functions of I/O interface? Explain it with suitable example.",
                "7. Which I/O interface is used in the 8-bit microprocessor? Explain different types of I/O instructions.",
                "9. Explain the role of wait states to synchronize the execution speed of microprocessor with the response time of memory while transferring data.",
                "8. How DTE and DCE are wired using Rs-232 cable. Explain the process of double handshake I/O.",
                "10. Why serial and parallel communication are used in a computer system? Explain.",
                "10. Explain about RS 232 interface with suitable example.",
                "9. Differentiate between synchronous and asynchronous serial communication. Show DTE-DTE and DTE-DCE connection according to RS-232 serial communication standard.",
                "11. Why do we require serial communication? Explain with suitable example.",
                "12. Why parallel communication is required? Explain with reference to 8-bit system.",
                "12. What are the differences between parallel and serial communication? Explain RS 232 interface.",
                "12. Why parallel communication is required? Explain with reference to 8-bit system."
            ],
            "Asked": [
                "10 marks Asked in 2071",
                "5 marks Asked in 2078",
                "5 marks Asked in 2072",
                "5 marks Asked in 2069",
                "5 marks Asked in 2066",
                "5 marks Asked in 2065",
                "5 marks Asked in 2071",
                "5 marks Asked in 2075",
                "5 marks Asked in 2072",
                "5 marks Asked in 2066",
                "5 marks Asked in 2076",
                "5 marks Asked in 2067",
                "5 marks Asked in 2066",
                "5 marks Asked in 2074",
                "5 marks Asked in 2069"
            ]
        },
        {
            "Chapter": "Unit 7: Advanced Microprocessors \n                                            \n\n                                                8 Questions",
            "Question": [
                "2. Draw block diagram of 80286 microprocessor and explain its main four functional sub-units. Differentiate between Real Address Mode and Protected Virtual Address Mode.        [4+4+2]",
                "1. Draw block diagram of 80386 and explain its functional units.",
                "1. Draw block diagram of 80286 and explain its functional units.",
                "10. What are different operating modes in 80286 microprocessor? Explain in brief about each mode.",
                "10. Explain Register Organization in 80386 microprocessor.",
                "10. How can you interface 8036DX microprocessor?",
                "10. How can you interface 80286SX microprocessor? Explain.",
                "12. Write short notes on:    a) Harvard architecture     b) GDT and LDT"
            ],
            "Asked": [
                "5 marks Asked in 2078",
                "10 marks Asked in 2076",
                "10 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068",
                "5 marks Asked in 2076"
            ]
        },
        {
            "Chapter": "Unit 8: Old Syllabus \n                                            \n\n                                                6 Questions",
            "Question": [
                "1. Explain the SAP I architecture with suitable block diagram. Compare it with SAP 2 architecture.",
                "1. Draw the block diagram of SAP2 architecture and explain it. Compare it with SAP1 architecture.",
                "1. Explain with block diagram of SAP-1 computer.",
                "2. Draw the block diagram of SAP2 architecture and explain it. Compare it with SAP1 architecture.",
                "4. List bidirectional registers of SAP2. Why bidirectional? Explain.",
                "4. What are the basic features of SAP-1 computer? Explain."
            ],
            "Asked": [
                "10 marks Asked in 2066",
                "10 marks Asked in 2067",
                "10 marks Asked in 2070",
                "10 marks Asked in 2072",
                "5 marks Asked in 2071",
                "5 marks Asked in 2074"
            ]
        }
    ]
}