{
    "subject": "NetworkSecurity",
    "questions": [
        {
            "Chapter": "Unit 1: Computer Network Security Fundamentals \n                                            \n\n                                                41 Questions",
            "Question": [
                "1. Define passive attack and active attack. Explain the OSI security architecture.",
                "1. How can you differentiate data integrity from system integrity? Briefly discuss the catagories of security services.",
                "1. What is nonrepudiation of origin? How connection confidentiality differs from connectionless confidentlity?",
                "1. Explain the basic computer security with example.",
                "2. What are the disadvantages of asymmetric cryptography ? Describe the components of Public Key Infrastructure.",
                "2. What is the role of CRL issuer in public key infrastructure? How revocation request and cross certification functions are executed in PXIX?",
                "2. What is the use of master (permanent) keys in security? Write a protocol to share public keys using public-key authority scheme.",
                "3. What are the principle differences between version 4 and version 5 of Kerberos? Differentiate between pre-shared key and extensible authentication protocol for authenticating devices onto a wireless networks.",
                "3. Explain the distribution of public keys with practical example.",
                "4. Explain different services provided by PGP.",
                "3. Assume an open distributed network environment in which users at workstations wish to access services on servers distributed throughout the network. Now discuss how you can use Kerberos protocol for secured service communication between users and servers in the environment.",
                "3. What do you mean by reply attack? Discuss the roles of Authenticating Server and Ticket Granting Server in Kerberos protocol.",
                "4. Explain the user authentication principles with example.",
                "4. What is the use of identity in network security? Describe the principal elements of an identify management system.",
                "4. What basic security services do the SSL Record Protocol provides for SSL Connections? Mention details of the operations that the SSL Record Protocol executes for ensuring the basic security services.",
                "5. Explain the principle categories of SET participants.",
                "5. Define a conection state in SSL. How Alert Protocol is used to convey SSL-related alerts to the peer entity in SSL connection?",
                "5. What do you mean by local forwarding in SSH? Describe about the possible channel types recognized in SSH Connection Protocol specification.",
                "6. What type of vulnerability ensure of cyber security? List the types of SSL protocols.",
                "6. Why variable padding length is used in TLS? In SSH, how User Authentication Protocol authenticates clients.",
                "6. How accidental and maliclous associations can be threats to wireless networks. Describe the approaches to provide WAP End-to-End Security.",
                "5. What do you mean by transport-level security? Explain with example.",
                "6. What do you mean by secure shell(SSH)? Explain.",
                "7. What does IP security policy means? Why does ESP include a padding field?",
                "7. What services are defined under IEEE 802.11i RSN security specification? Discuss to IEEE 802.11i phases of operation for Authentication and Association.",
                "7. Explain the wireless transport layer security with example.",
                "8. Define public key certificate. List the requirements for the use of public key certificate scheme.",
                "7. Discuss IEEE 802.11i phases of operation?",
                "9. What are web security issues? Describe remote user authentication principles.",
                "8. What functionalities PGP provides for mail security? How PGP ensures confidentiality and authentication services?",
                "8. How can you secure the electronic mail? Explain with example.",
                "8. How PGP provides E-mail compatibility feature? What is the use of S/MIME?",
                "10. Write short notes on(Any Two)a. DKIMb. Transport mode and tunnel modec. Secure Shell(SSH)",
                "9. What do you mean by IP security? Explain IP security in brief.",
                "9.Differentiate between Transport and Tunnel Mode. Briefly describe the fields of an Encapsulating Security Payload (ESP) packet.",
                "9. Explain benefits of using IPsec. How IPSec Protocol processes outbound packets?",
                "10. What is cyber crime? Discuss various kinds of cyber crime attacks.",
                "10. Differentiate between security Attacks and security services.",
                "10. Define cyber security and cyber war.",
                "11. Discuss OSI security Architecture.",
                "11. Explain in brief about Cyber security."
            ],
            "Asked": [
                "6 marks Asked in 2078",
                "6 marks Asked in 2074",
                "2+4 marks Asked in 2075",
                "6 marks Asked in 2072",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2078",
                "6 marks Asked in 2072",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2072",
                "6 marks Asked in 2078",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2078",
                "6 marks Asked in 2075",
                "6 marks Asked in 2078",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2078",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in 2075",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "6 marks Asked in 2074",
                "6 marks Asked in 2072"
            ]
        },
        {
            "Chapter": "Unit 2: User Authentication \n                                            \n\n                                                1 Questions",
            "Question": [
                "2. Explain the model for Network Security."
            ],
            "Asked": [
                "6 marks Asked in 2072"
            ]
        },
        {
            "Chapter": "Unit 3: Transport Level Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Wireless Network Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Electronic Mail Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 6: IP Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 7: Network Endpoint Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 8: Cloud and Internet of Things (IOT) Security \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}