{
    "subject": "NumericalMethod",
    "questions": [
        {
            "Chapter": "Unit 1: Solution of Nonlinear Equations \n                                            \n\n                                                25 Questions",
            "Question": [
                "1. How can Horner's rule be used to evaluate the f(x) and f(x) of a polynomial at given point? Explain. Write an algorithm and program to calculate a real root of a polynomial using Horner's rule.",
                "1. Define the fixed-point iteration method. Given the function f(x) = x2 − 2x − 3 = 0, rearrange the function in such a way that the iteration method converses to its roots. (2+3+3)",
                "1. Define the types of errors in numerical calculations. Derive the formula for secant method and illustrate the method by figure. (4+4)",
                "1. Derive the formula to solve nonlinear equation using secant method. Using your formula estimate a real root of following nonlinear equation using secant method correct up to two decimal places x2+ ln x = 3. (3+5)",
                "1. What is bracketing and non-bracketing method? Explain with the help of example. Estimate a real root of following nonlinear equation using bisection method correct up to two significant figures(3 + 5)                x2sinx + e-x = 3",
                "1. How is the bisection method convergent to a root of an equation? Apply the bisection method to find a root of the equation (3 + 5)",
                "1. What are the sources of errors? Discuss various types of errors. Find the roots of the equation x2 + 5.6x − 10= 0 by trial and error method up to 4 significant digits. (1+3+4)",
                "1. Discuss methods of Half Interval and Newton’s for solving the nonlinear equation f(x) = 0. Illustrate the methods by figure and compare them stating their advantages and disadvantages. (8)",
                "1. Explain the idea of the secant method to estimate the root of any equation. Using the secant method, estimate the root of the equation x2 - 4x - 10 = 0 with the initial estimates of x1 = 4 and x2 = 2. Do these points bracket a root?(3 + 4 + 1)",
                "1. How can you use bisection method for the solution of nonlinear equations? Discuss with suitable example.(8)",
                "1. What is error? Discuss various types of errors. Estimate a real root of the following nonlinear equation using bisection method or Newton's method correct up to two decimal places sin x - x2 - x + 3 = 0 (3 + 5)",
                "1. What is non-linear equation? Derive the required expression to calculate the root of non-linear equation using secant method. Using this expression find a root of following equation.X2 + cos(x) - e -x -  2 = 0",
                "2. Describe Newton’s method and its convergence. Find the root of equation f(x) = ex− 4x2 = 0      using Newton method up to 5 decimal places. (4+4)",
                "1. Derive the formula for Newton Raphson Method. Solve the equation x2 + 4x - 9 = 0 using Newton Raphson method. Assume error precision is 0.01. Discuss drawbacks of the Newton Raphson method.",
                "4. How the half-interval method can estimate a root of non-linear equation? Find a real root of following equation using half-interval method correct up to two decimal places.                x2 - e-x - x = 1",
                "4. Write a program to solve a non linear equation using bisection method.",
                "5. Find the roots of the following equations using Newton’s method.    \r\nlog x – cos x = 0",
                "5. Calculate a real root of the given equation using fixed point iteration correct up to 3 significant figures.        2x3 - 2x = 5",
                "7. Write an algorithm and C program for the secant method to find the roots of non-linear equation.(4 + 8)ORWrite an algorithm and a C program for the Sinpson's 1/3 rule to integrate a given function.(4 + 8)",
                "7. Write an algorithm and program to compute all roots of polynomial using secant method.",
                "4. Define the terms true error and relative error? Use Horner' method to evaluate polynomial 2x3 - 3x2 + 5x - 2 at x = 3 and write down its algorithm.",
                "7. Write an algorithm to solve non-linear equation using secant method. On the basis of your algorithm write a C-program that reads two initial guess from keyboard and displays the following information if the solution is obtained:(5 + 7)        a) Calculated root of the equation        b) Required number of iterations        c) Functional value at calculated rootIf solution is not obtained within 200 iterations your program should be terminated by displaying the following message:        NO SOLUTION WITHIN 200 ITERATIONS        TRY AGAIN WITH NEW INITIAL VALUES",
                "4. Calculate a real negative root of following equation using Newton's method for polynomial.x4 + 2x3 + 3x2 + 4x = 5",
                "7. Write an algorithm and C-program code to solve non-linear equation using Newton’s method. Your program should read an initial guess from keyboard and display the followings if the solution is obtained: (5+7) Estimated root of the equation Functional value at calculated root Required number of iterations",
                "7. Write an algorithm and a C-program for the fixed point iteration method to find the roots of non-linear equation. (4+8)ORWrite an algorithm and a C-program for the Lagrange’s interpolation to approximate the functional value at any given x from given n data. (4+8)"
            ],
            "Asked": [
                "10 marks Asked in 2078",
                "8 marks Asked in 2066",
                "8 marks Asked in 2068",
                "8 marks Asked in 2069",
                "8 marks Asked in 2070",
                "8 marks Asked in 2071",
                "8 marks Asked in 2072",
                "8 marks Asked in 2067",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2075(OldCourse)",
                "10 marks Asked in 2075(NewCourse)",
                "8 marks Asked in 2072",
                "10 marks Asked in 2077",
                "5 marks Asked in 2078",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "12 marks Asked in 2073",
                "12 marks Asked in 2074",
                "5 marks Asked in 2077",
                "12 marks Asked in 2075(OldCourse)",
                "5 marks Asked in 2075(NewCourse)",
                "12 marks Asked in 2069",
                "12 marks Asked in 2071"
            ]
        },
        {
            "Chapter": "Unit 2: Interpolation and Regression \n                                            \n\n                                                25 Questions",
            "Question": [
                "2. Write an algorithm and a program to compute the interpolation value at a specific point,\r\ngiven a set of data points, using Lagrange interpolation method.",
                "2. What do you mean by interpolation problem? Define divided difference table and construct the table from the following data set. (2+2+4)ORFind the least squares line that fits the following data.What do you mean by linear least square approximation?",
                "2. Define the linear least squares approximations. Give the data set (xi, yi) as (20.5, 765), (32.7, 826), (51.0, 873), (73.2, 942), (95.7, 1032) find the linear least square to fit given data. (2+6)",
                "2. Estimate f(3) from the following data using Cubic Spline interpolation.ORFind the best fitting quadratic polynomial from following data using least square approximation.",
                "2. Define interpolation. Find the Lagrange interpolation polynomial to fit the following data. Estimate the value (1 + 6 + 1)",
                "2. Derive the equation for Lagrange’s interpolating polynomial and find the value of f(x) at x = 1 for the following: (4+4)",
                "2.  Define interpolation. Find the functional value at x=3.6 from the following data using forward difference table:",
                "2. Given the data Calculate f(1.35) using Newton's interpolating of order 1 through 3. Choose base points to attain good accuracy. Comment on the accuracy of results on the order of polynomial.(5 + 3)",
                "2. Define interpolation. Find the Lagrange interpolation polynomial to fit the following data:Use the polynomial to estimate the value of e15.            (2 + 6)",
                "2. How polynomial interpolation differs with Cubic Spline interpolation? Explain. Find the best fit curve of quadratic polynomial using least square approximation from following data.",
                "2. How interpolation differs from regression? Write down algorithm and program for Lagrange interpolation.",
                "3. What do you mean by interpolation and approximation? Use Lagrange interpolation to estimate the value of f(0.6) from the following table of values. (2+6)",
                "4. Using Newton’s divided difference interpolating polynomial estimate the value of f(x) at x = 2.25 for the function defined as",
                "5. Write an algorithm and computer program to fit a curve y = ax2 + bx + c for given sets of (xi, yi, g. 0 = 1, ..., x) values by least square method. (4+8)",
                "6. Estimate the value of ln(3.5) using Newton’s backward difference formula, given the\r\nfollowing data",
                "6. What is Newton's interpolation? Obtain the divided difference table from the following data set and estimate the f(x) at x=2 and x=5.",
                "7. Write an algorithm and C-program to approximate the functional value at any given x from given n no. of data using Lagrange’s interpolation. (5+7)",
                "7. Fit a straight line to the following set of data.",
                "5. Construct Newton's forward difference table for the given data points and approximate the value of f(x) at x = 15.",
                "5. What is least squares approximation of fitting a function? How does it differ with polynomial interpolation? Explain with suitable example.",
                "7. What is linear regression? Fit the linear function to the following data.",
                "8. What are the problems with polynomial interpolation for large number of data set? How such problems are addressed? Explain with example.",
                "6. Fit the curve y = ae bx through the following data points.",
                "6. Find the lowest degree polynomial, which passes through the following points:Using this polynomial estimate f(x) at x = 0",
                "7. Fit function of type y = a + bx for the following points using least square method."
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "8 marks Asked in 2066",
                "8 marks Asked in 2068",
                "8 marks Asked in 2069",
                "8 marks Asked in 2071",
                "8 marks Asked in 2067",
                "8 marks Asked in 2070",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2075(OldCourse)",
                "10 marks Asked in 2077",
                "8 marks Asked in 2072",
                "8 marks Asked in 2072",
                "12 marks Asked in 2066",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "12 marks Asked in 2070",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2077",
                "5 marks Asked in 2075(NewCourse)",
                "5 marks Asked in 2078",
                "5 marks Asked in 2078",
                "5 marks Asked in 2077",
                "5 marks Asked in 2075(NewCourse)",
                "5 marks Asked in 2075(NewCourse)"
            ]
        },
        {
            "Chapter": "Unit 3: Numerical Differentiation and Integration \n                                            \n\n                                                16 Questions",
            "Question": [
                "3. Derive the composite formula for the trapezoidal rule with its geometrical figure. Evaluate dx using this rule with n=5, upto 6 decimal places.(4 + 4)",
                "3. Write Newton-cotes integration formulas in basic form for x = 1, 2, 3 and give their composite rules. Evaluate using the Gaussian integration three point formula. (4+4)",
                "3. Evaluate  using trapezoidal rule with n=10. Also evaluate the same integral using Grossion 3 point formula and compare the result. (4+4)",
                "3. a) For the function   estimate f’(6.3) and f”(6.3) [take h = 0.01]         (4)    b) Evaluate  using Gaussian integration 3 point formula.         (4)",
                "3. Derive Simpson’s 1/3 rule to evaluate numerical integration. Using this formula evaluate (4 + 4)",
                "3. Derive Simpson’s 1/3 rule to evaluate numerical integration. Using this formula evaluate (4 + 4)",
                "3. How do you find the derivative if the function values are given in a tabulated form? The distance traveled by a vehicle at the intervals of 2 minutes are given as follows. Evaluate the velocity and acceleration of the Vehicle at time T = 5, 10, 13.",
                "3. Derive trapezoidal rule to evaluate numerical integration. Use this formula to evaluate the integral                                                             (2 + 6)",
                "3. (a) For the function estimate f'(2.1) and f''(2.7) [take h = 0.05] (3)    (b) Evaluate using trapezoidal rule taking h = 0.1 and h = 0.2. Also improve your result using Romberg integration.(4)",
                "3. Derive Composite Simpson’s 1/3 Rule for numerical integration. How does it improve\r\nthe accuracy of integration?",
                "8. Estimate the first derivative of f(x)=ln x at x=1 using the second order central difference\r\nformula.",
                "9. Evaluate the following integration using Romberg integration.",
                "8. Calculate the integral value of the function given below from x = 1.8 to x = 3.4 using Simpson's 1/3 rule.",
                "8. Write down algorithm and program for the differentiating continuous function using three point formula.",
                "9. Evaluate the following integration using Romberg integration.",
                "9. How Simpson's 1/3 rule differs from trapezoidal rule? Derive the formula for Simpson's 1/3 rule."
            ],
            "Asked": [
                "8 marks Asked in 2066",
                "8 marks Asked in 2067",
                "8 marks Asked in 2068",
                "8 marks Asked in 2069",
                "8 marks Asked in 2070",
                "8 marks Asked in 2071",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2075(OldCourse)",
                "10 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2075(NewCourse)",
                "5 marks Asked in 2077",
                "5 marks Asked in 2075(NewCourse)",
                "5 marks Asked in 2077"
            ]
        },
        {
            "Chapter": "Unit 4: Solving System of Linear Equations \n                                            \n\n                                                20 Questions",
            "Question": [
                "1. Compare Gauss Elimination method and Gauss Jordan method of solving simultaneous\r\nequation. Use Gauss Elimination to solve the following system of equation and also write\r\nits algorithm.\r\n    2x+3y+4z=5\r\n    3x+4y+5z=6\r\n    4x+5y+6z=7",
                "2. What is matrix factorization? How can it be used to solve system of linear equations? Factorize the given matrix A and solve the system of equations Ax=b for given b using L and U matrices.     and",
                "2. What is matrix factorization? Factorize the given matrix A into LU using Dolittle algorithm and also solve Ax = b for given b using L and U matrices.",
                "4. Solve the following algebraic system of linear equations by Gauss-Jordan algorithm. (8)",
                "4. What is pivoting? Why is it necessary? Explain. Solve the following set of equations using Gauss elimination or Gauss Seidel method.(3 + 5)        x1 + 10x2 +x3 = 24        10x1 + x2 + x3 = 15        x1 + x2 + 10x3 = 33",
                "4. What do you mean by ill-conditioned systems? Solve the following system using Dolittle LU decomposition method.(2 + 6)        3x1 + 2x2 + x3 = 24        2x1 + 3x2 + 2x3 = 14        x1 + 2x2 + 3x3 = 14",
                "4. Solve the following system of linear equations using Gauss-elimination method (use partial pivoting if necessary);(8)        2x2 + x4 = 0        2x1 + 2x2 + 3x3 + 2x4 = -2        4x1 – 3x2 + x4 = -7        6x1 + x2 – 6x3 – 5x4 = 6 ORWhat do you mean by eigen -value eigen- vector problems? Find the largest eigen value correct to two significant digits and corresponding eigen vectors of the following matrix using power method.(2 + 6)",
                "4. What do you mean by ill-conditioned systems? Solve the following system using Dolittle LU decomposition method.        3x1 + 2x2 + x3 = 10        2x2 + 3x2 + 2x3 = 14        x1 + 2x2 + 3x3 = 14",
                "4. Discuss Gauss-Jordan method for solving a system of linear equations. Solve the system        2x1 + 4x2 - 6x3 = -8        x1 + 3x2 +x3 = 10        2x1 - 4x2 - 2x3 = -12Using Gauss-Jordan method.",
                "4. Decompose the given matrix [A] into LU form. Then using decomposed matrices L and U solve the system of linear equation  Ax = b for given [b].(4 + 4)ORHow can you calculate the inverse of a matrix? Explain. Solve the system of linear equations Ax = b for given [A] and [b] using Gauss elimination method. (use partial pivoting) (3 + 5)",
                "4. Solve the following system of algebraic linear equations using Jacobi or Gauss-Seidel iterative (8)        6x1 – 2x2 + x3 = 11        -2x1 + 7x2 + 2x3 = 5        X1 + 2x2 – 5x3 = -1",
                "3. Why partial pivoting is used with Naive Gauss Elimination method? Solve the following system of equations using Gauss Elimination method with partial pivoting? How Gauss Jordan method differs from Gauss elimination method?    2x + 2y - z = 6    4x + 2y + 3z = 4    x + y + z = 0",
                "5. Write an algorithm and program to solve system of linear equations using Gauss- Jordan method. (4+8)",
                "4. Solve the following set of equation using Gauss elimination or Gauss Jordan method.         (8)        3x1 + 5x2 - 3x3 + x4 = 16        2x1 + x2 + x3 + 4x4 = 9        3x1 – 4x2 – x4 = 1        2x1 + x2 – 3x3 + 9x4 = 5",
                "5. Write algorithm for Gauss- Seidel method for solving the system of linear equations. Also solve the following system of linear equations using that method. (4+4)        10x1 + x2 + x3 = 12        x1 + 10x2 - x3 = 10        x1 - 2x2 + 10x = 9",
                "5. Write an algorithm and program to solve system of linear equations using Gauss-Seidel iterative method. (4+8)",
                "9. Compare and contrast between Jacobi iterative method and Gauss Seidal method.",
                "7. Discuss the Doolittle LU decomposition method for matrix factorization.",
                "10. Solve the following set of linear equations using Gauss Jordan method.            x2 + 2x3 + 3x4 = 9            7x1 + 6x2 + 5x3 + 4x4 = 33            8x1 + 9x2 + x4 = 27            2x1 + 5x2 + 4x3 + 3x4 = 23",
                "10. Solve the following set of equations using Gauss Seidel method.        x + 2y + 3z = 4        6x - 4y + 5z = 10        5x + 2y + 2z = 25"
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2078",
                "10 marks Asked in 2075(NewCourse)",
                "8 marks Asked in 2067",
                "8 marks Asked in 2070",
                "8 marks Asked in 2071",
                "8 marks Asked in 2068",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2075(OldCourse)",
                "8 marks Asked in 2066",
                "10 marks Asked in 2077",
                "12 marks Asked in 2068",
                "8 marks Asked in 2069",
                "8 marks Asked in 2072",
                "12 marks Asked in 2067",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2077",
                "5 marks Asked in 2078",
                "5 marks Asked in 2075(NewCourse)"
            ]
        },
        {
            "Chapter": "Unit 5: Solution of Ordinary Differential Equations \n                                            \n\n                                                18 Questions",
            "Question": [
                "3. What is higher order differential equation? How can you solve the higher order differential equation? Explain. Solve the following differential equation for , taking h=0.25.     with y(1) = 1 and y'(1) = 2",
                "3. What is initial value problem and boundary value problem? Write an algorithm and program to solve the boundary value problem using shooting method.",
                "5. (a) How can you solve higher order differential equation? Explain.        (3)    (b) Solve the following differential equation within 1 ≤ x ≤ 2 using Runge-Kutta 4th order method.        (5)",
                "5. How can you solve higher order differential equation? Explain. Solve the following differential within 0 ≤ x ≤ 1 using Heun’s method.(3 + 5)",
                "5. Compare Euler’s method with Heun’s method for solving differential equation. Obtain y(1.5) from given differential equation using Runge-Kutta 4th order method.(4 + 4)ORSolve the following boundary value problem using shooting method.(8)",
                "5. Solve the following boundary value problem using shooting method.(8)",
                "5. Obtain y(1.5) to the following differential equation using Runge-Kutta 4th order method.        (8)    taking h = 0.25",
                "5. How can you use Taylor series method to find the solution of ordinary differential equation? Use the Taylor method to solve the equation (5 + 3) y' = x2 + y2 for x = 0.25 and x = 0.5 given y(0) = 1ORDefine boundary value problem. Use shooting method to solve the equation in the interval(1, 2).",
                "6. Explain the Picard’s proves of successive approximation. Obtain a solution upto the fifth approximation of the equation such that y = 1 when x = 0 using Picard’s process of successive approximations . (2+6)",
                "6. Apply Runge-Kutta method of second order and fourth order to find an approximate value of y when x = 0.2 given that (8)",
                "7. Write an algorithm and program for computer to obtain the solution of differential equation using Runge-Kutta Method. {5+7)",
                "7. Define ordinary differential equation of the first order. What do you mean by initial value problem? Find by Taylor’s series method, the values of y at x = 0.1 and x = 0.2 to find places of decimal form(2 + 6)",
                "10. Explain about boundary value problem with example? Differentiate it with initial value\r\nproblem",
                "11. Use the Heun's method to estimate y(0.4) when\r\n    y’(x)=x2\r\n+y2 with y(0)=0.\r\nAssume h=0.2",
                "11. Solve the following differential equation for , taking h = 0.25 using Heun's method.        y'(x) + x2y = 3x, with y(1) = 1",
                "10. Appropriate the solution of y' = 2x + y , y(0) = 1 using Eulers method with step size 0.1. Approximate the value of y(0.4).",
                "11. From the following differential equation estimate y(1) using RK 4th order method.",
                "12. How boundary value problems differs from initial value problems? Discuss shooting method for solving boundary value problem."
            ],
            "Asked": [
                "10 marks Asked in 2078",
                "10 marks Asked in 2075(NewCourse)",
                "8 marks Asked in 2075(OldCourse)",
                "8 marks Asked in 2069",
                "8 marks Asked in 2070",
                "8 marks Asked in 2071",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2067",
                "8 marks Asked in 2068",
                "12 marks Asked in 2072",
                "8 marks Asked in 2066",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2077",
                "5 marks Asked in 2075(NewCourse)",
                "5 marks Asked in 2077"
            ]
        },
        {
            "Chapter": "Unit 6: Solution of Partial Differential Equations \n                                            \n\n                                                15 Questions",
            "Question": [
                "6. Derive a difference equation to represent a Poison’s equation. Solve the Poison’s equation ∇2 f = 2x2y2 over the domain 0 ≤ x ≤ 3, 0 ≤ y ≤ 3 with f = 0 on the boundary and h = 1.(3 + 5)",
                "6. Write the finite difference formula for solving Poisson’s equation. Hence solve the Poisson’s equation∇2f = 2x2y2 over the domain 0 ≤ x ≤ 3 and 0 ≤ y ≤ 3 with f = 0 on the boundary and h = 1.        (1 + 7)",
                "6. What do you understand by the partial differential equation? Illustrate it with practical example and derive difference equation. (8)ORFind the solution of following differential equations using Taylor series method.",
                "6. What do you understand by the partial differential equation? Illustrate it with practical example and derive difference equation. (8)ORFind the solution of following differential equations using Taylor series method.",
                "6. Write the finite difference formula for solving Poisson's equation. Hence solve the Poisson equationover the domain 0 ≤ x ≤ 1.5 and 0 ≤ y ≤ 3 with f = 0 on the boundary and h = 0.5        (1 + 7)",
                "6. Define partial differential equation. Discuss Laplace's equation along with its derivation.(2 + 6)",
                "6. (a) Derive a difference equation to solve Laplace equation.(3)     (b) The steady-state two-dimensional heat-flow in a metal plate is defined by . Given the boundary conditions as shown in figure below. find the temperatures at interior points A, B, C, and D.(5)",
                "6. a) How can you obtain numerical solution of a partial differential equation? Explain.(3)    b) The steady-state two-dimensional heat-flow in a metal plate is defined by Given the boundary conditions as shown in figure below, find the temperature at interior points T1, T2, T3 and T4. (5)",
                "6. Solve the equation over the square domain 0 ≤ x ≤ 1.5 and 0 ≤ y ≤ 1.5 with f=0 on the boundary [Take h = 0.5]. (8)",
                "7. Define a difference equation to represent a Laplace’s equation. Solve the following Laplace equation  For the rectangular plate given as:(3 + 5)ORDerive a difference equation to represent a Poison’s equation. Solve the Poison’s equation ∇2 f = 2x2y2 Over the domain 0 ≤ x ≤ 3, 0 ≤ y ≤ 3 with f = 0 on the boundary and h = 1. (3+5)",
                "7. How can you solve Laplace’s equation? Explain. The steady-state two dimensional heat flow in a metal plate is defined by ORA steel plate of size 30 x 30cm is given. Two adjacent sides are placed at 100°C and other side held at 0°C . Find the temperature at interior points, assuming the grid size of 10 x 10cm. (3+5)",
                "12. Solve the Poisson’s equation ∇\r\n2\r\nf=2x2\r\ny\r\n2\r\nover the square domain 0 <= x <= 3 and\r\n0 <= y <= 3 with f=0 on the boundary and h=1.",
                "12. Consider a metallic plate of size 90 cm by 90 cm. The two adjacent sides of the plate are maintained at temperature of 1000C and remaining two adjacent sides are held at 2000C. Calculate the steady state temperature at interior points assuming a grid size of 30 cm by 30 cm.",
                "11. A plate of dimension 18cm x 18cm is subjected to temperatures as follows: left side at 1000c, right side at 2000C. Upper part at 500 C, and lower at 1500C. If square grid length of 6cm x 6cm is assumed, what will be the temperature at the interior nodes?",
                "12. Solve the Poison's equation over the square domain 0 ≤ x ≤ 1.5, 0 ≤ y ≤ 1.5 with f = 0 on the boundary and h = 0.5."
            ],
            "Asked": [
                "8 marks Asked in 2066",
                "8 marks Asked in 2071",
                "8 marks Asked in 2072",
                "8 marks Asked in 2072",
                "8 marks Asked in 2073",
                "8 marks Asked in 2074",
                "8 marks Asked in 2075(OldCourse)",
                "8 marks Asked in 2069",
                "8 marks Asked in 2070",
                "8 marks Asked in 2067",
                "8 marks Asked in 2068",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2078",
                "5 marks Asked in 2077",
                "5 marks Asked in 2075(NewCourse)"
            ]
        }
    ]
}