{
    "subject": "SoftwareEngineering",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                24 Questions",
            "Question": [
                "1. Differentiate between software and software engineering. What are the characteristics and components of software? Explain.",
                "1. Differentiate between software engineering and system engineering.",
                "1. What are the different phases in software development life cycle? Explain.",
                "1. What is software? Discuss generic products and bespoke products with example. Discuss functional and non-functional system properties with example.",
                "1. Explain the software and it's characteristics.",
                "1. Explain the software engineering and its role in Nation Development.",
                "1.Explain the detail tasks in a software configuration management process with example.",
                "1. Suppose you are a Software Engineer of \"ABC Software Company\". You are developing large numbers of software. Have you faced any problems? Give your idea.",
                "2. Explain the agile software development. Compare between agile software development with prototyping software development.",
                "2. What are the key challenges facing in Software Engineering? Explain.",
                "3. Compare between verification and validation. why validation is particularly difficult process? Explain with example.",
                "4.What are the good characteristics of software? Explain.",
                "5. Explain the process of requirement engineering.",
                "4. Differentiate between software engineering and computer science?",
                "6. Differentiate between waterfall model and spiral model.",
                "7. Explain the software quality assurance with example.",
                "11. What is source code translation? Explain the program translation process with diagram.",
                "8. Discuss the structure of SRS document.",
                "12. Write short notes on:        a. Reverse engineering        b. Function point",
                "11. What is reverse engineering? Describe reverse engineering process.",
                "9. Explain with example how COCOMO can be used for software cost estimation?",
                "10. Discuss with example of reuse base software engineering.",
                "11. Write down the software version control process.",
                "12. Differentiate between Alpha testing and Beta testing."
            ],
            "Asked": [
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2071",
                "6 marks Asked in 2069",
                "6 marks Asked in 2068(II)",
                "10 marks Asked in 2077",
                "6 marks Asked in 2075",
                "10 marks Asked in 2077",
                "6 marks Asked in 2068",
                "10 marks Asked in 2077",
                "5 marks Asked in 2077",
                "5 marks Asked in 2077",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2077",
                "5 marks Asked in 2077",
                "6 marks Asked in 2074",
                "5 marks Asked in 2077",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "5 marks Asked in 2077",
                "5 marks Asked in 2077",
                "5 marks Asked in 2077",
                "5 marks Asked in 2077"
            ]
        },
        {
            "Chapter": "Unit 2: Software Processes \n                                            \n\n                                                25 Questions",
            "Question": [
                "2. Explain the prototyping model of software development.",
                "2. What is software process model? Discuss waterfall model with its merits and demerits.",
                "2. Describe spiral model with its advantages and disadvantages.",
                "2. Explain the software process model with example.",
                "2. Explain the waterfall model with its merits and demerits.",
                "2. What is software process model? Discuss reuse-oriented development in detail.",
                "2. Why do we need software process model? Discuss reuse-oriented development in detail.",
                "2. What are the major phases in the waterfall model and spiral model ? Explain.",
                "1.Differentiate between software process and software process model.",
                "2. What is waterfall model? Describe the activities of waterfall model and also mention its drawbacks.",
                "1. Explain the different software life cycle models and compare them with advantages and disadvantages.",
                "3. Explain the software specification, software validation and software evolution with example.",
                "4. Why an evolutionary prototyping is used in software development? Explain.",
                "4. Explain the concept of incremental model with example.",
                "4. Why program are developed using evolutionary development are likely to be difficult to maintain? Explain.",
                "5. Discuss evolutionary prototyping and throw-away prototyping in the software process.",
                "5. Discuss different types of rapid prototyping techniques.",
                "5. What are rapid prototyping techniques? Briefly explain different rapid prototyping techniques.",
                "5. What is rapid prototyping technique? Mention the types of rapid prototyping techniques and explain it.",
                "5. Explain why, for large systems development, it is recommended that prototypes should be throw-away prototypes.",
                "7. Explain the rapid prototyping techniques with example.",
                "9. Explain the rapid prototyping techniques.",
                "5. Differentiate between V-shape model and spiral model.",
                "12. Write short notes on (any two):        a. User Interface Prototyping         b. Software Inspection        c. Source Code Translation",
                "8. Explain the component base software engineering and its advantages."
            ],
            "Asked": [
                "6 marks Asked in 2069",
                "6 marks Asked in 2076",
                "6 marks Asked in 2074",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2068(II)",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2069",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 3: Agile Software Development \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Requirements Engineering \n                                            \n\n                                                24 Questions",
            "Question": [
                "3. What are the major tasks of requirements engineering activity? Explain.",
                "3. What are the important activities that are carried out during the feasibility study phase? Explain.",
                "4. Briefly explain functional, non-functional, and domain requirements.",
                "4. What is requirements elicitation and analysis? Discuss.",
                "4. Discuss requirements elicitation and analysis activity of requirements engineering process.",
                "4. What is a software requirement? Explain software requirement process.",
                "3. Differentiate between functional and non-functional requirements. What are the various types of functional and non-function requirements that are placed on the system? Explain with example.",
                "4. Differentiate between functional and non-functional requirements of software engineering requirements.",
                "5. What are the five desirable characteristics of a good software requirements specification (SRS) document?",
                "5. What do you mean by behavioral specifcation?",
                "5. What do you mean by software requirement? Explain the requirements engineering process with example.",
                "5. What is the need of feasibility study ? Explain the various types of feasibility study with example.",
                "6.Why do we need formal specification? Discuss behavioral specification in detail.",
                "6. Define formal specification. Explain the formal specification method used in software process.",
                "6. Why do we need formal specification? Discuss behavioral specification in detail.",
                "6. What is formal specification? Discuss interface specification in detail.",
                "6. What are the different types of requirement elicitation techniques? Explain in brief.",
                "6. Why formal specification is important for software development? Explain.",
                "7. What is software requirement specification (SPS)? Mention the principles and characteristics of SRS.",
                "6. Why elicitation and analysis is a difficult process in requirement engineering process? Explain.",
                "6. Explain formal specification in software development process.",
                "8. What do you mean by functional and non-functional requirements? Explain.",
                "8. What do you mean by formal specification? Explain.",
                "10. Differentiate between interface specification and behavioral specification."
            ],
            "Asked": [
                "6 marks Asked in 2073",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2072",
                "6 marks Asked in 2071",
                "6 marks Asked in 2074",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "6 marks Asked in 2074",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2068",
                "6 marks Asked in 2068(II)"
            ]
        },
        {
            "Chapter": "Unit 5: System Modeling \n                                            \n\n                                                4 Questions",
            "Question": [
                "1. Define software. Discuss system modeling with suitable example.",
                "1. Explain system modeling with suitable example.",
                "3. Explain the system design process.",
                "10. Differentiate between structural models and behavioral models."
            ],
            "Asked": [
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2068",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 6: Architectural Design \n                                            \n\n                                                12 Questions",
            "Question": [
                "6. Why modular decomposition is used in architectural design? Explain.",
                "7. Discuss different activities of architectural design along with the repository model.",
                "7. What is client server model? Explain the advantages and disadvantages of client server model.",
                "7. What are the advantages of designing and documenting software architecture? What is repository model?",
                "7. What are the activities of architectural design process? Discuss abstract machine model.",
                "8. What is modular decomposition? Discuss object oriented model of decomposition.",
                "8. Discuss the use of control models. Differentiate between centralized control and event based control.",
                "8. What are control models? Differentiate between centralized control and event-based control.",
                "7. What is repository model? Explain its advantages and disadvantages.",
                "10. What is software design? Explain the various principles and design concepts of software design.",
                "9. Explain the control models and its types.",
                "12. Write short notes on (any two):    a. DFD    b. Data dictionary    c. Estimation techniques"
            ],
            "Asked": [
                "6 marks Asked in 2069",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076",
                "6 marks Asked in 2076",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "6 marks Asked in 2073"
            ]
        },
        {
            "Chapter": "Unit 7: Design and Implementation \n                                            \n\n                                                10 Questions",
            "Question": [
                "6. What are the main advantages of using an object-oriented design approach over a function-oriented approach? Explain.",
                "7. Explain the sequence diagram with example.",
                "8. Draw use case diagram of credit card validation system.[Use your own assumptions].",
                "8. Draw class diagram of Library Management System [Use your own assumptions].",
                "9. Discuss sequence diagram with suitable example.",
                "9.Why do we use Use-Case diagram in object-oriented  development? Draw a Use-Case diagram for an online course registration system.",
                "9. Discuss the importance of use case diagram in object-oriented development. Draw a use case diagram for library system.",
                "11. Explain class diagram with example.",
                "11. What is USE CASE diagram? Explain with example.",
                "10. Explain the use case diagram with example."
            ],
            "Asked": [
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2074",
                "6 marks Asked in 2075",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2076",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2068"
            ]
        },
        {
            "Chapter": "Unit 8: Software Testing \n                                            \n\n                                                26 Questions",
            "Question": [
                "7. Differentiate between black box testing and white box testing.",
                "8. How software inspection improves software quality? Explain the software inspection process in brief.",
                "8. Explain the clean room software development with example.",
                "8. Explain the clean room software development with example.",
                "9. Explain the validation planning steps.",
                "9. Describe the clean room software development process.",
                "9. What are the types of software testing? Explain.",
                "6. What is software quality assurance? Explain with example.",
                "9. Explain validation and verification planning.",
                "10. Explain the reliability validation with example.",
                "10. What is verification and validation? Briefly explain verification and validation planning.",
                "10. Explain the security assessment.",
                "10. What is clean room software development? Briefly explain verification and validation planning.",
                "10. Compare and contrast between white box and black box testing.",
                "10. What is clean room software development? Discuss the characteristics of cleanroom software development.",
                "11.Discuss path testing with suitable example.",
                "11. Differentiate between verification and validation.",
                "7. Differentiate between Validation and Verification.",
                "11. What is integration testing? Differentiate between top-down and bottom-up integration testing.",
                "11. Explain the software quality standard with example.",
                "11. What is integration testing? Discuss path testing with suitable example.",
                "10. Compare between top down and bottom up testing.",
                "12. Write short notes on (any two):        a. CASE tools        b. Reverse Engineering        c. Reliability validation",
                "12. Write Short notes on:    a. Reliability validation    b. Reverse engineering",
                "11. Explain the verification and validation planning.",
                "12. Write short notes on (any two):        a. Software inspection        b. Software validation        c. Reverse Engineering"
            ],
            "Asked": [
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2074",
                "6 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "6 marks Asked in 2076",
                "6 marks Asked in 2076",
                "6 marks Asked in 2073",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2071",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2072",
                "6 marks Asked in 2075",
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2068",
                "6 marks Asked in 2068(II)"
            ]
        },
        {
            "Chapter": "Unit 9: Software Evolution \n                                            \n\n                                                4 Questions",
            "Question": [
                "7. Explain the software maintenance and its types.",
                "9. What is software quality assurance? What are the various quality concepts of SQA? Explain.",
                "9. What are the drawbacks of software reuse? Explain.",
                "12. Explain maintenance process in detail."
            ],
            "Asked": [
                "6 marks Asked in 2071(II)",
                "6 marks Asked in 2073",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion"
            ]
        },
        {
            "Chapter": "Unit 10: Software Management \n                                            \n\n                                                14 Questions",
            "Question": [
                "3. Discuss different types of risks which are likely to arise in software projects. Briefly explain risk analysis stage during risk management process.",
                "3. Define the COCOMO model with example.",
                "3. Discuss the importance of project management . What are the different  sections of project plan?",
                "3. Discuss different types of risks which are likely to occur in software projects. Briefly explain risk analysis stage of risk management process.",
                "3. What is risk management? Explain risk management process.",
                "2. In the software development process, how does software configuration management facilitate the changes that may occur during different stages of a software development life cycle? Justify your explanation with example.",
                "4. What are the different categories of software development projects according to the COCOMO estimation model? Explain.",
                "4. What do you mean by project management? Explain the project planning and project scheduling with example.",
                "3. What is project planning? Explain the types of project plan.",
                "5. What is the critical distinction between a milestone and deliverable? Explain.",
                "12. Write short notes on:        a. Functional Point        b. Source Code translation",
                "12. Write short notes on (any two):    a) Security assessment    b) Expert judgment    c) System and their environment",
                "12. Write short notes on (any two):        a. Data Flow Models        b. COCOMO model        c. Security assessment",
                "11. Discuss COCOMO model in cost estimation of the software in detail."
            ],
            "Asked": [
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071",
                "6 marks Asked in 2072",
                "6 marks Asked in 2074",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2068(II)",
                "6 marks Asked in 2071(II)",
                "10 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "5 marks Asked in ModelQuestion"
            ]
        }
    ]
}