{
    "subject": "WebTechnology",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                37 Questions",
            "Question": [
                "1.  Explain the web server\r\nconcept. Why internet is a client/server technology?",
                "1. Differentiate between 2-Tier, 3-Tier and n-Tier.",
                "1.  Explain the 2-Tier, 3-Tier\r\nand n-Tier technology with its architecture.",
                "1.  Define HTTP. Explain the overall function of HTTP with example.",
                "1.  How does a web server link\r\nphysically on the Internet? How do we navigate from one URL to another from a\r\npage displayed at a browser? Explain.",
                "1.  Explain the architectural issues of\r\nweb layer with example.",
                "2.  List the protocols and their use at the application layer in the Internet. Why World Wide Web is use? Explain.",
                "2.  What is FTP? Discuss its functions in detail.",
                "2.  Differentiate\r\nbetween HTTP and FTP. Discuss 3-tier technology with suitable example.",
                "2.  Explain the client tier with example.",
                "3.  What is HTTP? Discuss its function in detail.",
                "4.  List the common application of web server.",
                "4.  Discuss internet as a client/server technology.",
                "4.  What is client/server technology? Differentiate\r\nbetween web client and web server.",
                "4. Describe client server architecture with its types.",
                "4.  What is client/server technology?\r\nDiscuss Internet as a client/server technology.",
                "4.  Explain the uses of a web server.",
                "5.  Explain the functions of web caches.",
                "5.  Explain the SMTP with example.",
                "5.  Write short notes on various services offered by the Internet.",
                "6.  What are the different types of headers in an HTTP\r\nmessage from a client? Explain.",
                "6.  What is the functionality and purpose of HTTP?",
                "4. What is HTTP protocol? Define HTTP Request and Response.[2+3]",
                "8.  Explain the client/server concepts of web.",
                "8.  Describe HTTP with its header fields.",
                "9. Explain about domain name and domain name system.",
                "9.  Discuss different types of client server architectures.",
                "9.  What is FTP?",
                "9.  What is HTTP?",
                "10.  What is Web server\nsoftware? Discuss its role on the Internet.",
                "10.  What is web client? Discuss its role on the internet.",
                "11.  What are the essential features of web browser? Explain.",
                "11.  Explain briefly, how the domain names are translated\r\nto IP addresses.",
                "12.  Explain the client/server concepts of web.",
                "12.  Differentiate between domain name and domain name system.",
                "12.  Describe\r\nthe significance of IP addresses and\r\ntheir types.",
                "13.  Write short notes on:        a)      \r\nSMTP        b)      \r\nXQuery"
            ],
            "Asked": [
                "10 marks Asked in 2068",
                "10 marks Asked in 2073",
                "10 marks Asked in 2069",
                "10 marks Asked in 2074",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2075",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2071",
                "10 marks Asked in 2072",
                "10 marks Asked in 2073",
                "10 marks Asked in 2071-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2071",
                "5 marks Asked in 2071-II",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2069",
                "5 marks Asked in 2076",
                "5 marks Asked in 2073",
                "5 marks Asked in 2076",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2071",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2069",
                "5 marks Asked in 2075"
            ]
        },
        {
            "Chapter": "Unit 2: Hyper Text Markup Language \n                                            \n\n                                                20 Questions",
            "Question": [
                "1. Explain the structure of HTML file with example. How is HTML different from CSS? Explain three different ways for inserting CSS code into an HTML file.﻿",
                "2.  Define DTD. What are its applications? Create the HTML document with the paragraph\nusing <p>,<h1>, <strong> for\r\nthe first word for every sentence and <em> for all the capital letters.",
                "3.  Using test structuring toys,\r\ncreate a homepage for the curriculum vitae. Save at web server that is local or\r\non the internet. Later view it using the browser.",
                "4.  What are the tags and attributes for a table in HTML document?",
                "4.  What is HTML? Differentiate between \"get\" and \"post\" methods used to send form data.",
                "4.  What is the structure of HTML file?\r\nExplain with example.",
                "5.  How can you draw a table in\r\nHTML? Discuss with suitable example.",
                "5.  Discuss the structure of\r\nHTML document with suitable example.",
                "5. Write a HTML script to insert audio file in a HTML page? Use the controls and autoplay properties.",
                "5.  Write and HTML code to display a\r\nsimple form for user login.",
                "6.  What are the color attributes in HTML? Explain.",
                "6.  Write and HTML code to display the following:",
                "6.  Write an HTML\r\ncode to display the following:\n\n\n\nID\n\n\nName\n\n\nAddress\n\n\nAge",
                "6.  Write HTML script for displaying table with following output.",
                "6.  Write\r\nan HTML code to display the following:",
                "7.  What are the attributes of list tag? Explain.",
                "7.  What are the visibility and display properties of HTML elements? Explain with example.",
                "5. Create a HTML page with tags header, article and footer. Insert alink containing mail to info@iost.edu.np in the footer tag. Set the keywords \"iost\", \"csit\" using Meta tag in the page.[5]",
                "12. Write HTML script for displaying div with following output. The div should be floating right.",
                "12. Why inline frames are used? Create a HTML page containing iframe within a paragraph. The iframe have source to http://www.tuiost.edu.np and its height and width are 200px and 400px respectively.[1+4]"
            ],
            "Asked": [
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2068",
                "10 marks Asked in 2069",
                "4 marks Asked in 2068-II",
                "5 marks Asked in 2074",
                "5 marks Asked in 2075",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2069",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2072",
                "5 marks Asked in 2076",
                "5 marks Asked in 2071",
                "5 marks Asked in 2068",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)"
            ]
        },
        {
            "Chapter": "Unit 3: Cascading Style Sheets \n                                            \n\n                                                13 Questions",
            "Question": [
                "4.  Explain with example the basic concept of cascading and inheritance in CSS.",
                "4.  How external style sheets can be inserted in a HTML document? Illustrate with example.",
                "3. How positioning of HTML elements can be done using CSS? Create a HTML page with a div with some content and two paragraph with some contents having id p1 and p2. Write external CSS for the div tag having fixed position with border style solid and width 2 px. the p1 should have relative position. The font type of p1 should be Arial and color should be red. The p2 have absolute position  with top 0px and left 200px.[2+8]",
                "5.  Define CSS? How can you use an\r\nexternal CSS? Explain.",
                "5.  What is CSS? How can you use an internal CSS? Explain.",
                "6. What is CSS selector? Compare id selector with class selector.",
                "7.  How can you insert inline style\r\nsheet in the HTML document? Discuss with example.",
                "7.  How\r\ncan you insert external style sheets in your HTML document? Discuss with example.",
                "7.  How can you insert internal style sheet in your HTML document? Discuss with example.",
                "8. Write a HTML script containing use of media query for changing the background-color of html page to black if the viewport is 600 pixels wide or more than that otherwise if the viewport is less than 500 pixels, the background-color should be changed to red.﻿",
                "9.  How XSL is different from CSS? Explain.",
                "12.  Discuss about normal flow box layout in CSS and also discuss about positioning in CSS.",
                "11. How web pages can be made responsive using media queries ? Illustrate with an example.[2+3]"
            ],
            "Asked": [
                "5 marks Asked in 2073",
                "5 marks Asked in 2076",
                "10 marks Asked in 2076(new)",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2072",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2071",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2068",
                "5 marks Asked in 2073",
                "5 marks Asked in 2076(new)"
            ]
        },
        {
            "Chapter": "Unit 4: Client Side Scripting with JavaScript \n                                            \n\n                                                22 Questions",
            "Question": [
                "1.  Design a form containing text box for username, password field for password, radio button for gender and checkbox for hobbies. Write a program for  client-side validation of the form for the username and password field as required fields, length of username should be 5, the radio button and checkbox should be checked.",
                "2. Write HTML Script for creating a form containing text box for username, password field for password, and checkbox for Education fields. Write a JavaScript function for the validation of the form for all of the fields as required. In addition length of username should at least 4, the password should start with digit and end with $.﻿",
                "3.  Design DOM for the time\r\ntable of your classes in the present semester. Save at web server that is local\r\nor on the Internet. Later view it using the browser.",
                "3.  What is DOM Hierarchy? Explain the use of *, ? and + in defining a DOM element.",
                "2. How can you create objects in Javascript? Create a HTML page containing a division with image and its description in paragraph. Write a javascript function to change the value of description in the paragraph during onmouseover and mouseout event on the image.[4+6]",
                "5.  What are the two traditional ways of assigning event handlers in DOM? Explain.",
                "5.  What do you mean by cookie? Write a Javascript code to handle cookie?",
                "6.  Explain about to charge an HTML element with the help of DOM.",
                "6.  How can you define event handler? Write\na Javascript to demonstrate event handling.",
                "6.  How can you define event handler? Write a JavaScript to demonstrate event handling.",
                "7.  What are the important uses of cookies? Give some examples.",
                "7. Write a JavaScript code to create an array of elements {csit, it, bca, bim}. Display the array in body of HTML.",
                "8.  Write an example of client\r\nside script to validate a form.",
                "8.  Write a simple client side script to set and\r\nretrieve cookies.",
                "8.  Discuss the use of Cookies with suitable example.",
                "9.  Write a simple client-side script\r\nto set and retrieve cookies.",
                "10. Discuss different types of jQuery Selectors with examples.",
                "6. How jQuery animate can be used to create custom animation? Write syntax with sample script.[2+3]",
                "7. What is the use of JSON? How can you parse a JSON, illustrate with an example.[1+4]",
                "11.  Explain about client side programming with example?",
                "13.  Write short notes\non:\na.       HTML DOM\nb.       Tag libraries",
                "13.  What do you mean by cookies?\r\nExplain with example."
            ],
            "Asked": [
                "10 marks Asked in 2076",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2068",
                "10 marks Asked in 2068-II",
                "10 marks Asked in 2076(new)",
                "5 marks Asked in 2073",
                "5 marks Asked in 2076",
                "5 marks Asked in 2073",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2071",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2075",
                "5 marks Asked in 2072",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2073",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2068-II"
            ]
        },
        {
            "Chapter": "Unit 5: AJAX and XML \n                                            \n\n                                                33 Questions",
            "Question": [
                "2.  Create a small XML file\r\ndesigned to contain information about student performance on a module. Each\r\nstudent has a name, roll no, a subject mark and an exam mark.",
                "2. Define XML schema. Compare it with DTD. Write a schema to describe \"name\" as a root element and \"first_name\",\"middle_name\" and \"last_name\" as child elements.",
                "2.  Explain the use of XML in web development. Write internal and external DTD to describe \"mail\" as a root\r\nelement and \"to\", \"from\", and \"subject\", and\r\n\"message\" as child elements.",
                "2.  What is the use of XSLT? Create a XML file with elements and elements having attributes. Write the equivalent XSLT of the XML for rendering as a HTML document in a browser.",
                "2.  What is XML? Discuss the\r\nstructure of XML file with example. Write an XML schema to describe “address”\r\nas an element and “city, state, street and house-no” as its attributes.",
                "3.  Discuss the benefits of\r\nusing XML. Differentiate XML schema with DTD. Write an XML DTD to describe\r\n“person” as an element and “Name, address, phone-no, and Age” as its attributes.",
                "3. Explain about XML and how to create HTML document with the help of XML.",
                "3.  What are elements and attributes of XML document? What is XML schema? Differentiate XML schema with DTD. Write a simple example of DTD.",
                "7.  How to transform XML documents to others forms? Explain.",
                "7.  What are the advantages of using XML? Explain the rules for writing XML.",
                "7.  Compare XML schema with DTD.",
                "7.  Explain the XML syntax and structure rules.",
                "8.  How to represent data types in XML schema? Explain.",
                "8.  Mention the application of XSL.",
                "8.  What are the advantages of XML over the HTML?",
                "9.  How is XML defined? What are\r\nthe benefits of using XML namespace?",
                "9. What is XML namespace? How it is used in XML files?",
                "10.  Discuss the rules of writing\r\nXML document.",
                "9.  Why do we need XSLT? Explain XSL <xls:for-each> Element.",
                "9.  Why do we need XSLT? Explain XSL<xsl:if> Element.",
                "9.  What are the benefits and\r\ndrawbacks of using XML name space?",
                "10.  What are the various contents of an element in a\r\nDTD? Explain.",
                "10.  What is the syntax of declaring an attributes in a DTD?",
                "10.  Why is it important to specify a DTD for an XML\r\ndocument? Explain.",
                "10.  Discuss public external declaration of DTD with example.",
                "10.  Discuss the private external\r\ndeclaration of DTD with example.",
                "10.  Consider a XML file containing element name city <city> </city>. Now write its equivalent XSD to limit the content of city to a set of acceptable values from \"PKR\", \"KTM\", \"NPJ\".",
                "11.  How attributes and elements are defined in a DTD? Illustrate with an example.",
                "11.  What are the components of an XML file? Explain.",
                "8. What is XML? Create an XML file containing records of employee having elements of simple and complex types.[1+4]",
                "9. How XSD of a XML file is created? Illustrate with an example.[2+3]",
                "13.  Write short notes on:        a) XML Namespace        b) HTML DOM",
                "13.  Write short notes on:        a) POP        b) XPath"
            ],
            "Asked": [
                "10 marks Asked in 2069",
                "10 marks Asked in 2074",
                "10 marks Asked in 2075",
                "10 marks Asked in 2076",
                "10 marks Asked in 2071-II",
                "10 marks Asked in 2071",
                "10 marks Asked in 2073",
                "10 marks Asked in 2072",
                "5 marks Asked in 2073",
                "5 marks Asked in 2074",
                "5 marks Asked in 2075",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2073",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2071",
                "5 marks Asked in 2075",
                "5 marks Asked in 2074",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068-II",
                "5 marks Asked in 2068",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2072",
                "5 marks Asked in 2076",
                "5 marks Asked in 2076",
                "5 marks Asked in 2068",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076",
                "5 marks Asked in 2074"
            ]
        },
        {
            "Chapter": "Unit 6: Server Side Scripting using PHP \n                                            \n\n                                                28 Questions",
            "Question": [
                "1.  Develop a website that\r\nchecks validity of a user during the log-in process. Assume that the login data\r\n(username and password) are already stored in a database. Use client-side\r\nscript to validate the user input during login\nprocess.",
                "1.  Develop a simple website\nthat stores its contents in a database\nand displays those contents from the database. Assume at least five different contents.",
                "1.  Develop a simple website\r\nthat asks the users to register using username, password, and email address.\r\nStore these information’s in a database. Use client side script to validate the\r\nuser input during registration.",
                "1.Create web form for book search catalog. The form should contain a dropdown defining search type, a text box for search keyword, a radio button for download type true or false, now write PHP script to store data from the form into database table and also retrive the results from stored table in a new page.[10]",
                "3.  Develop a simple Web site that takes first name, last name and address from the user and\nstores this information in the database.\nUse JavaScript to validate form data.",
                "3. Prepare a form that should contain text box, selection list and radio button. Write PHP script to store data from the form into database using database connection and appropriate query.",
                "3.  Construct a web page that takes name, address, and phone number from the user and stores this information in the database using server side script. Use JavaScript to validate form data for phone number.",
                "3.  Prepare a form that should contain text box for name and email, selection list for country. Write a server side script to store data from the form into database. The script should contain connection to database and appropriate query into the database.",
                "8.  Write an example\r\nof server-side script to update data in the database.",
                "8.  Discuss the use of Session with suitable example.",
                "10.  How you can create dynamic content? Explain.",
                "11.  Discuss the importance of session.",
                "11. Write a PHP script that illustrates handling of cookie.﻿",
                "11.  Write server-side code to select\r\ndata stored in the database.",
                "11.  Define session. Explain its use with example.",
                "11.  Why do we need session?\r\nExplain with suitable example.",
                "11.  Write a server-side code to insert data in the database.",
                "12.  What are anti-overloaded techniques in web server?",
                "12.  Discuss server side file\r\nhandling with example.",
                "12.  Discuss anti-overload techniques\r\nin webserver.",
                "12.  Discuss about authentication by IP addressing and domain.",
                "12.  Discuss integrated window authentication.",
                "12.  How session handling is done in server side scripts?",
                "13.  Differentiate between file\r\nhandling and form handling.",
                "13.  Explain the form handling with example.",
                "13.  Write short notes on:\na.      \r\nX Query\nb.     \r\nTag libraries",
                "13.  Write short notes on:\n\na.      \r\nTag libraries\nb.     \r\nAnonymous access",
                "10. How can you define variables in PHP? Define any two variable of string types and display their results after concatenation.[1+4]"
            ],
            "Asked": [
                "5 marks Asked in 2071",
                "10 marks Asked in 2072",
                "10 marks Asked in 2071-II",
                "10 marks Asked in 2076(new)",
                "10 marks Asked in 2075",
                "10 marks Asked in ModelQuestion",
                "10 marks Asked in 2074",
                "10 marks Asked in 2076",
                "5 marks Asked in 2072",
                "5 marks Asked in 2074",
                "5 marks Asked in 2073",
                "5 marks Asked in 2072",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2075",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2071",
                "5 marks Asked in 2074",
                "5 marks Asked in 2071-II",
                "5 marks Asked in 2071",
                "5 marks Asked in 2072",
                "5 marks Asked in 2074",
                "5 marks Asked in 2075",
                "5 marks Asked in 2076",
                "5 marks Asked in 2069",
                "5 marks Asked in 2068",
                "5 marks Asked in 2072",
                "5 marks Asked in 2071",
                "5 marks Asked in 2076(new)"
            ]
        }
    ]
}