{
    "subject": "WirelessNetworking",
    "questions": [
        {
            "Chapter": "Unit 1: Introduction \n                                            \n\n                                                94 Questions",
            "Question": [
                "1. What are the difference between wired and wireless communication networking? Explain the wireless communication standards. (2+4)",
                "1. Explain the challenges in wireless communication networking. Define wireless communication standards.(3+3)",
                "1. Discuss about the difficulty of wireless communication network. Write the features of 3rd generation wireless communication network.(4+2)",
                "1. What are the challenges to implement Wireless Communications over the diverse geographic distribution at rural Nepal? Suggest best wireless communication standards to avoid the challenges identified.(6)",
                "1. Define wireless communication. Compare first and second generation cellular system. [1+5]",
                "2. Find the median path loss using Okumura's model for d = 50km, the = 100m, hre = 10m in a suburdan environment. If the base station transmitter an EIRP of 1KW  at a carrier frequency of 900MHt. Find the power at the receiver (assume a unity gain receiving antenna).(6)",
                "2. A GSM system operating at 900 MHz needs a receiver sensitivity of 50 dBm at a distance of 500m from the transmitter. Transmitting antenna gain and receiving antenna gain are 10dB and 8dB respectively. At what power level the signal should be transmitted to satisfy the above condition? Use free space path loss model. [6]",
                "2. Explain the linear time-invariant channel model.(6)",
                "2. What is the difference Wireless LAN and Wireless PAN? Describe the basics of wireless MAN.(6)",
                "1. What do you mean by multipath propagation? Explain the effects of multipath propagation briefly. Calculate the median path loss using Okumura’s model for the distance of 30Km with base station antenna height of 30m and mobile station height of 2m in a suburban environment. If the base station transmitter radiates an EIRP of 1KW at a carrier frequency of 900MHz, find the power at the receiver (assume a unity gain receiving antenna).",
                "1. What are the advantage of Wireless Network? Discuss the development of 1G to 3G Wireless Network.",
                "2. Explain the types of small scale fading (including time delay and Doppler spread) (6)",
                "1. What are the major challenges in wireless communication network? How can we combat those challenges? (3+3)",
                "2.Consider a Transmitter which radiates a sinusoidial carrier frequency of 1850 MHz. For a vehicle moving 60mph, compute the received carrier frequency if the mobile is moving (a) directly towards the transmitter.(b)directly towards the transmitter and (c) in direction which is perpendicular to the direction of the transmitted signal.(2+2+2)",
                "3. The transmitted signal is given by:g(t) = e-ut, 0 ≤ t ≤ Twhere T is the symbol interval. The signal is corrupted by additive white Gaussian noise with zero mean and two-sided power spectral density none wat / Hz. The optimum detector is the matched filter.a) Find the sketch impulse response of the filter which is matched to the original g(t).b) Derive the output of the filter.(3+3)",
                "3. Explain the power spectral density with example.(6)",
                "3. Discuss briefly any two digital modulation techniques. (3+3)",
                "2. What are Doppler Effect and Doppler shift? Calculate Doppler shift for a person walking at a 3 km/hr in 900 MHZ cellular system. (6)",
                "2. What is conflict free multiple access? List out the conflict free multiple access technologies used in wireless communication and explain each briefly.",
                "3. Define modulation. Explain minimum shift keying (MSK) modulation technique. [1+5]",
                "3. Briefly explain the pass loss model and the 4-PSK Modulation technique.(6)",
                "4. What do you mean by channel impairment mitigation techniques? Explain.(6)",
                "1. Calculate the median path loss using Okumura's model for the distance of 75km with base station height of 5m in a saburban environment. If the base station transmitter radiates an EIRP of 1KW at a carrier frequency of 900MHz, find the power at the receiver assuming unity gain for the receiving antenna.[10]",
                "4. What are the techniques to mitigate fading effects in wireless communications? Briefly discuss different types or diversity.(3+3)",
                "3. Draw the transmitter and Receiver of QPSK and derive the expression for transmitted signal and received signal.(6)",
                "4. Explain the types of diversity with its application example. (6)",
                "4. Why diversity is used in wireless communication? Explain different diversity mechanism. [1+5]",
                "4. What is modulation? Discuss the advantage and disadvantage of QPSK.(2 + 2 + 2 )",
                "3. Define modulation. Explain QPSK modulation technique.",
                "3. What is interference? Explain the co-channel and adjacent channel interference? How can the effects of such interferences be minimized? Explain briefly.",
                "5. What is the difference between co-channel interference and adjacent channel interference? Derive the equation for the signal to interference ratio. (2+4)",
                "5. Define cell cluster concept. Explain the call blocking and delay at the cell-site.(6)",
                "2. Differentiate between low pass, and pass, and high pass transmission. Explain SIP architecture.(4+6)",
                "5. Consider a cellular system in which there are total of 1001 radio channels available for handling traffic. Suppose the area of a cell is 6 km2 and the area of the area of the entire system is 2100km2.a) Calculate the system capacity if the cluster size is 7. b) How many times would the cluster of size 4 have to be replicated in order to approximately cover the entire cellular area?c) Calculate the system capacity if the cluster size is 4.(2 + 2 + 2)",
                "5. Define co-channel cell. Find the distance between the nearest co-channel cell in hexagonal topology with necessary diagram. [1+5]",
                "4. Why channel equalization is used in wireless communication? Explain linear channel equalization. (1+5)",
                "5. Discuss benefits and drawbacks of Mobile Ad-Hoc networks.(6)",
                "4. Determine the power spectral density (PSD) of BPSK signal. Compare the PSD of QPSK, MSK and BPSK.(4+2)",
                "6. Explain the causes of channel interference. Determine Frequency reuse distance for cell radius 5KM and cluster sire of 7.(2+4)",
                "8. What is the meaning of frequency re-use and re-framing? Explain with example. (6)",
                "6. Define the following terms properly. (3x2)a) Radio cellb) Random Accessc) Control Channel",
                "5. Define co-channel interference and adjacent channel interference. In a cellular system, the acceptable signal-to-cochannel interference ratio is 20dB. From the measurement the path loss exponent is found to be 4. What is the minimum cluster size? (2+4)",
                "6. Explain the conflict-free multiple access technologies.(6)",
                "6. What is interference? Write the type of interference in cellular system. Derive the expression for frequency reuse ration in terms of signal to interference ratio.(1 + 2 + 3)",
                "3. What is conflict free multiple access? List out the conflict free multiple access technologies used in wireless communication and explain each briefly.(2+8)",
                "5. Prove the acual between the centers of two adjacent co channel cells D = √3N R (6)Where N = Cluster size            R = Radius of hexagonal cells.",
                "6. Define adjacent channel interference. Explain how adjacent channel interference can be reduced. [2+4]",
                "7. Explain frequency division multiple access technique. [6]",
                "7. How cell sectoring can be used to increase the capacity of a cellular system? Explain. What are the drawbacks of cell sectoring? (4+2)",
                "7.What is CDMA? Write the advantage and disadvantage of CDMA over DMA and FDMA techniques.(2+2+2)",
                "6. Consider a cellular system with 416 radio channels available for handling traffic. Suppose 21 of their channel are designed to control channels. Let the average channel holding time of a call be 3 minutes, the blocking probability during busy hours be 2%, and the frequency reuse factor be 9.a. Determine the number of calls per hour.b.Determine the signal to channel interference ratio in dB.(3+3)[At 2% blocking probability with 44 available channel, the traffic load is 34.683 Erlanas]",
                "4. What are the different wireless communication standards? List out various WLAN standards with typical features of each.",
                "6. Explain briefly about different techniques for capacity increase in cellular system.",
                "7. What is call admission control (CAC)? Explain with example.(6)",
                "7. What are different multiple access technololgies available for wireless communication? Explain the different types of soft and hard handoffs supported by CDMA systems.(2+4)",
                "7. Explain time division multiple access technique. (3+3)",
                "8. Differentiate between internet protocol(IP) and transmission control protocol(TCP).(6)",
                "8. Define handoff. Explain briefly about different handoff strategies. [2+4]",
                "8. Write the steps of handoff procedure in intraswitch Handoff Design. Explain with suitable signaling sequence diagram.(6)",
                "8. What are the differences between cell splitting and cell sectoring? Explain the concept of mobility management with the basic functions performed by the location management.(2+4)",
                "5. What is bandpass transmission? Why is it used? Explain MPSK.",
                "7. What is multiple Access? What are the type of multiple Access? Why CDMA is superior than TDMA.",
                "9. Write and discuss about the Ad-Hoc Routing protocols. Write the application of Ad-Hoc Network.(2+2+2)",
                "6. What is handoff in wireless communication? When is it required? Explain the handoff management procedure.",
                "9. Explain in detail the wireless Ad-Hoc network with neat diagram. (6)",
                "9. Write briefly on operation of mobile IP. [6]",
                "8. Describe the steps involved in setting up the call between MSC and the called MSC with flow diagram. (6)",
                "8. Write the procedure for location update and call setup for the two-tier network architecture of IS-41.(6)",
                "9. Differentiate between co-channel and adjacent channel interface.(6)",
                "9. Define the following terms properly:(3x2)a) Large scale path lossb) Frequency re-uaec) Frequency re-farming",
                "9. Write about Mobile IPV6 operation. Write its advantages(4+2)",
                "9. Write short notes on MIPv6. Also mention the advantages over MIPv4. (6)",
                "10. Write short notes on(any two):(3x2)a) Channel Assignment Strategiesb) Error probability in the transmissionc) CAC",
                "10. Write short notes on (any two)(a) Near-far effect(b) OFDM(c) Aloha(d) Mobile TCP hierarchy",
                "10. Write short notes on (any two): (3+3)a) Channel Equalizationb) Forward Channelc) Transmission Error",
                "7. How location management is done in cellular networks? Explain briefly.",
                "4. Why wireless communication standards are required? Explain IEEE 802 15 (1+4)",
                "10. Write short notes on(any two):(2x3)a) Hard and soft Handoffb) IP-based Networkc) OFDM transmitter and receiver block diagrams) EIRP",
                "10. Write short notes on (any two): (2x3)a) Small- scale multipath fadingb) Decision regions",
                "10. Write short notes on(any two):a) Transmission control protocol(TCP)b) MSK and GMSKc) Handoff design issuesd) Hata model for path loss",
                "10. Write short notes on (Any TWO): (2×3)a) Fadingb) Probability of error of BPSKc) Alohad) Call Admission Control (CAC)",
                "8. List out the different mobile routing protocols and explain the function of any one protocol.",
                "5. Differentiate between time invariant and time variant system with examples.(5)",
                "9. What is mobile-TCP? How it differs with classical TCP? Explain with typical features of mobile-TCP.",
                "6. What is the use of power spectral density? Define OFDM.(2+3)",
                "7. How linear equalization is carried out? Define FDMA.(2+3)",
                "10. What are the features of 4G? Explain the challenges to 4G services.",
                "8. What is frequency reuse? How can it be achieved? Why is it  necessary?(1+2+2)",
                "11. What is software defined wireless networks? Explain with its architecture.",
                "12. Write short notes on: (2 x 2.5)a. Wireless application protocolb. RFID",
                "9. Why handoff is required in wireless communication? Explain its procedure.(2+3)",
                "10. Compare and contrast on IPv4 and IPv6 packets. Which is better and why?(4+1)",
                "11. What are the vision and main features of 5G? Explain RFID.(2+3)",
                "12. Write short notes on(2x2.5)a. Open BTSb. Tunneling"
            ],
            "Asked": [
                "6 marks Asked in 2075",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076",
                "6 marks Asked in 2067",
                "6 marks Asked in 2073",
                "6 marks Asked in 2067",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2069",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2069",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2067",
                "6 marks Asked in 2076",
                "6 marks Asked in 2071",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2075",
                "6 marks Asked in 2067",
                "6 marks Asked in 2073",
                "6 marks Asked in 2068",
                "10 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "6 marks Asked in 2071",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2067",
                "6 marks Asked in 2068",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2076",
                "6 marks Asked in 2075",
                "6 marks Asked in 2075",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2073",
                "10 marks Asked in 2076(new)",
                "6 marks Asked in 2069",
                "6 marks Asked in 2067",
                "6 marks Asked in 2067",
                "6 marks Asked in 2075",
                "6 marks Asked in 2073",
                "6 marks Asked in 2069",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076",
                "6 marks Asked in 2068",
                "6 marks Asked in 2071",
                "6 marks Asked in 2067",
                "6 marks Asked in 2073",
                "6 marks Asked in 2076",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2069",
                "6 marks Asked in 2073",
                "5 marks Asked in ModelQuestion",
                "6 marks Asked in 2075",
                "6 marks Asked in 2067",
                "6 marks Asked in 2068",
                "6 marks Asked in 2069",
                "6 marks Asked in 2071",
                "6 marks Asked in 2076",
                "6 marks Asked in 2069",
                "6 marks Asked in 2068",
                "6 marks Asked in 2076",
                "6 marks Asked in 2067",
                "6 marks Asked in 2075",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "6 marks Asked in 2073",
                "6 marks Asked in 2071",
                "6 marks Asked in 2069",
                "6 marks Asked in 2068",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in ModelQuestion",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)",
                "5 marks Asked in 2076(new)"
            ]
        },
        {
            "Chapter": "Unit 2: Wireless Channel Characterization \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 3: Wireless Communication Techniques \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 4: Fundamental of Cellular Communications \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 5: Mobility Management in Wireless Networks \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 6: Overview of Mobile Network and Transport Layer \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        },
        {
            "Chapter": "Unit 7: Advances in Wireless Networking \n                                            \n\n                                                0 Questions",
            "Question": [],
            "Asked": []
        }
    ]
}